

update study_program_details
set
    general_information='Целта на оваа студиска програма е да одговори на ова барање и да понуди образовани програмери кои се спремни за вклучување на пазарот на трудот. Брзиот развој во областа бара и соодветни измени и модификации на постоечките високо-образовни курсеви со цел во истите да се вклучат новите достигнувања но, и да се прилагодат на потребите на самата индустрија. Студиската програма вклучува практични курсеви кои се наменети да им овоможат на студентите да се стекнат со потребните вештини за дизајн, развој и тестирање на софтверски апликации. Истата обезбедува едукација на програмери кои не само што ќе можат да одговорат на потребите на брзо растечката софтверска индустрија туку ќе овозможат и нејзин понатамошен развој. За таа цел студиската програма ќе ги подготви студентите и за потребата за доживотно учење со што истите ќе може да ги следат сите измени во софтверската индустрија. Студиите се дизајнирани на начин кој овозможува на студентите кои успешно ќе ги завршат, да можат да продолжат и да се доедуцираат на некоја од останатите насоки на ФИНКИ со цел да може да стекнат повисок степен на образование.',
    graduation_title='Висок стручен програмер',
    graduation_title_en='Bachelor of Applied Science in programming (180 ECTS)'
where id='SSP23_3';



update study_program_details
set
    general_information='Целта на оваа студиска програма е да одговори на ова барање и да понуди образовани програмери кои се спремни за вклучување на пазарот на трудот. Брзиот развој во областа бара и соодветни измени и модификации на постоечките високо-образовни курсеви со цел во истите да се вклучат новите достигнувања но, и да се прилагодат на потребите на самата индустрија. Студиската програма вклучува практични курсеви кои се наменети да им овоможат на студентите да се стекнат со потребните вештини за дизајн, развој и тестирање на софтверски апликации. Истата обезбедува едукација на програмери кои не само што ќе можат да одговорат на потребите на брзо растечката софтверска индустрија туку ќе овозможат и нејзин понатамошен развој. За таа цел студиската програма ќе ги подготви студентите и за потребата за доживотно учење со што истите ќе може да ги следат сите измени во софтверската индустрија. Студиите се дизајнирани на начин кој овозможува на студентите кои успешно ќе ги завршат, да можат да продолжат и да се доедуцираат на некоја од останатите насоки на ФИНКИ со цел да може да стекнат повисок степен на образование. ',
    graduation_title='Виш стручен програмер',
    graduation_title_en='Bachelor of Applied Science in programming (120 ECTS)'
where id='SSP23';



