insert into accreditation ("year", active_from, active_to, is_active)
values ('2018', '2018-09-01', '2023-08-31', false),
       ('2013', '2013-09-01', '2018-08-31', false);

insert into study_program(code, name)
values ('KNIA13', 'Англиски - Студии за компјутерски науки и инженерство'),
       ('IKI13', 'Информатика и компјутерско инженерство'),
       ('INFO13', 'Професионални студии по информатика'),
       ('ASI13', 'Академски студии по информатика'),
       ('PIT13', 'Професионални студии по информатички технологии'),
       ('KE13', 'Студии за информатичка едукација'),
       ('PET13', 'Студии за примена на е-технологии'),
       ('MT13', 'Студии за мрежни технологии'),
       ('KNI13', 'Студии за компјутерски науки и инженерство'),
       ('PET18', 'Студии за примена на е-технологии'),
       ('SIIS18', 'Софтверско инженерство и информациски системи'),
       ('KN18', 'Компјутерски науки'),
       ('KI18', 'Компјутерско инженерство'),
       ('KE18', 'Компјутерска едукација'),
       ('IMB18', 'Интернет, мрежи и безбедност');

insert into study_program_details (id, name_en, "order", duration_years, duration_semesters,
                                   study_cycle, accreditation_year, on_english, bilingual)
values ('KNIA13', 'Англиски - Студии за компјутерски науки и инженерство', '1', '4', '8', 'UNDERGRADUATE', '2013', '1',
        '0'),
       ('IKI13', 'Информатика и компјутерско инженерство', '9', '4', '8', 'UNDERGRADUATE', '2013', '0', '0'),
       ('INFO13', 'Професионални студии по информатика', '8', '3', '6', 'UNDERGRADUATE', '2013', '0', '0'),
       ('ASI13', 'Академски студии по информатика', '7', '4', '8', 'UNDERGRADUATE', '2013', '0', '0'),
       ('PIT13', 'Професионални студии по информатички технологии', '6', '3', '6', 'UNDERGRADUATE', '2013', '0', '0'),
       ('KE13', 'Студии за информатичка едукација', '5', '4', '8', 'UNDERGRADUATE', '2013', '0', '0'),
       ('PET13', 'Студии за примена на е-технологии', '4', '4', '8', 'UNDERGRADUATE', '2013', '0', '0'),
       ('MT13', 'Студии за мрежни технологии', '3', '4', '8', 'UNDERGRADUATE', '2013', '0', '0'),
       ('KNI13', 'Студии за компјутерски науки и инженерство', '2', '4', '8', 'UNDERGRADUATE', '2013', '0', '0'),
       ('PET18', 'Студии за примена на е-технологии', '1', '4', '8', 'UNDERGRADUATE', '2018', '0', '0'),
       ('SIIS18', 'Софтверско инженерство и информациски системи', '2', '4', '8', 'UNDERGRADUATE', '2018', '0', '0'),
       ('KN18', 'Компјутерски науки', '3', '4', '8', 'UNDERGRADUATE', '2018', '0', '0'),
       ('KI18', 'Компјутерско инженерство', '4', '4', '8', 'UNDERGRADUATE', '2018', '0', '0'),
       ('KE18', 'Компјутерска едукација', '5', '4', '8', 'UNDERGRADUATE', '2018', '0', '0'),
       ('IMB18', 'Интернет, мрежи и безбедност', '6', '4', '8', 'UNDERGRADUATE', '2018', '0', '0');

insert into subject(id, name, semester, weekly_auditorium_classes, weekly_lab_classes, weekly_lectures_classes)
values ('CSEW101', 'Структурно програмирање', 'WINTER', '2', '0', '3'),
       ('CSEW104', 'Калкулус 1', 'WINTER', '2', '0', '3'),
       ('CSEW103', 'Дискретна математика 1', 'WINTER', '2', '0', '3'),
       ('CSEW102', 'Вовед во информатика', 'WINTER', '2', '0', '3'),
       ('CSEW105', 'Професионални вештини', 'WINTER', '2', '0', '3'),
       ('CSEW106', 'Вовед во интернет', 'WINTER', '2', '0', '3'),
       ('CSEW107', 'Логички кола и дискретни автомати', 'WINTER', '2', '0', '3'),
       ('CSEW108', 'Математика 1', 'WINTER', '2', '0', '3'),
       ('CSEW301', 'Алгоритми и податочни структури', 'WINTER', '2', '0', '3'),
       ('CSEW302', 'Компјутерски мрежи', 'WINTER', '2', '0', '3'),
       ('CSEW303', 'Веројатност и статистика', 'WINTER', '2', '0', '3'),
       ('CSEW109', 'Основи на електрични кола', 'WINTER', '2', '0', '3'),
       ('CSEW304', 'Интерактивни апликации', 'WINTER', '2', '0', '3'),
       ('CSEW305', 'Интернет програмирање', 'WINTER', '2', '0', '3'),
       ('CSEW306', 'ИТ системи за учење', 'WINTER', '2', '0', '3'),
       ('CSEW307', 'Калкулус 3', 'WINTER', '2', '0', '3'),
       ('CSES201', 'Објектно-ориентирано програмирње', 'SUMMER', '2', '0', '3'),
       ('CSES202', 'Архитектура и организација на компјутери', 'SUMMER', '2', '0', '3'),
       ('CSES203', 'Дискретна математика 2', 'SUMMER', '2', '0', '3'),
       ('CSEW308', 'Линеарна алгебра', 'WINTER', '2', '0', '3'),
       ('CSEW309', 'Логичко и функционално програмирање', 'SUMMER', '2', '0', '3'),
       ('CSES204', 'Калкулус 2', 'SUMMER', '2', '0', '3'),
       ('CSEW310', 'Маркетинг', 'WINTER', '2', '0', '3'),
       ('CSES210', 'Основи на Веб дизајн', 'SUMMER', '2', '0', '3'),
       ('CSEW312', 'Мултимедијални технологии', 'WINTER', '2', '0', '3'),
       ('CSEW313', 'Напредно програмирање', 'WINTER', '2', '0', '3'),
       ('CSES207', 'Компјутерски компоненти', 'SUMMER', '2', '0', '3'),
       ('CSEW316', 'Системска анализа и дизајн', 'WINTER', '2', '0', '3'),
       ('CSEW314', 'Објектно ориентирана анализа и дизајн', 'WINTER', '2', '0', '3'),
       ('CSEW315', 'Основи на Телекомуникации', 'WINTER', '2', '0', '3'),
       ('CSEW317', 'Формални јазици и автомати', 'WINTER', '2', '0', '3'),
       ('CSEW501', 'Менаџмент информациски системи (Антовски/Јовановиќ)', 'WINTER', '2', '0', '3'),
       ('CSEW502', 'Микропроцесорски системи', 'WINTER', '2', '0', '3'),
       ('CSEW503', 'Бази на податоци', 'WINTER', '2', '0', '3'),
       ('CSEW504', 'Администрација на мрежни сервиси', 'WINTER', '2', '0', '3'),
       ('CSES205', 'Бизнис и менаџмент', 'SUMMER', '2', '0', '3'),
       ('CSEW505', 'Анализа на софтверски барања', 'WINTER', '2', '0', '3'),
       ('CSEW506', 'Веб програмирање', 'WINTER', '2', '0', '3'),
       ('CSES208', 'Математика 2', 'SUMMER', '2', '0', '3'),
       ('CSEW507', 'Визуелизација', 'WINTER', '2', '0', '3'),
       ('CSEW508', 'Виртуелни општества', 'WINTER', '2', '0', '3'),
       ('CSES209', 'Модерна физика', 'SUMMER', '2', '0', '3'),
       ('CSEW509', 'Вовед во роботика', 'WINTER', '2', '0', '3'),
       ('CSEW510', 'Дигитализација и е-презентација', 'WINTER', '2', '0', '3'),
       ('CSES211', 'Eлектротехника и компјутерски науки', 'SUMMER', '2', '0', '3'),
       ('CSES206', 'Компјутерски архитектури', 'SUMMER', '2', '0', '3'),
       ('CSES407', 'Дигитална електроника', 'SUMMER', '2', '0', '3'),
       ('CSES406', 'Визуелно програмирање', 'SUMMER', '2', '0', '3'),
       ('CSES403', 'Софтверско инженерство (Ѓорѓевиќ/Маџаров)', 'SUMMER', '2', '0', '3'),
       ('CSES417', 'Основи на компјутерската графика', 'SUMMER', '2', '0', '3'),
       ('CSES408', 'Интернет технологии', 'SUMMER', '2', '0', '3'),
       ('CSES404', 'Теорија на информации со дигитални комуникации', 'SUMMER', '2', '0', '3'),
       ('CSES402', 'Вештачка интелигенција', 'SUMMER', '2', '0', '3'),
       ('CSES411', 'Концепти на информатичко општество', 'SUMMER', '2', '0', '3'),
       ('CSES413', 'Медиуми и комуникации', 'SUMMER', '2', '0', '3'),
       ('CSES416', 'Обработка на слики', 'SUMMER', '2', '0', '3'),
       ('CSES401', 'Оперативни системи', 'SUMMER', '2', '0', '3'),
       ('CSES419', 'Алгоритми и сложеност', 'SUMMER', '2', '0', '3'),
       ('CSES405', 'Безжични и мобилни системи', 'SUMMER', '2', '0', '3'),
       ('CSEW522', 'Напреден веб дизајн', 'WINTER', '2', '0', '3'),
       ('CSES410', 'Комуникациски технологии', 'SUMMER', '2', '0', '3'),
       ('CSES418', 'Случајни процеси', 'SUMMER', '2', '0', '3'),
       ('CSES622', 'Податочно рударство', 'SUMMER', '2', '0', '3'),
       ('CSES612', 'Електронска и мобилна трговија', 'SUMMER', '2', '0', '3'),
       ('CSES604', 'Вградливи компјутерски системи', 'SUMMER', '2', '0', '3'),
       ('CSES412', 'Кориснички интерфејси', 'SUMMER', '2', '0', '3'),
       ('CSES615', 'Компајлери', 'SUMMER', '2', '0', '3'),
       ('CSES625', 'Развојни процеси на информациски системи', 'SUMMER', '2', '0', '3'),
       ('CSES621', 'Паралелно програмирање', 'SUMMER', '2', '0', '3'),
       ('CSES630', 'Современи компјутерски архитектури', 'SUMMER', '2', '0', '3'),
       ('CSES613', 'ИКТ во образованието', 'SUMMER', '2', '0', '3'),
       ('CSES635', 'Учење на далечина', 'SUMMER', '2', '0', '3'),
       ('CSES619', 'Напредни бази на податоци', 'SUMMER', '2', '0', '3'),
       ('CSES616', 'Мобилни апликации', 'SUMMER', '2', '0', '3'),
       ('CSES602', 'Безбедност на компјутерски системи', 'SUMMER', '2', '0', '3'),
       ('CSES629', 'Складови на податоци и аналитичка обработка', 'SUMMER', '2', '0', '3'),
       ('CSES609', 'Дизајн на компјутерски мрежи', 'SUMMER', '2', '0', '3'),
       ('CSES601', 'Администрирање на ИТ системи', 'SUMMER', '2', '0', '3'),
       ('CSES610', 'е-Влада', 'SUMMER', '2', '0', '3'),
       ('CSES614', 'Интелигентни системи', 'SUMMER', '2', '0', '3'),
       ('CSES603', 'Безжични мултимедиски системи', 'SUMMER', '2', '0', '3'),
       ('CSES607', 'Дигитални библиотеки', 'SUMMER', '2', '0', '3'),
       ('CSES617', 'Моделирање на бизнис процеси', 'SUMMER', '2', '0', '3'),
       ('CSES618', 'Мрежна безбедност', 'SUMMER', '2', '0', '3'),
       ('CSES620', 'Неструктурирани бази на податоци', 'SUMMER', '2', '0', '3'),
       ('CSES627', 'Сензорски системи', 'SUMMER', '2', '0', '3'),
       ('CSEW511', 'Дизајн и архитектура на софтвер', 'WINTER', '2', '0', '3'),
       ('CSEW512', 'Дизајн на образовен софтвер', 'WINTER', '2', '0', '3'),
       ('CSES628', 'Сервисно Ориентирани Архитектури', 'SUMMER', '2', '0', '3'),
       ('CSEW513', 'Дистрибуирани системи', 'WINTER', '2', '0', '3'),
       ('CSEW514', 'Имплементација на системи со отворен код', 'WINTER', '2', '0', '3'),
       ('CSES632', 'Теорија на сообраќај', 'SUMMER', '2', '0', '3'),
       ('CSEW515', 'Компјутерска етика', 'WINTER', '2', '0', '3'),
       ('CSES633', 'Управување со мрежи', 'SUMMER', '2', '0', '3'),
       ('CSEW516', 'Криптографија', 'WINTER', '2', '0', '3'),
       ('CSEW517', 'Машинско учење', 'WINTER', '2', '0', '3'),
       ('CSES606', 'Географски информациони системи', 'SUMMER', '2', '0', '3'),
       ('CSEW518', 'Мобилни IP мрежи', 'WINTER', '2', '0', '3'),
       ('CSES605', 'Виртуелна реалност', 'SUMMER', '2', '0', '3'),
       ('CSEW519', 'Мобилни платформи и програмирање', 'WINTER', '2', '0', '3'),
       ('CSEW520', 'Мрежни оперативни системи', 'WINTER', '2', '0', '3'),
       ('CSES801', 'Биокибернетика', 'SUMMER', '2', '0', '3'),
       ('CSES805', 'Интелигентни информациски системи', 'SUMMER', '2', '0', '3'),
       ('CSEW521', 'Мултимедиски системи', 'WINTER', '2', '0', '3'),
       ('CSES806', 'Компјутерска анимација', 'SUMMER', '2', '0', '3'),
       ('CSES634', 'Управување со ИКТ проекти', 'SUMMER', '2', '0', '3'),
       ('CSEW523', 'Напредна интеракција човек компјутер', 'WINTER', '2', '0', '3'),
       ('CSES631', 'Софтверски квалитет и тестирање', 'SUMMER', '2', '0', '3'),
       ('CSES812', 'Физички дизајн и имплементација на информациски системи', 'SUMMER', '2', '0', '3'),
       ('CSEW526', 'Пресметување со високи перформанси', 'WINTER', '2', '0', '3'),
       ('CSES803', 'Вовед во биоинформатика', 'SUMMER', '2', '0', '3'),
       ('CSEW527', 'Системи на знаење', 'WINTER', '2', '0', '3'),
       ('CSES626', 'Роботика', 'SUMMER', '2', '0', '3'),
       ('CSEW528', 'Управување со техничка поддршка', 'WINTER', '2', '0', '3'),
       ('CSEW701', 'Анализа и дизајн на ИС', 'WINTER', '2', '0', '3'),
       ('CSES802', 'Виртуелизација и пресметување во облак', 'SUMMER', '2', '0', '3'),
       ('CSEW702', 'Веб базирани системи', 'WINTER', '2', '0', '3'),
       ('CSES804', 'Вовед во когнитивни науки', 'SUMMER', '2', '0', '3'),
       ('CSEW703', 'Вовед во препознавање на облици', 'WINTER', '2', '0', '3'),
       ('CSES809', 'Моделирање и симулација на комуникациски мрежи', 'SUMMER', '2', '0', '3'),
       ('CSEW705', 'Иновации во ИКТ', 'WINTER', '2', '0', '3'),
       ('CSEW707', 'Компјутерски поддржано производство', 'WINTER', '2', '0', '3'),
       ('CSES810', 'Операциони истражувања', 'SUMMER', '2', '0', '3'),
       ('CSEW708', 'Конструкција на софтвер', 'WINTER', '2', '0', '3'),
       ('CSES813', 'ARM Архитектура', 'SUMMER', '2', '0', '3'),
       ('CSES811', 'Претприемништво', 'SUMMER', '2', '0', '3'),
       ('CSEW709', 'Машинска визија', 'WINTER', '2', '0', '3'),
       ('CSEW710', 'Методологија на истражувањето во ИКТ', 'WINTER', '2', '0', '3'),
       ('CSEW711', 'Моделирање и симулација', 'WINTER', '2', '0', '3'),
       ('CSEW712', 'Мрежен софтвер', 'WINTER', '2', '0', '3'),
       ('CSEW713', 'Мрежи од следната генерација', 'WINTER', '2', '0', '3'),
       ('CSEW715', 'Мултимедиски мрежи', 'WINTER', '2', '0', '3'),
       ('CSEW716', 'Обработка на природните јазици', 'WINTER', '2', '0', '3'),
       ('CSEW717', 'Оптички мрежи и технологии', 'WINTER', '2', '0', '3'),
       ('CSEW718', 'Паралелно и дистрибуирано процесирање', 'WINTER', '2', '0', '3'),
       ('CSEW719', 'Програмирање на специјални ефекти и видео игри', 'WINTER', '2', '0', '3'),
       ('CSES608', 'Дигитално процесирање на сигнали', 'SUMMER', '2', '0', '3'),
       ('CSEW110', 'Физика', 'WINTER', '2', '0', '3'),
       ('CSEW525', 'Aпликации во Интернет на нештата', 'WINTER', '2', '0', '3'),
       ('CSEW319', 'Развој на софтвер за научни истражувања', 'SUMMER', '2', '0', '3'),
       ('AIS', 'Адаптивни информациски системи - слична е содржината со Интелигентни информациски системи', 'WINTER',
        '2', '0', '3'),
       ('F18L3W136', 'Напреден веб дизајн', 'WINTER', '2', '0', '3'),
       ('F18L1W007', 'Вовед во компјутерските науки', 'WINTER', '2', '0', '3'),
       ('F18L1W011', 'Дискретна математика', 'WINTER', '3', '0', '3'),
       ('F18L1W018', 'Професионални вештини', 'WINTER', '4', '0', '0'),
       ('F18L1W005', 'Бизнис и менаџмент', 'WINTER', '2', '0', '3'),
       ('F18L2W001', 'Алгоритми и податочни структури', 'WINTER', '2', '0', '3'),
       ('F18L2W014', 'Компјутерски мрежи и безбедност', 'WINTER', '2', '0', '4'),
       ('F18L3W008', 'Вовед во науката за податоци', 'WINTER', '2', '0', '3'),
       ('F18L3W004', 'Бази на податоци', 'WINTER', '2', '0', '4'),
       ('F18L3W024', 'Веб програмирање', 'WINTER', '2', '0', '3'),
       ('F18L2S095', 'Дигитално процесирање на слика', 'SUMMER', '2', '0', '3'),
       ('F18L3W021', 'Тимски проект', 'WINTER', '0', '0', '5'),
       ('F18L1S003', 'Архитектура и организација на компјутери', 'SUMMER', '2', '0', '3'),
       ('F18L1S023', 'Бизнис статистика', 'SUMMER', '3', '0', '3'),
       ('F18L1S026', 'Маркетинг', 'SUMMER', '2', '0', '3'),
       ('F18L2S029', 'Софтверско инженерство', 'SUMMER', '2', '0', '3'),
       ('F18L3S025', 'Електронска и мобилна трговија', 'SUMMER', '2', '0', '3'),
       ('F18L3S010', 'Дизајн на интеракцијата човек-компјутер', 'SUMMER', '2', '0', '3'),
       ('F18L3S168', 'Дипломска работа', 'SUMMER', '2', '0', '3'),
       ('F18L1W020', 'Структурно програмирање', 'WINTER', '2', '0', '4'),
       ('F18L2W006', 'Веројатност и статистика', 'WINTER', '3', '0', '3'),
       ('F18L3S012', 'Интегрирани системи', 'SUMMER', '2', '0', '3'),
       ('F18L1S016', 'Објектно-ориентирано програмирање', 'SUMMER', '2', '0', '3'),
       ('F18L1S013', 'Калкулус', 'SUMMER', '3', '0', '3'),
       ('F18L3S019', 'Софтверски квалитет и тестирање', 'SUMMER', '2', '0', '3'),
       ('F18L2W046', 'Компјутерски мрежи', 'WINTER', '2', '0', '4'),
       ('F18L2W067', 'Основи на теоријата на информации', 'WINTER', '2', '0', '3'),
       ('F18L3W065', 'Мрежна безбедност', 'WINTER', '2', '0', '3'),
       ('F18L3W060', 'Администрација на системи', 'WINTER', '2', '0', '3'),
       ('F18L3W068', 'Пресметување во облак', 'WINTER', '2', '0', '3'),
       ('F18L3W064', 'Дистрибуирани системи', 'WINTER', '2', '0', '3'),
       ('F18L1S045', 'Компјутерски архитектури', 'SUMMER', '2', '0', '3'),
       ('F18L1S066', 'Основи на сајбер безбедноста', 'SUMMER', '2', '0', '3'),
       ('F18L2S061', 'Безжични и мобилни системи', 'SUMMER', '2', '0', '3'),
       ('F18L3S059', 'Администрација на мрежи', 'SUMMER', '2', '0', '3'),
       ('F18L3S062', 'Виртуелизација', 'SUMMER', '2', '0', '3'),
       ('F18L3S063', 'Дизајн на компјутерски мрежи', 'SUMMER', '2', '0', '4'),
       ('F18L1W031', 'Дискретни структури 1', 'WINTER', '3', '0', '3'),
       ('F18L1W033', 'Калкулус 1', 'WINTER', '3', '0', '3'),
       ('F18L3S039', 'Формални јазици и автомати', 'SUMMER', '2', '0', '3'),
       ('F18L3W038', 'Програмски парадигми', 'WINTER', '2', '0', '3'),
       ('F18L3W037', 'Паралелно и дистрибуирано процесирање', 'WINTER', '2', '0', '3'),
       ('F18L1S032', 'Дискретни структури 2', 'SUMMER', '3', '0', '3'),
       ('F18L1S034', 'Калкулус 2', 'SUMMER', '3', '0', '3'),
       ('F18L2S030', 'Вештачка интелигенција', 'SUMMER', '2', '0', '4'),
       ('F18L3W035', 'Линеарна алгебра и примени', 'WINTER', '2', '0', '3'),
       ('F18L3S036', 'Машинско учење', 'SUMMER', '2', '0', '3'),
       ('F18L1W041', 'Дизајн на дигитални кола', 'WINTER', '2', '0', '3'),
       ('F18L1W049', 'Физика', 'WINTER', '3', '0', '2'),
       ('F18L2S042', 'Електрични кола', 'SUMMER', '2', '0', '3'),
       ('F18L3W048', 'Софтвер за вградливи системи', 'WINTER', '2', '0', '3'),
       ('F18L3W043', 'Информациска безбедност', 'WINTER', '2', '0', '3'),
       ('F18L3S047', 'Процесирање на сигналите', 'SUMMER', '2', '0', '3'),
       ('F18L3S040', 'Вградливи микропроцесорски системи', 'SUMMER', '2', '0', '3'),
       ('F18L1S052', 'ИТ системи за учење', 'SUMMER', '2', '0', '4'),
       ('F18L3W050', 'Дизајн на образовен софтвер', 'WINTER', '2', '0', '3'),
       ('F18L1W070', 'Педагогија', 'WINTER', '2', '0', '3'),
       ('F18L3W055', 'Мултимедијални технологии', 'WINTER', '2', '0', '3'),
       ('F18L3W058', 'Самостоен проект', 'WINTER', '2', '0', '3'),
       ('F18L2S051', 'ИКТ во образованието', 'SUMMER', '2', '0', '3'),
       ('F18L3S071', 'Психологија на училишна возраст', 'SUMMER', '2', '0', '3'),
       ('F18L3S057', 'Работа со надарени ученици', 'SUMMER', '2', '0', '3'),
       ('F18L3S056', 'Персонализирано учење', 'SUMMER', '2', '0', '3'),
       ('F18L3S054', 'Методика на информатиката', 'SUMMER', '2', '0', '3'),
       ('F18L3S069', 'Македонски јазик', 'SUMMER', '2', '0', '3'),
       ('F18L1S146', 'Основи на Веб дизајн', 'SUMMER', '2', '0', '3'),
       ('F18L3S113', 'Компјутерска анимација', 'SUMMER', '2', '0', '3'),
       ('F18L3W081', 'Визуелизација', 'WINTER', '2', '0', '3'),
       ('F18L2S114', 'Компјутерска графика', 'SUMMER', '2', '0', '3'),
       ('F18L2W167', 'Шаблони за дизајн на кориснички интерфејси', 'WINTER', '2', '0', '3'),
       ('F18L3W152', 'Програмирање на видео игри', 'WINTER', '2', '0', '3'),
       ('F18L3S083', 'Виртуелна реалност', 'SUMMER', '2', '0', '3'),
       ('F18L2W109', 'Интернет програмирање на клиентска страна', 'WINTER', '2', '0', '3'),
       ('F18L3W108', 'Интернет на нештата', 'WINTER', '2', '0', '3'),
       ('F18L3S135', 'Мултимедиски системи', 'SUMMER', '2', '0', '3'),
       ('F18L2W165', 'Управување со техничка поддршка', 'WINTER', '2', '0', '3'),
       ('F18L3S101', 'Етичко хакирање', 'SUMMER', '2', '0', '3'),
       ('F18L1S120', 'Креативни вештини за решавање проблеми', 'SUMMER', '2', '0', '3'),
       ('F18L3W133', 'Мрежна и мобилна форензика', 'WINTER', '2', '0', '3'),
       ('F18L3W160', 'Софтверски дефинирани мрежи', 'WINTER', '2', '0', '3'),
       ('F18L3W075', 'Анализа и дизајн на ИС', 'WINTER', '2', '0', '3'),
       ('F18L2S124', 'Медиуми и комуникации', 'SUMMER', '2', '0', '3'),
       ('F18L3S028', 'Претприемништво', 'SUMMER', '2', '0', '3'),
       ('F18L3W103', 'Имплементација на софтверски системи со слободен и отворен код', 'WINTER', '2', '0', '3'),
       ('F18L2S164', 'Теорија на информации со дигитални комуникации', 'SUMMER', '2', '0', '3'),
       ('F18L3S127', 'Мобилни апликации', 'SUMMER', '2', '0', '3'),
       ('F18L3W117', 'Компјутерски поддржано производство', 'WINTER', '2', '0', '3'),
       ('F18L3S091', 'Географски информациски системи', 'SUMMER', '2', '0', '3'),
       ('F18L1S116', 'Компјутерски компоненти', 'SUMMER', '2', '0', '3'),
       ('F18L2S099', 'Е-влада', 'SUMMER', '2', '0', '3'),
       ('F18L2S100', 'Економија за ИКТ инженери', 'WINTER', '2', '0', '3'),
       ('F18L3W131', 'Моделирање и симулација', 'WINTER', '2', '0', '3'),
       ('F18L3S130', 'Моделирање и менаџирање на бизнис процеси', 'SUMMER', '2', '0', '3'),
       ('F18L3S125', 'Мерење и анализа на интернет сообраќај', 'SUMMER', '2', '0', '3'),
       ('F18L3W129', 'Мобилни платформи и програмирање', 'WINTER', '2', '0', '3'),
       ('F18L3W079', 'Веб базирани системи', 'WINTER', '2', '0', '3'),
       ('F18L2W140', 'Напредно програмирање', 'WINTER', '2', '0', '4'),
       ('F18L2S017', 'Оперативни системи', 'SUMMER', '2', '0', '3'),
       ('F18L3W154', 'Рударење на масивни податоци', 'WINTER', '2', '0', '2'),
       ('F18L2S082', 'Визуелно програмирање', 'SUMMER', '2', '0', '3'),
       ('F18L3W126', 'Методологија на истражувањето во ИКТ', 'WINTER', '2', '0', '3'),
       ('F18W3S085', 'Вовед во биоинформатиката', 'WINTER', '2', '0', '3'),
       ('F18L3W137', 'Напредна интеракција човек компјутер', 'WINTER', '2', '0', '3'),
       ('F18L3S132', 'Модерни трендови во роботика', 'SUMMER', '2', '0', '3'),
       ('F18L3W074', 'Администрација на бази податоци', 'WINTER', '2', '0', '3'),
       ('F18L3W044', 'Компјутерска електроника', 'WINTER', '2', '0', '3'),
       ('F18L3W098', 'Дистрибуирано складирање на податоци', 'WINTER', '2', '0', '3'),
       ('F18L3S107', 'Интелигентни системи', 'SUMMER', '2', '0', '3'),
       ('F18L3S093', 'Дигитална форензика', 'SUMMER', '2', '0', '3'),
       ('F18L2S090', 'Вовед во случајни процеси', 'SUMMER', '2', '0', '2'),
       ('F18L3W145', 'Оптички мрежи', 'WINTER', '2', '0', '3'),
       ('F18L2S119', 'Концепти на информатичко општество', 'SUMMER', '2', '0', '3'),
       ('F18L3S149', 'Паралелно програмирање', 'SUMMER', '2', '0', '3'),
       ('F18L3S122', 'Криптографија', 'SUMMER', '2', '0', '3'),
       ('F18L2W104', 'Инженерска математика', 'WINTER', '2', '0', '3'),
       ('F18L3S077', 'Безжични мултимедиски системи', 'SUMMER', '2', '0', '3'),
       ('F18L3S141', 'Неструктурирани бази на податоци', 'SUMMER', '2', '0', '3'),
       ('F18L1S015', 'Објектно ориентирана анализа и дизајн', 'SUMMER', '2', '0', '3'),
       ('F18L3S087', 'Вовед во мрежна наука', 'SUMMER', '2', '0', '3'),
       ('F18L3W089', 'Вовед во препознавање на облици', 'WINTER', '2', '0', '3'),
       ('F18L3S111', 'Инфраструктурно програмирање', 'SUMMER', '2', '0', '3'),
       ('F18L3S155', 'Сервисно ориентирани архитектури', 'SUMMER', '2', '0', '3'),
       ('F18L2S110', 'Интернет технологии', 'SUMMER', '2', '0', '3'),
       ('F18L3W105', 'Иновации во ИКТ', 'WINTER', '2', '0', '3'),
       ('F18L3S094', 'Дигитални библиотеки', 'SUMMER', '2', '0', '3'),
       ('F18L3W161', 'Социјални мрежи и медиуми', 'WINTER', '2', '0', '3'),
       ('F18L3S121', 'Блоковски вериги и критовалути', 'SUMMER', '2', '0', '3'),
       ('F18L3S139', 'Напредни теми од криптографија', 'SUMMER', '2', '0', '3'),
       ('F18L3S106', 'Интелигентни информациски системи', 'SUMMER', '2', '0', '3'),
       ('F18L3W142', 'Обработка на природните јазици', 'WINTER', '2', '0', '3'),
       ('F18L2S097', 'Дизајн на алгоритми', 'SUMMER', '2', '0', '3'),
       ('F18L3W115', 'Компјутерски звук, музика и говор', 'SUMMER', '2', '0', '3'),
       ('F18L2W096', 'Дигитизација', 'WINTER', '2', '0', '3'),
       ('F18L2W147', 'Основи на комуникациски системи', 'WINTER', '2', '0', '3'),
       ('F18W3S162', 'Одржливи и енергетски ефикасни компјутерски системи', 'WINTER', '2', '0', '3'),
       ('F18L2S084', 'Вовед во екоинформатиката', 'SUMMER', '2', '0', '3'),
       ('F18L3W144', 'Операциони истражувања', 'WINTER', '2', '0', '3'),
       ('F18L3S151', 'Пресметковна биологија', 'SUMMER', '2', '0', '3'),
       ('F18L3S112', 'Програмски јазици и компајлери', 'SUMMER', '2', '0', '3'),
       ('F18L3S102', 'ИКТ за развој', 'SUMMER', '2', '0', '3'),
       ('F18L3S163', 'Статистичко моделирање', 'SUMMER', '2', '0', '3'),
       ('F18L3S080', 'Веб пребарувачки системи', 'SUMMER', '2', '0', '3'),
       ('F18L3W092', 'Дигитална постпродукција', 'WINTER', '2', '0', '3'),
       ('F18L3S138', 'Напредни бази на податоци', 'SUMMER', '2', '0', '3'),
       ('F18L3S157', 'Складови на податоци и аналитичка обработка', 'SUMMER', '2', '0', '3'),
       ('F18L3S118', 'Континуирана интеграција и испорака', 'SUMMER', '2', '0', '3'),
       ('F18L3W148', 'Основи на роботиката', 'WINTER', '2', '0', '3'),
       ('F18L3S153', 'Процесна роботика', 'SUMMER', '2', '0', '3'),
       ('F18L3W072', 'Автономна роботика', 'WINTER', '2', '0', '3'),
       ('F18L3W128', 'Мобилни информациски системи', 'WINTER', '2', '0', '3'),
       ('F18L3S162', 'Споделување и пресметување во толпа', 'SUMMER', '2', '0', '3'),
       ('F18L3W053', 'Компјутерска етика', 'WINTER', '4', '0', '0'),
       ('F18L3W156', 'Системи за поддршка при одлучувањето', 'WINTER', '2', '0', '3'),
       ('F18L3W076', 'Вовед во анализа на временските серии', 'WINTER', '2', '0', '3'),
       ('F18L3W088', 'Вовед во паметни градови', 'WINTER', '2', '0', '3'),
       ('F18L3S150', 'Податочно рударство', 'SUMMER', '2', '0', '3'),
       ('F18L3S159', 'Софтверски дефинирана безбедност', 'SUMMER', '2', '0', '3'),
       ('F18L2S002', 'Анализа на софтверските барања', 'SUMMER', '2', '0', '3'),
       ('F18L3W009', 'Дизајн и архитектура на софтвер', 'WINTER', '2', '0', '3'),
       ('F18L3S022', 'Управување со ИКТ проекти', 'SUMMER', '2', '0', '3'),
       ('F18L3W027', 'Менаџмент информациски системи', 'WINTER', '2', '0', '3'),
       ('F18L3S086', 'Вовед во когнитивни науки', 'SUMMER', '2', '0', '3'),
       ('F18L3W123', 'Машинска визија', 'WINTER', '2', '0', '3'),
       ('F18L3S166', 'Учење на далечина', 'SUMMER', '2', '0', '3'),
       ('F18L3S078', 'Биолошки инспирирано пресметување', 'SUMMER', '2', '0', '3'),
       ('F18L3S073', 'Агентно-базирани системи', 'SUMMER', '2', '0', '3'),
       ('F18L3S158', 'Современи компјутерски архитектури', 'SUMMER', '2', '0', '3'),
       ('F18L2003', 'Избрани теми од математика', 'WINTER', '0', '0', '0'),
       ('F18L1004', 'Спорт и здравје', 'WINTER', '0', '0', '0'),
       ('F18L3100', 'Деловна пракса', 'SUMMER', '0', '0', '0'),
       ('F18L1S002', 'Архитектура и организација на компјутери (ПИТ верзија)', 'SUMMER', '0', '0', '0'),
       ('F18L5W001', 'Вовед во роботика', 'WINTER', '0', '0', '0'),
       ('F18L8W001', 'Напредна роботика', 'SUMMER', '0', '0', '0');

insert into subject_details("id", "copy_of_subject_details_id", "name_en", "credits", "default_semester", "cycle",
                            "accreditation_year", "language", "content", "content_en", "goals_description",
                            "goals_description_en", "learning_methods", "quality_control", "dependencies",
                            "signature_condition", "lecture_hours", "exercise_hours", "self_learning_hours",
                            "project_hours", "homework_hours", "total_hours", "tests_points", "project_points",
                            "exam_points", "activity_points")
VALUES ('AIS', '', '', '6', '7', '1', '2013', 'Македонски и англиски', 'Работна верзија по пример од еден од најактивните професори во областа, треба да се прилагоди за нашата средина:

Here is the list of topics we may cover during the course

I. Modeling Technologies

    User models for adaptive hypermedia and adaptive educational systems
    User profiles for personalized information access
    Data mining for Web personalization
    Generic user modeling systems
    Document modeling

II. Adaptation Technologies

    Personalized search on the World Wide Web
    Adaptive focused crawling
    Adaptive navigation support
    Collaborative filtering
    Content-based filtering and recommendation
    Hybrid Web recommender systems
    Case-base recommendation
    Adaptive 3D Web sites
    Adaptive collaboration support for the Web
    Adaptive presentation for the Web
    Social Navigation
    Social Web Search

III. Applications

    Adaptive systems in health care
    Adaptive techniques in Web-based education
    Personalization in e-commerce applications
    Web-based mobile guides
    Adaptive news access

IV. Challenges

    Semantic Web metadata, ontologies, and reasoning for personalized information access on the Web
    Privacy-enhanced web personalization
    Open corpus adaptive hypermedia
    Group recommendation
    Empirical evaluation of personalized websites', '', 'Работна верзија по пример од еден од најактивните професори во областа, треба да се прилагоди за нашата средина:

The course will include several small assignments and a large group project. While the group project will be programming-oriented, it is not expected that each students who is taking this course has strong programming skills. Development of AIS requires a range of different skills such as domain analysis, algoritm design, modeling, etc. Each project team will be required a range of expertise beyond programming. Students with knowledge of mathematics, statistics, education, psychology, artificial intelligence, etc. are encouraged to take the course to attend regardless of their programming skills.',
        '', '', 'механизам на интерна евалуација и анкети', '', 'Реализирани актибвности 15.2 и 16.1', '30', '45', '15',
        '15', '75', '180', '10', '15', '70', '10'),
       ('CSES201', '', '', '6', '2', '1', '2013', 'македонски и англиски', 'Програмски парадигми. Дефиниција и основи на објектно ориентирано програмирање. Карактеристики на ОО
програмски јазици. Терминологија (објекти, класи, методи, енкапсулација, апстракција, наследување,
полиморфизам). Имплементација на методи. Конструктори. Деструктори. Преоптоварување на
конструктори.Објекти како аргументи. Вгнездување на објекти. Наследување. Повеќекратно наследување.
Конверзија меѓу основната и изведените класи. Препокривање и редефинирање на функции во изведени класи.
Полиморфизам. Апстрактни класи. Интерфејси. Исклучоци.', '', 'Целта на предметот е да го запознае студентот со основните концепти на објектно-ориентираното програмирање.
За таа цел ќе бидат воведени концептите на објекти и класи, eнкапсулација, наследување и полиморфизам.
Студентите ќе бидат запознаени и со хиерахијата на класи. Ќе се направат споредби на имплементациите на
објектно-ориентираните концепти во различни програмски јазици.
По завршување на курсот студентот ќе ги разбира принципите на објектно-ориентираното програмирање и биде
оспособен за развој на програми кои ги подржуваат овие принципи. ', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), пример случаи, поканети гости предавачи, домашни работи, самостојни проекти, учење во
електронско опкружување (форуми, консултации).
', 'механизам на интерна евалуација и анкети', '', 'реализирани активности 15.1 и 15.2', '30', '45', '15', '15', '75',
        '180', '10', '15', '70', '10'),
       ('CSES202', '', '', '6', '2', '1', '2013', 'македонски и англиски',
        'Вовед во компјутерски системи. Преглед на компјутерски архитектури и пресметковни структури. Капацитет и перформанси на компјутерски системи. Машинско претставување на броеви. Аритметички алгоритми. Организација на аритметичко-логички уред. Инструкциски формати. Процесирање на инструкции и операции. Техники на проточен дизајн, гледање на напред, повеќефунционални единици. Виртуелни машини. Виртуелна меморија. Користење на главната меморија. Параметри на мемориски системи. Типични мемориски организации. Типови на спрежни мрежи. Реални В/И шеми. Надворешни мемориски уреди. Дискови.',
        '',
        'Разбирање на главните компјутерски архитектури, проценка на перформансите на поедините делови и компјутерскиот систем во целина.',
        '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'механизам на интерна евалуација и анкети', '', '15.1 и 15.2', '30', '45', '15', '15', '75', '180', '10', '15',
        '70', '10'),
       ('F18L1S045', '', '', '6', '2', '1', '2013', 'македонски и англиски',
        'Вовед во компјутерски системи. Преглед на компјутерски архитектури и пресметковни структури. Капацитет и перформанси на компјутерски системи. Машинско претставување на броеви. Аритметички алгоритми. Организација на аритметичко-логички уред. Инструкциски формати. Процесирање на инструкции и операции. Техники на проточен дизајн, гледање на напред, повеќефунционални единици. Виртуелни машини. Виртуелна меморија. Користење на главната меморија. Параметри на мемориски системи. Типични мемориски организации. Типови на спрежни мрежи. Реални В/И шеми. Надворешни мемориски уреди. Дискови.',
        '',
        'Разбирање на главните компјутерски архитектури, проценка на перформансите на поедините делови и компјутерскиот систем во целина.',
        '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'механизам на интерна евалуација и анкети', '', '15.1 и 15.2', '30', '45', '15', '15', '75', '180', '10', '15',
        '70', '10'),
       ('CSES203', '', '', '6', '2', '1', '2013', 'македонски и англиски', '', '', 'Студентите да се запознаат со основните на Буловите алгебри и нивната улога и примена во информатичките технологии. Да
ги совладаат основните техники на броење и истите да ги применува при решавање на практични задачи. Да научи да решава
различни рекурентни равенки. Да се запознаат со матриците и нивната примена. Да ја научат основната терминологија од
теоријата на графови и да ја применуваат при моделирање и решавање на практични проблеми од областа на компјутерските
науки. ', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, аудиториски и лабораториски вежби
(користење на опрема и софтверски пакети), самостојна изработка на проектни задачи , учење во електронско опкружување
(форуми, консултации).', 'механизам на интерна евалуација и анкети', '', 'реализирани активности 15.1 и 15.2', '30',
        '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('CSES204', '', '', '6', '2', '1', '2013', 'македонски и англиски', 'Интегрирање. Неопределен интеграл. Интегрирање со замена. Определен интеграл.  Фундаментални теореми на интегрално сметање.
Техники на интегрирање: парцијална интеграција, тригонометриски интеграли, тригонометриски смени, интегрирање на дробно-рационални функции. Несвојствени интеграли. Примена на интеграли за пресметување на плоштина, волумен, должина на лак на крива, плоштина на ротациона површина. Низи и редови. Поларни координати. Функции со повеќе променливи. Парцијални изводи и двојни интеграли.',
        '', 'Предметот е од подршка и во него се воведуваат поимите за интеграл кај функции од една променлива, функции
од повеќе променливи, парцијални изводи и двојни интеграли.', '', 'Усвојување на поимите, својствата и техниките со самостојна работа; решавање на поставени
задачи и проблеми за вежбање..', 'анкети', '', 'Тестови: минимум 50 бода', '30', '45', '15', '15', '75', '180', '10',
        '15', '70', '10'),
       ('CSES205', '', '', '6', '2', '1', '2013', 'македонски', 'Основни поими и дефиниции на менаџмент; претпријатија и менаџмент; историја на науката за менаџментот; ограничувања и предизвици со кои се соочува менаџментот денес; менаџмент на промени и иновации; менаџмент на општествена одговорност и етика; менаџерите како носители на одлуки; основи на планирање; стратегиски менаџмент; алатки и техники за планирање; традиционални и современи видови дизајн на организациите; менаџмент на човечки ресурси; менаџмент на кариера; менаџмент на тимови; разбирање на однесувањето на поединците; менаџери и комуникации; мотивирање на вработените; лидерство; контролирање; менаџмент на операции; менаџмент во глобално опкружување.
1.	Менаџмент и организации
2.	Разбирање на менаџмент контекстот: ограничувања и предизвици
3.	Менаџерите како носители на одлуки
4.	Основи на планирање
5.	Стратегиски менаџмент
6.	Основен дизајн на организации, адаптивен дизајн на организации
7.	Менаџирање човечки ресурси
8.	Менаџмент на тимови
9.	Разбирање на однесувањето на поединецот
10.	Менаџери и комуникации
11.	Мотивирање на вработените
12.	Менаџери како лидери
13.	Вовед во контрола', '', 'Вовед во менаџмент.
Развој на менаџерски способности: техничка, концепциска, комуникациска, аналитичка.
Усвојување на рамки, поими, модели и техники од областа на менаџментот.
Презентирање и анализа на примери, студии на случај и најдобри менаџмент практики од повеќе бизнис области.
Како претпријатијата, во услови на пазарна економија, да го оптимизираат производството, и да го максимизираат задоволството на потрошувачите и профитот.
Презентирање и анализа на примери и студии на случај на поодделни бизниси и макроекономски трендови.', '', 'Предавања поддржани со презентации преку слајдови, вежби, тимска работа, студии на случај, изработка
на проектна задача, учење во електронско опкружување (форуми, консултации)
', 'механизам на интерна евалуација и анкети', '', 'реализирани активности 15.1 и 15.2', '30', '45', '15', '15', '75',
        '180', '10', '15', '70', '10'),
       ('CSES206', '', '', '6', '4', '1', '2013', 'македонски и англиски',
        'Вовед во компјутерски системи, теоретски основи, граници и капацитет. Перформанси, Муров и Амдалов закон. Преглед на компјутерски архитектури. Магистрална организација на процесор. Машинско претставување на броеви, аритметички алгоритми, организација на аритметичко-логичката единица. Контролна единица, инструкциски формати, процесирање на инструкции, микропрограмирање. Процесирање на адреси, гранање и прекини. Споредба на CISCи RISC архитектурите. Техники на проточен дизајн, суперскаларни процесори. Паралелни архитектури и архитектури со повеќе јадра.Организација на меморија, кеш меморија, виртуелна меморија. Главна меморија, користење и параметри. Надворешни мемориски уреди. Спрежни мрежи.',
        '',
        'Разбирање на архитектурата на еден компјутерски систем, идентификација на неговите составни делови, проценка на перформансите на компјутерскиот систем и неговите поединечни делови. Разбирање на машинскиот јазик, асемблерот и мемориската организација на системите.',
        '',
        'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'механизам на интерна евалуација и анкети', '', 'реализирани активности 15.1 и 15.2', '30', '45', '15', '15',
        '75', '180', '10', '15', '70', '10'),
       ('CSES207', '', '', '6', '2', '1', '2013', 'македонски и англиски', '', '', 'Познавање на структурата на компјутерските системи, хардверските компоненти, поврзувањето и начинот на
работа, карактеристиките и стандардите што се употребуваат.', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски симулации), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и
одбрана на проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации). ',
        'механизам на интерна евалуација и анкети', '', 'Изработени лабораториски вежби и посетување настава', '30',
        '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('CSES208', '', '', '6', '2', '1', '2013', 'македонски', 'Интегрирање. Неопределен интеграл. Интегрирање со замена. Определен интеграл.  Фундаментални теореми на интегрално сметање.
Техники на интегрирање: парцијална интеграција, тригонометриски интеграли, тригонометриски смени, интегрирање на дробно-рационални функции. Несвојствени интеграли. Примена на интеграли за пресметување на плоштина, волумен, должина на лак на крива, плоштина на ротациона површина. Основни елементи од теорија на веројатност.',
        '', 'Предметот е неопходен за воведување и совладување на поимите
за интеграција на функции, основи на веројатност.', '',
        'Усвојување на поимите, својствата и техниките со самостојна работа; решавање на поставени', 'анкети', '',
        'За потпис нема услов, за положување - мин 45%', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('CSES209', '', '', '6', '2', '1', '2013', 'македонски и англиски', 'Геометриска оптика. Физичка оптика. Фотометрија. Квантна оптика. Атомска
физика. Квантна механика. Нуклеарна физика.', '', ' Студентите ќе се запознаат со основните физички величини и
закониод модерната физика која ги вклучува оптиката, атомската и нуклеарната физика. Со проширување на
знаењата со законите од модерната физика студентите ќе имаат поширока подлога за разбирање и употребување
на физиката во информатиката и компјутерското инеженерство. ', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби
(користење на опрема и софтверски пакети), тимска работа, пример случаи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'механизам на интерна евалуација и анкети', '', 'реализирани активности 15.1 и 15.2', '30', '45', '15', '15',
        '75', '180', '10', '15', '70', '10'),
       ('CSES210', '', '', '6', '2', '1', '2013', 'македонски и англиски', 'Вовед во WWW, Историја на WWW, основи на прегледувачи
Структура на веб страници со HTML 5 тагови, својства, историја на тагови и системи. Компатибилност со поранешните верзии на HTML иXHTML.
Каскадни стилови – CSS3, својства, единици за должина, селектори, псевдоелементи, моделна кутија, позиционирање, маргини, организирање распоред на страна – методи
Вовед во дизајн, методологии,
Структура и архитектура на сајт, навигација, функционалност, Пишување за веб, типографија, Боја, концепти од дизајн, златен пресек, контраст.
Основи на Usability, Основи на Accessibility', '', 'По комплетирање на курсот кандидатите се очекува студентите да добијат воведни знаењаза развој на веб страници со
современ дизајн, употреба на ХТМЛ и каскадни стилови.
Се очекува кандидатите да
1. Демонстрираат основно разбирање на важноста на добар дизајн на веб страниците.
2. Демонстрираат практично знаење за технологиите за веб дизајн и да можат да го применат знаењето при основно
дизајнирање на веб сајтови.
3. Да комуницираат со терминологија специфична за оваа област.
4. Критички да евалуираат примери на веб сајтови.', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и
семинарска работа, учење во електронско опкружување (форуми, консултации).
', 'механизам на интерна евалуација и анкети', '', 'реализирани активности 15.1 и 15.2', '30', '45', '15', '15', '75',
        '180', '10', '15', '70', '10'),
       ('CSES211', '', '', '6', '2', '1', '2013', 'македонски и англиски', '', '', 'Запознавање со основните поими и појави од електромагнетизмот и нивно објаснување. Однесување на
отпорник, кондензатор и индуктивен елемент во електрични кола со простопериодични струи и напони,
електрични кола со индуктивно спрегнати елементи и трифазни електрични кола. Користење на основните
законитости во електротехниката при решавање на конкретни проблеми во инженерството. Примена на
електротехниката во компјутерското инженерство. ', '', 'Поим за дигитизација. Техники и технологии кои се
користат при дигитизација на разни видови материјали: текстуални записи, музика,
слики, објекти. Дигитизација на стари записи и печатени матријали. Дигитизација на
слики и звук. Дигитизација, моделирање и реконструкција на 3Д објекти: уметнички
дела, архитектонски објекти, археолошки и антрополошки артефакти. Архивирање и
презервација на различни видови дигитални материјали. Техники и технологии за
презентација на дигитизирани материјали.', 'механизам на интерна евалуација и анкети', '',
        'Изработени лабораториски вежби и посетување настава', '30', '45', '15', '15', '75', '180', '10', '15', '70',
        '10'),
       ('CSES401', '', '', '6', '4', '1', '2013', 'македонски и англиски', '', '', 'Студентот ќе биде воведен во основните градбени блокови на модерните оперативни системи преку нивна
конкретна реализација во Windows и UNIX-like системите.', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'механизам на интерна евалуација и анкети', '', 'Реализирани активности 15.1 и 15.2', '30', '45', '15', '15',
        '75', '180', '10', '15', '70', '10'),
       ('CSES402', '', '', '6', '4', '1', '2013', 'македонски и англиски', 'Што се интелигентните системи? Интелигентни агенти; Неинформирано пребарување;
Информирано пребарување; Спротивставено пребарување; Напредно пребарување;
Логички агенти; Предикатно сметање; Претставување на знаењето; Расудување во
услови на несигурност; Агенти способни да учат; Машинско учење; Генетски алгоритми
и невронски мрежи; Комуникација меѓу агентите. ', '', 'Способност да се одреди кои проблеми се решаваат со примена на методите на
интелигентните системи, да се одреди најсоодветниот начин за претставување на
соодветниот проблем и проблемот оптимално да се реши.
', '', 'предавања, аудиториски вежби, лабораториски вежби, проектни
задачи, домашни задачи
', 'механизам на интерна евалуација и анкети', '', 'Реализирани активности 15, 16', '30', '45', '15', '15', '75', '180',
        '10', '15', '70', '10'),
       ('CSES403', '', '', '6', '4', '1', '2013', 'македонски и англиски', '', '', 'Целта на предметот е запознање со: методологиите за дизајн и имплементација на софтверски системи преку
анализа на барањата, развој и анализа на дизајнот, имплементацијата, интеграцијата и тестирањето на софтверот;
анализа на проблем за развој на софтвер, дизајнирање на модуларна структура на решението која го решава
проблемот и анализа и евалуација на алтернативи; имплементација на ефикасни и исправни модули, нивна
интеграција и тестирање, планирање и водење на софтверските проекти.', '', 'предавања, аудиториски вежби, лабораториски вежби, проектни задачи, домашни задачи
', 'механизам на интерна евалуација и анкети', '', 'Реализирани активности 15, 16', '30', '45', '15', '15', '75', '180',
        '10', '15', '70', '10'),
       ('CSES404', '', '', '6', '4', '1', '2013', 'македонски и англиски', 'Основни поими од случајни процеси: дефиниција, карактеристики, стационарност. Ентропија и информација и
нивни карактеристики. Својството АЕР (Asymptotic Equipartition Property). Вериги на Марков. Рата на ентропија на
случаен процес. Компресија на податоци: оптимални кодови, Хуфманов код, Шенон-Фано-Елиас кодови,
аритметички кодови. Комуникациски канал: видови на канали, капацитет на канал. Линеарни кодови: идеална
шема на декодирање, Хамингов услов. Линеарен блок-код. Гаусов канал.
', '', 'Студентите ќе бидат запознаени со квантитативната теорија на информации и нејзината примена во надежни и
ефикасни комуникациски системи. Дополнително ќе бидат запознаени со математичкиот модел на
комунникацискиот систем.
', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'механизам на интерна евалуација и анкети', '', '15.1 и 15.2', '30', '45', '15', '15', '75', '180', '10', '15',
        '70', '10'),
       ('CSES405', '', '', '6', '4', '1', '2013', 'македонски и англиски', 'Безжичен пренос на податоци, фреквенции, сигнали, антени, мултиплексирање, спректрум. Споделување на
медиумот, SDMA, TDMA, FDMA, избегнување колизии, CDMA. Безжични телекомуникациски системи од 1G до 4G.
Безжични локални мрежи, 802.11, Bluetooth, Zigbee, 802.16. Специфичности на мрежно и транспортно ниво.
Безбедност. ', '', 'Познавање и разбирање на системите за безжична и мобилна комуникација', '', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.
', 'механизам на интерна евалуација и анкети', '', 'реализирани активности 15.1 и 15.2', '30', '45', '15', '15', '75',
        '180', '10', '15', '70', '10'),
       ('CSES406', '', '', '6', '4', '1', '2013', 'македонски и англиски',
        'Развојни околини. Настански водено програмирање. Волшебник за креирање апликации и дизајнер на форми. Контроли за приказ на информации на корисникот, контроли кои поттикнуваат настани, контроли за внесување текст, за приказ и промена на состојбата, за приказ на информации во вид на листи контроли за групирање на други контроли во рамки на апликација. Генерирање и обработка на настани. Временски поттикнати настани. Графички кориснички интерфејс за напредни апликации, локализација (l10n) и интернационализација (i18n). Кориснички менија, алатници и статусни ленти. Креирање на кориснички дефинирани контроли. Нитки и меѓупроцесна комуникација, споделување на ресурси и размена на содржина помеѓу апликации. Креирање на инсталациски пакети.',
        '', 'Со завршување на овој курс се очекува студентите да се запознаени со техниките за развивање на софтвер во
напредна интегрирана развојна околина користејќи модерен објектно-ориентиран програмски јазик, дизајнирање
на богати графички кориснички интерфејси и откривање и отстранување на грешки во истата.Се очекува
студентите да бидат оспособени за развој на настански водени апликации, развој на графички кориснички
интерфејси, напредни форми за внесување на податоци, кориснички дефинирани контроли и креирање на
инсталациски пакети.', '', 'предавања, аудиториски вежби, лабораториски вежби, проектни задачи, домашни задачи',
        'механизам на интерна евалуација и анкети', '', 'реализирани активности 15 и 16', '30', '45', '15', '15', '75',
        '180', '10', '15', '70', '10'),
       ('CSES407', '', '', '6', '4', '1', '2013', 'македонски и англиски', 'Основни закони во теоријата на електрични кола. Дигитална апстракција.
Дигитални логички кола. Мосфет. Засилувач со мосфет. Кондензатор, индуктивен елементи кола од прв ред.
Доцнење кај дигитални кола. Одзив. Состојба и дигитaлна меморија. Системи од втор ред. Импедансни модели.
Операциски засилувач и апликации', '', 'Запознавање со фундаменталните типови на електронски елементи, принципот на работа, и нивните теоретски
модели. Анализа и дизајн на логички кола и засилувачи. ', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).
', 'механизам на интерна евалуација и анкети', '', 'реализирани активности 15.1 и 15.2', '30', '45', '15', '15', '75',
        '180', '10', '15', '70', '10'),
       ('CSES408', '', '', '6', '4', '1', '2013', 'македонски и англиски', '- Архитектура на динамички веб апликации
- Комуникација на веб
- Вовед во Web Application Development
- Вовед во ASP.NET
- Основи на веб форми
- Веб контроли
- Мастер страници и теми
- Управување со состојби
- Навигација
- Работа со бази на податоци
- Работа со бази на податоци
- Сигурност на веб апликација
- СОА и веб сервиси
- MVC', '', 'Познавање на механизмите кај HTTP протоколот. Запознавање со платформи за развој на интернет апликации.
Креирање и развој на веб апликции. Креирање и користење на веб сервиси.
', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).
', 'механизам на интерна евалуација и анкети', '', '30 + 45 + 105 = 180 часа', '30', '45', '15', '15', '75', '180',
        '10', '15', '70', '10'),
       ('CSES410', '', '', '6', '4', '1', '2013', 'македонски и англиски', 'Развој на комуникацијата, основен модел на комуникациски канал. Теоретски основи на податочната
комуникација. Кабелски преносни медиуми. Кодирање на сигнали и модулација. Безжични преносни медиуми.
Комуникациски сателити. Јавни телефонски мрежи. Широкопојасни услуги. xDSL и кабелски модеми. Работа на
кабелскиот оператор.Tripleиquadrupleplay услуги. Основи на мобилните телефонски системи (1G, 2G, 3G, 4G).
Структура на SIM картички.
', '', 'Запознавање и разбирање на физичкото поврзување на комуникациските елементи во мрежите. Познавање на
можностите и ограничувања на различните видови медиуми и преноси.', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).
', 'механизам на интерна евалуација и анкети', '', 'Реализирани активности 15.1 и 15.2', '30', '45', '15', '15', '75',
        '180', '10', '15', '70', '10'),
       ('CSES411', '', '', '6', '4', '1', '2013', 'македонски', '', '', 'Целта на курсот е да се запознаат студентите со теориите и пристапите кои ја анализираат улогата на
информатичката технологија, медиумите и знаењето во модерното општество. По завршување на
модулот студентите треба да бидат способни да:
Систематски и критично дискутираат, евалуираат и ги анализираат главните теми, принципи, концепти
и теории на информатичкото општество
Применуваат различни концепти од информатичкото општество
Покажат разбирање за важноста на информатичката технологја и знаењето во модерното општество', '', 'предавања, проекти, дискусии, работилници
', '/', '', 'Реализирани активности 15, 16', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('CSES412', '', '', '6', '6', '1', '2013', 'македонски и англиски', '', '', 'Целта на курсот е студентите да ја разберат потребата од дизајнирање ефикасна комуникација меѓу компјутерот
и корисниците. По завршување на курсот се очекува студентот да демонстрира познавање на сите аспекти што го
дефинираат концептот на корисничките интерфејси, да знае да моделира и имплементира кориснички интерфејси
за апликации согласно барањата на корисниците и расположливата опрема и да знае да тестира и евалуира
интерфејси на постоечки системи.
', '', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'механизам на интерна евалуација и анкети', '', 'ит Реализирани активности 15, 16', '30',
        '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('CSES413', '', '', '6', '4', '1', '2013', 'македонски и англиски',
        'Теорија на комуникации, комуникациски модели, раскажување на приказни, јавен настап, односи со јавност, ИКТ како комуникациска алатка, Типови Медиуми, Какрактерисктики на елетронски медиуми, нови медиуми и социјални мрежи, технолошки алатки за деловна комуникација, основи на анализа на јавно мислење, дефинирање на бренд, социјалните мрежи како алатки за брендирање, виртуелни општества, основни поими за кибер-култура,',
        '', ':По завршувањето на предметот се очекува студентот да ги разбира основните
поими од комуникатологијата како наука, како и да има продлабочено знаење во примена на постоечките техники и
сознанија за подобрување за комуникацијата помеѓу чинителите на комуникацијата. Посебен осврт ќе биден даден на комуникацијата преку новите медиуми и начинот на кој новите медиуми влијаат во различни општествени сфери. Студентите ќе бидат запознаени со основните принципи за испитување на јавно мислење и користење на новите медиуми (со посебен фокус на социјалните мрежи) за градење и промовирање на бренд (личен или корпоративен).',
        '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, тимска работа, пример
случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и семинарска работа, учење во
електронско опкружување (форуми, консултации).
', 'механизам на интерна евалуација и анкети', '',
        'Редовно посетување настава (до 3 отсуства), навремно доставување домашни задачи, семинарски работи, дискусии на форум и проект',
        '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('CSES416', '', '', '6', '4', '1', '2013', 'македонски и англиски', '', '', 'По завршување на курсот се очекува студентот да ги владее и користи основните алатки и методи за обработка на
слики. ', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).
', 'механизам на интерна евалуација и анкети', '', 'реализирани активности 15.1 и 15.2', '30', '45', '15', '15', '75',
        '180', '10', '15', '70', '10'),
       ('CSES417', '', '', '6', '4', '1', '2013', 'македонски и англиски', '', '', 'Запознавање со теориски основи и концепти на 2D и 3D компјутерска графика, геометриско моделирање, трансформации,
рендерирање и генерирање криви и површини со помош на сплајнови. Практична реализација со помош на OPEN GL
библиотеки, графички софтверски пакети од тип MAYA, 3Д Max.. и сл. По завршување на курсот се очекува студентот да
демонстрира познавање на теориските основи и концепти на 2Д и 3Д компјутерската графика, да користи
OpenGLбиблиотека и графички софтверски пакети за практична реализација на проблеми од компјутерската графика.', '', '/',
        'механизам на интерна евалуација и анкети', '', '15.2, 16.1, 16.2', '30', '45', '15', '15', '75', '180', '10',
        '15', '70', '10'),
       ('CSES418', '', '', '6', '4', '1', '2013', 'македонски и англиски', 'Случајни процеси: дефиниција, карактеристики, класификација, трансформации. Стационарност на случајни
процеси. Вериги на Марков. Процеси на разгранување. Пуасонов процес. Марков процес.  Системи за масовно опслужување (системи со редици на чекање). Брауново движење (Винеров процес).',
        '', 'Да се оспособат студентите да моделираат случајни процеси за реални ситуации.
', '', 'Усвојување на поимите, својствата и техниките со самостојна работа; решавање на поставени задачи и проблеми
за вежбање; изработка на проектна задача.
', 'механизам на интерна евалуација и анкети', '', '15.1 и 15.2', '30', '45', '15', '15', '75', '180', '10', '15', '70',
        '10'),
       ('CSES419', '', '', '6', '4', '1', '2013', 'македонски и англиски', '', '', 'Овој предмет ќе го оспособи студентот со напредни позанавања за креирање и анализа на алгоритми имајќи ги предвид
анпредните алгоритамски решенија потребни за напредни изучување на поглом број области од информатичката
технологија.', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка на домашни задачи. учење во
електронско опкружување (форуми, консултации).
', 'механизам на интерна евалуација и анкети', '', 'реализирани активности 15.1 и 15.2', '30', '45', '15', '15', '75',
        '180', '10', '15', '70', '10'),
       ('CSES601', '', '', '6', '6', '1', '2013', 'македонски и англиски', '', '', 'Студентот ќе се здобие со знаење за лесно и ефикасно менаџирање на IT системи, управување со традиционалните
податочни центри, приватни и јавни облаци и клиентските компјутери и уреди. Студентот ќе може да се запознае и со
платформи за менаџирање на повеќе хипервизори, физички ресурси и апликации.', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и
семинарска работа, учење во електронско опкружување (форуми, консултации).
', 'механизам на интерна евалуација и анкети', '', '15.1 и 15.2', '30', '45', '15', '15', '75', '180', '10', '15', '70',
        '10'),
       ('CSES602', '', '', '6', '6', '1', '2013', 'македонски и англиски', '', '', 'Запознавање со постапките и механизмите за заштита кај компјутерските системи од
безбедносен аспект, како и постапки што се применуваат кај компјутерските системи за
подигање на нивото на безбедност во однос на неовластен пристап.
', '', ' Предавања, вежби, самостојна работа, проектни задачи, семинарски
работи
', 'механизам на интерна евалуација и анкети', '', 'реализирани 15 и 16', '30', '45', '15', '15', '75', '180', '10',
        '15', '70', '10'),
       ('CSES603', '', '', '6', '6', '1', '2013', 'македонски и англиски', '', '', 'Разбирање на проблемите кои се јавуваат при пренос на мултимедија во безжични мрежи. Познавање на IP
мултимедискиот подсистем и неговата работа. Поседување на знаење за практично обезбедување на QoS на
мултимедиските апликации за безжичните мобилни уреди. Познавања за карактеристиките на мултимедискиот
сообраќај', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).
', 'механизам на интерна евалуација и анкети', '', 'Реализирани активности 15.1 и 15.2', '30', '45', '15', '15', '75',
        '180', '10', '15', '70', '10'),
       ('CSES604', '', '', '6', '6', '1', '2013', 'македонски и англиски', '', '', 'Познавање на различните типови микроконтролери и употреба во вградливи компјутерски системи, системи за
работа во реално време и пресметки со мала моќност, оперативни системи за оваа намена, програмирање на
овие системи, проектирање на мали персонални уреди, мрежно поврзување во постојна мрежна архитектура.', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).
', 'механизам на интерна евалуација и анкети', '', 'реализирани активности 15.1 и 15.2', '30', '45', '15', '15', '75',
        '180', '10', '15', '70', '10'),
       ('CSES605', '', '', '6', '6', '1', '2013', 'македонски и англиски', '', '', 'Предметот треба да овозможи запознавање на студентите со концептот на виртуелна реалност, различните
видови виртуелни околини, влезно-излезните уреди, како и основни програмерски техники за дизајнирање и
развој на виртуелни околини. По завршување на курсот се очекува студентот да го разбира концептот на
виртуелната реалност, да биде во можност да ги опише карактеристиките на различните видови виртуелни
околини и да има основни познавања за дизајнирање и развој на виртуелни светови.', '', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'механизам на интерна евалуација и анкети', '', 'Реализирани активности 15.2', '30', '45',
        '15', '15', '75', '180', '10', '15', '70', '10'),
       ('CSES606', '', '', '6', '6', '1', '2013', 'македонски и англиски', '', '', 'Создавање и управување со просторни (Географски) информациони систем.
', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'механизам на интерна евалуација и анкети', '', 'реализирани активности 15.1 и 15.2', '30', '45', '15', '15',
        '75', '180', '10', '15', '70', '10'),
       ('CSES607', '', '', '6', '6', '1', '2013', 'македонски', 'Вовед дефиниција и преглед на дигитални библиотеки (ДБ). Историја, основни карактеристики и визија на ДБ.
Типови дигитални содржини и нивна организација, мета податоци, формат-специфични метаподатоци, стандарди
и практики во ДБ (OAI-PMH, Z39.50, DublinCore и други), обезбедување интероперабилност. Архитектури и системи
на ДБ, репрезентациски шеми и организација на содржини. Кориснички ориентиран дизајн на ДБ. Методи и
принципи на прибирање на информацнии семантичко прибирање на информации. Прикажување на резултатите
и интеракција со податоци, употребливост, евалуација. Управување со системите на поддршка на дигиталните
библиотеки. Зголемување перформансите. Споредба и поврзување на дигиталните и класичните библиотеки.
Заштита на дигитални содржини, авторски права. Примери на дигитални библиотеки: текстуални ДБ, стари
ракописи, видео записи, мапи и други. Улогата на дигиталните библиотеки во образованието и е-образованието.
Институционални, социални и професионални предизвици на ДБ. Идни трендови на развој во ДБ.', '', 'Запознавање на студенти со актуелните елементи од областа дигитални библиотеки (ДБ): основи и архитектури на
дигитални библиотеки, технологии, управување, организација и развој на дигитални ресурси, презентација на
знаење и негово откривање (прибирање на информации), мета-податоци, шеми и стандарди и релевантни
интелектуални права. Во зависноста од тековниот интерес студентите ќе се запознаат со конкретен апликативен
софтвер за дигитална библиотека и со практики во работењето како и евалуација на истите. По завршување на
курсот се очекува студентот да демонстрира знаење за основни елементи на ДБ, технологии за развој и изградба
на ДБ, начини на примена, управување и организација на ДБ', '',
        ' предавања, аудиториски вежби, лабораториски вежби, проектни задачи, домашни задачи',
        'механизам на интерна евалуација и анкети', '', 'Реализирани активности: лабораториски вежби и домашни задачи',
        '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('CSES608', '', '', '6', '6', '1', '2013', 'Македонски и англиски', '', '', '', '', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'механизам на интерна евалуација и анкети', '', 'Реализирани актибвности 15.2 и 16.1',
        '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('CSES609', '', '', '6', '6', '1', '2013', 'македонски и англиски',
        'Идентификација на потребите на клиентот. Анализа на целите и карактеризација на сообраќајот. Логички дизајн на мрежа. Дизајнирање на мрежната топологија, модели за адресирање и именување. Дизајнирање на кампус мрежа. Поврзување на далечина. Дизајн на IP адресна шема. Избор на протоколи. Развој на стратегии за безбедност и управување. Физички дизајн на мрежата. Избор на технологија и мрежни уреди. Дизајн на говорни и безжични мрежи. Тестирање, оптимизација и документирање на мрежниот дизајн. Работа на мрежи преку повеќе различни административни домени. Употреба на BGP протоколот за надежно упатување низ повеќе автономни системи.',
        '', 'Целта на овој курсот е да го оспособи студентот да работи со големи компјутерски мрежи и да обезбеди
колаборативна работа на различни административни региони, како и да дизајнира различни типови компјутерски мрежи според потребите на крајните корисници.',
        '',
        'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'механизам на интерна евалуација и анкети', '', 'изработени лабораториски вежби', '30', '45', '15', '15', '75',
        '180', '10', '15', '70', '10'),
       ('CSES610', '', '', '6', '6', '1', '2013', 'македонски', '1.	Вовед во е-влада; Дефинирање на информациски системи и информациската технологија; Дефинирање на јавниот сектор и примената на информациската технологија во јавниот сектор
2.	Теориски модели на управување: минимална држава; корпоративно управување; нов јавен менаџмент; добро управување;
социо-кибернетски систем; само-организирачки мрежи
3.	Фази на развој на е-влада и е-управување
4.	Придобивки и ризици на е-влада и е-управување; Дигитален јаз
5.	Теории и модели за е-управување: Модел на интеракција меѓу јавната администрација и граѓаните од аспект на информациските системи од Chadwick и May; Моделот на четири фази на Layne и Lee; Стратегиската рамка на Watson и Mundy за е-Демократија
6.	Адаптацијата на Flak и Rose на Теоријата на стеикхолдери од менаџмент теоријата кон областа на е-влада или е-управување; Моделот на Henderson и Venkatraman; Адаптација на теоријата на Henderson и Venkatraman, како доминантна теорија за примена на информациската технологија во приватниот сектор за примена во јавниот сектор
7.	Согледување на светските искуства од најважните области на примена на е-Влада и на стратегиите за примена на информациските технологии во јавниот сектор според области на примена: е-инфраструктура, е-бизнис;
8.	Примена на информациските технологии во јавниот сектор според области на примена: е-здравство, е-образование, е-партиципација
9.	Преглед на успешни стратегии на најнапредните земји од областа на е-влада: Естонија, Словенија, Австрија
10.	Преглед на успешни стратегии на најнапредните земји од областа на е-влада: Данска, Ирска, Финска, Индија, Сингапур
11.	Преглед на успешни стратегии на најнапредните земји од областа на е-влада: Европска Унија
12.	Компаративна анализа на ИКТ проектите на владите на Македонија, Естонија и Словенија
13.	Утврдување на перспективите на примената на информациската технологија во јавниот сектор и на е-влада во Република Македонија',
        '',
        'Целта на курсот е студентите да се запознаат со процесите и технологијата на е-влада. По завршувањето на курсот кандидатите ќе имаат продлабочени знаења за организацијата и процесите на испорака на информации и услуги со користење на информациски технологии на граѓаните и правните субјекти; тековните предизвици и трендови во имплементација на услугиод е-влада.',
        '', 'предавања, аудиториски вежби, лабораториски вежби, проектни задачи, домашни задачи
', 'механизам на интерна евалуација и анкети', '', 'Реализирани активности 15, 16Реализирани активности 15, 16', '30',
        '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('CSES612', '', '', '6', '6', '1', '2013', 'македонски и англиски', '', '', 'Студентот со завршување ќе се стекне со вештини за развој на апликации за е-трговија и м-трговија. Развој на е-
бизнис планови.', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).
', 'механизам на интерна евалуација и анкети', '', 'реализирани активности 15.1 и 15.2', '30', '45', '15', '15', '75',
        '180', '10', '15', '70', '10'),
       ('CSES613', '', '', '6', '6', '1', '2013', 'македонски', '', '', 'Студентите треба да се запознаат со ИКТ системите за поддршка на образованието, со современите едукативните принципи
кои се користат во процесот на учење потпомогнато со технологии. Студентите ќе се оспособат да подготвуваат часови со
помош на најновите информатички технологии применети во едукацијата', '',
        'настава, колаборативно учење. презентации, проекти', '/', '', 'Реализирани активности 15, 16', '30', '45',
        '15', '15', '75', '180', '10', '15', '70', '10'),
       ('CSES614', '', '', '6', '6', '1', '2013', 'македонски', 'Модели на реални системи (концептуални, симболички, функционални,
матрична нотација, Петри мрежи); Теорија на
учење. Поим за класификација и модели на класификатори; вовед во податочно рударење
(модели, предвидување и класификација),
биоинформатика (Централна догма во молекуларната биологија, решавање
реални проблеми, препознавање облици во биоинформатиката); Процесирање природни јазици;
когнитивна наука (Перцепција, Осознавање, Начин на меморирање и учење).
', '', 'Да се запознаат студентите со полето на Интелигентните системи, да се оспособат за решавање на
проблеми надвор од концептот
на процедурално и објектно ориентирано програмирање, да може да
согледуваат и предлагаат решенија на реални проблеми за класификација и
предвидување, да ги научат основните методи на машинското учење,
основните поими и проблеми од областа на биоинформатиката,
податочното рударство, процесирањето природни јазици,когнитивната наука', '',
        'предавања, проекти, дискусии, работилници', '/', '', 'Реализирани активности 15, 16', '30', '45', '15', '15',
        '75', '180', '10', '15', '70', '10'),
       ('CSES615', '', '', '6', '6', '1', '2013', 'македонски', ' Развој на програмските јазици. Разработка на структурата на
компајлерот со изучување на структурата на некој програмски јазик. Развој на граматики и
синтаксно ориентирани преведувачи. Лексичкаанализа. Синтакса и семантика, синтаксни дрва.
Парсирање: bottom-up и top-down. Препроцесирање, поправка на грешки, симболни
табели.Проверка на типови, семантичка проверка. Генерирање на код.Оптимизација на код.
Bootstrapping. Конструкција на компајлер со објектно ориентиранпрограмски јазик.
', '', 'Во овој предметот е студентите треба да го сфатат
процесот на конструкција на компајлер што ќе ги надгради како програмери кои навлегле во
суштината на програмските јазици. Крајната цел е студентите да конструираат компајлер.
', '', 'Предавања, вежби, проекти, семинарски
', 'Анкети, разговор со студенти.', '', 'Реализирани активности 15, 16', '30', '45', '15', '15', '75', '180', '10',
        '15', '70', '10'),
       ('CSES616', '', '', '6', '6', '1', '2013', 'македонски и англиски', '', '', 'По завршувањето на предметот се очекува студентот да ги разбира и има продлабочено знаење во примена на
технологиитеи алатките за oрганизирање, складирање, прибирање и обработка на податоци во дистрибуирана
мобилна и сеприсутна околина.', '', ' Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби
(користење на опрема и софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна
изработка и одбрана на проектна задача и семинарска работа, учење во електронско опкружување (форуми,
консултации).', 'механизам на интерна евалуација и анкети', '',
        'Редовно посетување настава (до 3 отсуства), навремно доставување на сите домашни задачи и проект', '30', '45',
        '15', '15', '75', '180', '10', '15', '70', '10'),
       ('CSES617', '', '', '6', '6', '1', '2013', 'македонски',
        'Вовед во бизнис процеси. Фази во циклусот за менаџирање на бизнис процеси. Идентификација на бизнис процеси. Јазици за моделирање на бизнис процеси. Моделирање на бизнис процеси со BPMN. Дијаграм на кореографии. Откривање на бизнис процеси. Квалитативна и квантитативна анализа на бизнис процеси. Редизајн на бизнис процеси. Автоматизација на бизнис процеси. Откривање на знаење за бизнис процесите.',
        '', 'По завршувањето на предметот се очекува студентот да ги разбира и има продлабочено
знаење за типови бизнис процеси и нивна поврзаност со ИС, ќе имаат продлабочено знаење
во идентификување, моделирање и мапирање разни типови бизнис процеси, ќе знаат да применат алатки и јазици за на моделирање на бизнис процеси преку соодветни дијаграми,
ќе имаат познавање од принципите за подобрување на тек на процеси, ќе имаат познавање од концептите за податочна размена и интероперабилност.',
        '', 'Предавања поддржани со презентации преку слајдови, интерактивни
предавања, вежби (користење на опрема и софтверски пакети), тимска работа, пример
случаи, самостојна изработка и одбрана на проектна задача и семинарска работа',
        'механизам на интерна евалуација и анкети', '', 'Реализирани активности 15, 16', '30', '45', '15', '15', '75',
        '180', '10', '15', '70', '10'),
       ('CSES618', '', '', '6', '6', '1', '2013', 'македонски и англиски', 'Преглед на сигурносни напади и закани. Напади на компјутерски мрежи преку рутирачки протоколи и
дистрибуирани напади на достапност на сервиси. Напади на мрежни сервиси. Заштита со огнени ѕидови. Системи
за детекција и превенција на напади. Безбедност на протоколи (IP, HTTP). Безбедносна организација на
компјутерски мрежи. Виртуелни приватни мрежи', '', 'Целта на овој курсот е да се покријат принципите за сигурноста кај компјутерските системи и мрежи, при што
студентот ќе се запознае со различни техники за напад и одбрана.Студентот ќе се запознае со техники на
пишување на безбеден код', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'механизам на интерна евалуација и анкети', '', '15.1 и 15.2', '30', '45', '15', '15', '75', '180', '10', '15',
        '70', '10'),
       ('CSES619', '', '', '6', '6', '1', '2013', 'македонски и англиски', '', '', 'Запознавање на студентите со напредните концепти на релационите бази на податоци,
неопходни при креирање, управување и одржување на базите на податоци, како и за
развој на податочно ориентирани системи. Со тоа ќе се стекант со длабоки теоретски и
практични знаења од областа на базите на податоци. Исто така, студентите ќе се
запознат со современите текови на развој и проширување на традиционланите системи
за управување на бази на податоци, а со цел да одговорат на актуелните предизвици во
информатичката тероија и практика.', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби
(користење на опрема и софтверски пакети), тимска работа, пример случаи, поканети
гости предавачи, самостојна изработка и одбрана на проектна задача и семинарска
работа, учење во електронско опкружување (форуми, консултации).
', 'механизам на интерна евалуација и анкети', '', 'реализирани активности 15.2 и 16.1 и 16.2', '30', '45', '15', '15',
        '75', '180', '10', '15', '70', '10'),
       ('CSES620', '', '', '6', '6', '1', '2013', 'македонски',
        'Вовед во полуструктурирани податоци. ObjectExchangeModel (OEM). Вовед во XML. Структура на XML документите. Шеми на податоци (DTDи XMLSchema). Препораки за трансформација на ЕЕР модели во XML шеми на податоци.Манипулација за XML документите. Користење на xPath за навигација низ XML документите. Манипулација врз XML документите преку XQuery, поставување на едноставни прашалници и користење на кориснички дефинирани функции. Вовед во NoSQL базите на податоци. Запознавање со начинот на структурирање, чување и манипулација со податоците организирани преку NoSQLбазите на податоци. Најчесто користени NoSQL бази на податоци и нивна примена во различни домени и апликации. Неструктурирани бази на податоци. Анализа и комбинација на неструктурирани со структурирани податоци. Метаподатоци кај неструктурираните податоци. Методолигија за текстуална анализа.',
        '', 'Целта на курсот е студентите да се запознаат со неструктурираните и полуструктурираните типови на податоци,
нивната организација и чување, како и техниките за манипулација и обработка на истите. Исто така студентите ќе
бидат запознаени и со NoSQL базите на податоци, современи бази на податоци кои не подлежат на релациониот модел, а се користат во дистрибуирани и кластер околини.',
        '', ' предавања, аудиториски вежби, лабораториски вежби, проектни задачи, домашни задачи
', 'механизам на интерна евалуација и анкети', '', 'Реализирани активности 15, 16', '30', '45', '15', '15', '75', '180',
        '10', '15', '70', '10'),
       ('CSES621', '', '', '6', '6', '1', '2013', 'македонски и англиски', '', '', 'Истражување на алгоритмите и техниките за програмирање на најновите паралелни платформи со споделенамеморија и со
дистрибуирана меморија. Студентот ќе се запознае со теоретските и практичните (програмските) компоненти.', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и
семинарска работа, учење во електронско опкружување (форуми, консултации).
', 'механизам на интерна евалуација и анкети', '', '15.1 и 15.2', '30', '45', '15', '15', '75', '180', '10', '15', '70',
        '10'),
       ('CSES622', '', '', '6', '6', '1', '2013', 'македонски и англиски', '', '', '', '', 'предавања, аудиториски вежби, лабораториски вежби, проектни задачи, домашни задачи,
разработка на програмски пакет со методи за податочно рударење
', 'механизам на интерна евалуација и анкети', '', 'Реализирани активности 15, 16', '30', '45', '15', '15', '75', '180',
        '10', '15', '70', '10'),
       ('CSES625', '', '', '6', '6', '1', '2013', 'македонски и англиски', '', '', '', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).
', 'механизам на интерна евалуација и анкети', '', 'реализирани активности 15.2 и 16.1 и 16.2', '30', '45', '15', '15',
        '75', '180', '10', '15', '70', '10'),
       ('CSES626', '', '', '6', '6', '1', '2013', 'македонски и англиски',
        'Концепт за робот. Општи дефиниции. Директна кинематика. Инверзна кинематика. Динамика. Вештачки раце. Одечки роботи. Мобилни роботи со други видови погони.Чувствување и сензори. Роботска визија. Роботски говор. Перцепција на простор, учење на околина.Однесување кај роботи. Учечки агенти. Моделирање на интеракцијата робот-околина. Локализација. Калманови филтри. Честични филтри. Пребарување со А*. ПИД контрола и други видови на управувањекајроботите. Истовремена локализација и мапирање. Оптимизација со динамичко програмирање. Пример со програмирање на робот за работа во магацин. Мултироботски системи. Биолошки инспирирани роботи.',
        '',
        'Студентите ќе се запознаат со основите на интелигентната роботика. Студентите ќе бидат запознаени со основните техники на моделирање на околина, на интеракцијата робот-околина, како и на интеракцијата човек-робот.Се запознаваат со начините на нивна веројатносна локализација во светот и начините на веројатносна изградба на мапите како и на истовремена локализацијана роботите и мапирање на просторот. Се дефинираат видео и аудио системите кај роботите и начините за нивно управување. На крајот на курсот се дефинира однесување кајроботи и се дава осврт на роботите кои имаат можност за учење на светот околу нив.',
        '', 'Предавања, вежби, самостојна работа, проектни задачи, семинарски работи',
        'механизам на интерна евалуација и анкети', '', 'реализирани 15.1 и 15.2', '30', '45', '15', '15', '75', '180',
        '10', '15', '70', '10'),
       ('CSES627', '', '', '6', '6', '1', '2013', 'македонски и англиски', 'Материјали и технологии за микросензори. Типови на сензори. Системи за прибирање на податоци. Безжични
сензорски мрежи и системи. Алгоритми за локализација, рутирање, самоорганизирање, агрегација, фузирање и класификација на податоци. Воспоставување на сензорска инфраструктура. Покриеност со сензори и нивно
поставување. Безбедност кај сензорските системи. Софтверски платформи на ниво на јазел. Оперативни системи кај сензорските системи. Платформи и алатки за сензорски системи. Бази на податоци и предизвици кај сензорските системи. Преглед на дистрибуирани алгоритми за координација и само-организација на сензорските системи.. Современи техники за управување со податоци кај сензорските системи. Преглед на современи и идни примени на сензорските системи во заштита на природата, кај биолошките и безбедносните системи.',
        '', 'Студентот ќе биде запознаен со главните предизвици со кои може да се соочи кај сензорските системи.', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).
', 'механизам на интерна евалуација и анкети', '', '15.1 и 15.2', '30', '45', '15', '15', '75', '180', '10', '15', '70',
        '10'),
       ('CSES628', '', '', '6', '6', '1', '2013', 'македонски', '', '', 'Да се запознае со трета и четврта генерација на Интернет системи, да совлада алатки да создава софтвер како сервис, како и
со нови предизвици и можности за решенија со пресметување во облак
', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на
хардверска опрема и софтверски пакети), тимска работа, решени едноставни примери и проширување на знаењето со
посложени задачи, поканети гости предавачи, самостојна изработка на домашни задачи. учење во електронско опкружување
(форуми, консултации)', 'механизам на интерна евалуација и анкети', '', 'Реализирани активности 15.1 и 15.2', '30',
        '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('CSES629', '', '', '6', '6', '1', '2013', 'македонски и англиски', '', '', 'Запознавање со oрганизацијата и манипулацијата со податоците организирани во складови на податоци, како и
основните операции и алгоритми за работа со складови на податоци. Студентот ќе биде оспособен за
моделирање на складови на податоци, организација и манипулација со податоците сместени во складови на
податоци, изготвување на аналитички извештаи базирани на истите податоци', '',
        'предавања, аудиториски вежби, лабораториски вежби, проектни задачи, домашни задачи',
        'механизам на интерна евалуација и анкети', '', 'Реализирани активности 15, 16', '30', '45', '15', '15', '75',
        '180', '10', '15', '70', '10'),
       ('CSES630', '', '', '6', '6', '1', '2013', 'македонски', '', '', 'Разбирање на концептите и имплементациите на современите процесори. Анализа на современите процесори.
Студентот ќе биде оспособен да дизјанира, одржува и програмира компјутерски системи со современи процесори
и процесирачки елементи ', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).
', 'механизам на интерна евалуација и анкети', '', 'Реализирани активности 15.1 и 15.2', '30', '45', '15', '15', '75',
        '180', '10', '15', '70', '10'),
       ('CSES631', '', '', '6', '6', '1', '2013', 'македонски и англиски', 'Основи на тестирање на софтвер
Моделирање на софтвер со графови
Моделирање на логички изрази
Партиционирање на влезен простор
Синтаксно моделирање
Тестирање на објектно ориентирани апликации
Тестирање на веб апликации и веб сервиси
Современи трендови во тестирањето
', '', 'Целата на курсот е запознавање на студентие со потребата од тестирање на
софтвер, различните техникимоделирање на софтверот и искористување на тие модели
затестирање, како и практични работа натестирање, валидација и верификација на софтвер', '', 'Предавања, вежби, самостојна работа, проектни задачи, семинарски работи
', 'механизам на интерна евалуација и анкети', '', 'реализирани 15.1 и 15.2', '30', '45', '15', '15', '75', '180', '10',
        '15', '70', '10'),
       ('CSES632', '', '', '6', '6', '1', '2013', 'македонски и англиски', 'Вовед во теорија на сообраќај. Моделирање на временски интервали.
Процеси на пристигнување. Ерлангова формула. Системи со загуби со целосен достап. Теорија на претекување.
Повеќедимензионални системи со загуби. Димензионирање на комуникациски мрежи. Системи со задоцнување.
Марковски редови на чекање. Применета теорија на редови на чекање. Редови на чекање со повеќе видови
услуги. Мрежи од редови на чекање. Мерење на сообраќај.', '', 'Цели на предметната програма (компетенции): За инженер кој работи со мрежни технологии е корисно да има
познавања од теоријата на сообраќај заради поквалитетно дизајнирање на мрежите како и подобро користење на
нивните перформанси. Со овој курс студентите ќе се запознаат со основите на теоријата на сообраќај. Покрај
воведувањето на во алатките и техниките за анализа на сообраќајот, студентите ќе стекнат основни знаења и за
димензионирање на комуникациски системи.', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби
(користење на опрема и софтверски пакети), тимска работа, пример случаи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).
', 'механизам на интерна евалуација и анкети', '', 'Реализирани активности 15.1 и 15.2', '30', '45', '15', '15', '75',
        '180', '10', '15', '70', '10'),
       ('CSES633', '', '', '6', '6', '1', '2013', 'македонски и англиски',
        'Вовед во управување со мрежи. OAMP. TMN. Животен циклус на управување со мрежи. EMS и NMS алатки. Работа на NOC & SOC. Основни концепти. Агенти и MIBs. Организација и процеси. Протоколи за управување. SNMP, Netconf. NetFlow. syslog. YANG. Откривање и складирање на податоци. FCAPS. Интеграција на системи за управување. TMF Frameworx. TAM. SID. eTOM. Управување во SDN и NFV средина.',
        '',
        'По завршувањето на курсот се очекува студентот да ги разбира проблемите на управувањето со мрежи и да знае да ги применува на методите и алатките за управување со комуникациски мрежи.',
        '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'механизам на интерна евалуација и анкети', '', 'реализирани лабораториски вежби', '30', '45', '15', '15', '75',
        '180', '10', '15', '70', '10'),
       ('CSES634', '', '', '6', '8', '1', '2013', 'македонски и англиски', '(1) Видови на проектно управување (Agile, Extreme, Lean)
(1) Управување со тимови. Орагнизациј на тимови. Виртуелни и глобални тимови
(1) Процес за работа во тим (одговорности, состаноци, распоред на задачи).
(1) Комуникација во проектот. Разрешување на конфликти,
(1) Менаџирање и Лидерство.
(1) Управување со барања
(1) Проценка и планирање
(1) Распоред и следење
(1) Контрола на квалитет
(1) Управување со ризик
(1) Управување со конфигурација и промени
(1) Алатки за управување со проекти', '', 'По завршувањето на предметот се очекува студентот да ги разбира и има продлабочено знаење во примена на техниките и методите за управување со ИКТ проекти, да има продлабочено знаење во утврдување софтверски и системски барања, познавање на метриките за следење на проекти и евалуација, да има знаење да примени техники за управување со барањата на разни проектни интересни групи, знаење за примена на тенхики за анализа  на трошоци, знаење за изготвување на извештаи, познавање на практични софтверски алатки за управување со
проектен циклус.', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби
(користење на опрема и софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна
изработка и одбрана на проектна задача и семинарска работа, учење во електронско опкружување (форуми,
консултации).', 'механизам на интерна евалуација и анкети', '',
        'Редовно посетување настава (до 3 отсуства), навремно доставување на сите домашни задачи, семинарски работи, дискусии на форум и проект',
        '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('CSES635', '', '', '6', '6', '1', '2013', 'македонски', '-	Основи и основни концепти за учење на далечина
-	Теории за учење.
-	Примена на технологијата кај учењето на далечина.
-	Системи за учење на далечина
-	Типови и примери на системи за учење на далечина
-	Технологии и методи за планирање, развој и имплементација на системите за учење на далечина
-	Дизајн на курсеви и содржина на курсеви.
-       Дигитална содржина
-       Алатки за креирање на дигитална содржина
-	Улогата на инструкторот и ученикот кај учењето на далечина
-	Учењето на далечина и социјалните мрежи
-	Иднината на учењето на далечина', '', 'Студентите ќе се запознаат со концептот за далечинско учење, со технологиите кои го поддржуваат далечинското учење, како
и со придобивките со неговото користење. Со слушање на овој курс студентите ќе се оспособат да планираат и дизајнираат,
да научат како се имплементираат системи за далечинско учење, ќе ја осознаат разликата помеѓу курсевите кај учење на
далечина и курсевите во класичната настава, улогата на инструкторот и ученикот во овој систем, како и сегашноста и
иднината на системите за далечинско учење', '', ' настава, колаборативно учење. презентации, проекти', '/', '',
        'Реализирани активности 15, 16', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('CSES801', '', '', '6', '8', '1', '2013', 'македонски и англиски', '', '', 'Понатамошни проучувања на когнитивни, генетски, и хормонални системи кај живите организм.
', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'механизам на интерна евалуација и анкети', '', 'реализирани активности 15.1 и 15.2', '30', '45', '15', '15',
        '75', '180', '10', '15', '70', '10'),
       ('CSES802', '', '', '6', '8', '1', '2013', 'македонски и англиски', '', '', 'Овој предмет ќе го оспособи студентот со основни познавања за концептот на облак и услуги во облак како и
можност на имплементација на облак со отворен код.', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби
(користење на хардверска опрема и софтверски пакети), тимска работа, решени едноставни примери и
проширување на знаењето со посложени задачи, поканети гости предавачи, самостојна изработка на домашни
задачи. учење во електронско опкружување (форуми, консултации).
', 'механизам на интерна евалуација и анкети', '', 'Реализирани активности 15.1 и 15.2', '30', '45', '15', '15', '75',
        '180', '10', '15', '70', '10'),
       ('CSES803', '', '', '6', '8', '1', '2013', 'македонски', 'Што е биоинформатика. Централна парадигма во биоинформатиката. DNA секвенцна анализа.
RNA и предвидување на секундарна структура на протеини. Терциерни протеински структури и
нивната врска со протеинската функција. Вовед во пресметковните алатки и алгоритми за
решавање проблеми од молекуларната биологија. Поими за генска експресија и технологијата на
микрополиња. Поим за системска биологија. Управувачки стуктури во биоинформатика. DNA
програмирање. Користење геномски и протеински бази податоци. Вовед во генетско
инженерство.', '', 'Студентите да се запознаат со областите и проблемите кои ги покрива биоинформатиката, да
бидат во можност да вршат генска и протеинска секвенцна анализа, да користат биолошки бази
податоци, да ги запознаат пресметковните методи за решавање проблеми во молекуларната
биологија.', '', 'предавања, проекти, дискусии, работилници', '/', '', 'Реализирани активности 15, 16', '30', '45',
        '15', '15', '75', '180', '10', '15', '70', '10'),
       ('CSES804', '', '', '6', '8', '1', '2013', 'македонски', '1. Вовед. Што е когнитивна наука? Еволуција на умот.
2. Историја на идеите и филозофски основи на познанието.
3. Невро-анатомија и невро-физиологија.
4. Сетила (гледање, слушање, мирис, допир и други).
5. Моторика. Динамички системи.
6. Психологија на раниот детски развој.
7. Учење, меморија, фантазија. Навики и внимание.
8. Емоции.
9. Мотивација и внатрешни вредности.
10. Решавање на проблеми и донесување на одлуки.
11. Психо-лингвистика и Невро-лингвистика.
12. Когнитивно моделирање. Когнитивни архитектури.
13. Иднина на когнитивната наука.', '',
        'Целта е да се разбере како работи човечкиот мозок. Студентите ќе се запознаат со теоретските и емпириските погледи кои ја дефинираат когнитивната наука. Ќе се запознаат со истражувањата за природата на менталните процеси како перцепцијата, мислењето, меморијата, фантазијата, вниманието, јазикот, интелигенцијата, донесувањето одлуки и решавањето проблеми. Студентите ќе научат кои се алатките превземени од експерименталната психологија, наука на развојот, комјутерската наука, лингвистика, визуализацијата, филозофијата, антропологијата, бихевиоризмот, неврологијата. Курсот ќе ги поврзе сите овие пристапи кои се поврзуваат во когнитивната наука.',
        '', 'предавања, проекти, дискусии, работилници', '/', '', 'Реализирани активности 15, 16', '30', '45', '15',
        '15', '75', '180', '10', '15', '70', '10'),
       ('CSES805', '', '', '6', '8', '1', '2013', 'македонски и англиски', '', '', 'По завршување на предметот, студентот ќе биде оспособен за создавање и управување со интелигентни
информациски системи.', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'механизам на интерна евалуација и анкети', '', 'реализирани активности 15.1 и 15.2', '30', '45', '15', '15',
        '75', '180', '10', '15', '70', '10'),
       ('CSES806', '', '', '6', '8', '1', '2013', 'македонски и англиски',
        'Основни принципи на 3Д простор, опишување на дигитални сцени, хиерархиска организација, пoлигоналнa геометрија, моделирање на дигитални објекти и карактери, NURBS моделирање, деформирање на објекти, ригување на тела и карактери, принципи на анимација, анимирање на дигитални карактери, сенчање и материјали, текстурирање на објекти, UV координати, осветлување на дигитални сцени, камери, скриптирање и автоматизација, композитурање и постпродукција',
        '',
        'По завршување на курсот се очекува студентите да се оспособени за основни методи за продуктивно создавање на компјутерски базирани анимации, за работа во апликации за создавање анимации и можат самостојно да моделираат, текстурираат, ригуваат, осветлуваат, анимираат, рендерираат и композитираат дигитални сцени.',
        '', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.
', 'механизам на интерна евалуација и анкети', '', 'Реализирани активности 15.2', '30', '45', '15', '15', '75', '180',
        '10', '15', '70', '10'),
       ('CSES809', '', '', '6', '8', '1', '2013', 'македонски и англиски', 'Предности и слабости на моделирањето и симулацијата. Техники за евалуација на перформансите. Дискретно-
настанска симулациска работна рамка. Моделирање и симулација на различни нивоа од свитата мрежни
протоколи. Монте Карло симулации. Статистички распределби и генерирање на случајни броеви. Моделирање на
мрежниот сообраќај. Верификација и валидација. Визуелизација на резултатите и интерпретациј', '', 'Запознавање со техниките, методите и моделите за симулација на комуникациските мрежи. Употреба на
симулација во дизајнот и анализата на перформанси на комуникациските системи.
', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).
', 'механизам на интерна евалуација и анкети', '', 'Реализирани активности 15.1 и 15.2', '30', '45', '15', '15', '75',
        '180', '10', '15', '70', '10'),
       ('CSES810', '', '', '6', '8', '1', '2013', 'македонски и англиски', 'Вовед: Дефинирање на проблем, собирање податоци, модел на проблем (математички, логички), решавање на
модел, тестирање.
Математички модели : Математичко програмирање, Мрежни модели и оптимизација, Теорија на одлучување,
Теорија на игри, Предвидување
', '', 'Да го запознае студентот со областа проблеми и методи на операциони истражувања, проблеми на оптимизација
на проекти и оптимално управување со проекти, со методи и техники на операцисиони истражувања поврзани со
управувaчки информациски системи и информациски системи за подршка на одлучување.
', '', ' усвојување на поимите, својствата и техниките со самостојна работа; решавање на поставени
задачи и проблеми за вежбањe; самостојна изработка и одбрана на проектна задача',
        'механизам на интерна евалуација и анкети', '', 'Тестови: минимум 20 бода', '30', '45', '15', '15', '75', '180',
        '10', '15', '70', '10'),
       ('CSES811', '', '', '6', '8', '1', '2013', 'македонски и англиски',
        'Предавањата се блиски до формата на старт-ап викенд. Студентите ќе имаат можност да контактираат со многу претставници и чинители на старт-ап заедницата во Македонија. Поим на вредности од различни аспекти на чинителите во еден бизнис. Поим за иновација, типови иновација и како да се имплементира иновација во еден бизнис. Вовед во претприемнитво. Евалуација на идеи. Истражување на пазар. Бизнис и лин канвас. Типови на претставување на продукт и/или услуга. Старт-ап метрики. Раководење со финансии во старт-ап опкружување. Можни организациски структури на еден старт-ап. Принципи на скалирање на бизнис. Правна регулатива поврзани со старт-ап претпријатија во Македонија. Пристап до финансии.',
        '',
        'Студентите ќе бидат запознаени со предизвиците со кои ќе се соочат доколку се решат да започнат сопствен бизнис. Тие ќе можат да изработат иницијално истражување на пазарот, да ги дефинираат метриките со кои ќе ја следат успеноста на својот бизнис, како и да знаат како да препознаат дали обезбедиле вредност за своите клиенти. Конечно, тие ќе бидат оспособени да се претстават пред потенцијални клиенти, партнери и инвеститори.',
        '', 'Предавања поддржани со презентации преку слајдови, вежби, тимска работа, студии на случај, изработка на проектна
задача, учење во електронско опкружување (форуми, консултации)', 'механизам на интерна евалуација и анкети', '',
        'реализирани активности 15.1 и 15.2', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('CSES812', '', '', '6', '8', '1', '2013', 'македонски', '', '', 'Детално запознавање на студентите со актуелни методологии на располагање на еден систем дизајнер, за изведба на
реализација и ставање во употреба на еден ИС. Изучување на актуелни софтверски алатки за дизајн на софтвер, визуелно
програмирање, автоматизирано генерирање на софтверски код, автоматизирано тестирање.
Реализација на студија на случај на имплементација и тестирање на ИС со користење на актуелна методологија. Изучување
преку вклучување во имплементација на компоненти од реален ИС, нивно тестирање и поддршка на ниво на продукција. ', '',
        ' предавања, аудиториски вежби, лабораториски вежби, проектни задачи, домашни задачи',
        'механизам на интерна евалуација и анкети', '', 'Реализирани активности 15, 16', '30', '45', '15', '15', '75',
        '180', '10', '15', '70', '10'),
       ('CSES813', '', '', '6', '8', '1', '2013', 'македонски', '', '', 'Разбирање на ARM процесорите и принципите на вградливо програмирање
', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).
', 'механизам на интерна евалуација и анкети', '', 'Реализирани активности 15.1 и 15.2', '30', '45', '15', '15', '75',
        '180', '10', '15', '70', '10'),
       ('CSEW101', '', '', '6', '1', '1', '2013', 'македонски', 'Вовед, Поим за Информатика, Програмски јазици и парадигми, Видови податоци и операции, Алгоритми, Контролни структури, Функции,
Рекурзија, Сложени податочни структури – полиња, низи, покажувачи, Датотеки. Апликации: околина за работа со виш програмски јазик.
', '', 'Да се воведат студентите во парадигмата на структурното програмирање, да го разберат концептот на алгоритми и да се оспособат да
развиваат алгоритми, да кодират, тестираат и компајлираат програми.
Ќе бидат воведени податочните типови, контролните структури,функциите, полињата, датотеките.
', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и софтверски пакети),
пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и семинарска работа, учење во електронско
опкружување (форуми, консултации).
', 'механизам нa', '', 'реализирани активности 15.1 и 15.2', '30', '45', '15', '15', '75', '180', '10', '15', '70',
        '10'),
       ('CSEW102', '', '', '6', '1', '1', '2013', 'Македонски или англиски', 'Кус историјат на информатиката; Како функционираат сметачите?; Основи на софтверот и
различните типови апликативни програми; Основи на Интернет, Веб и мрежите;
Злонамерен софтвер и неговото спречување; Мултимедија, слика, звук, видео; Клучните
области на информатиката; Проектни задачи за манипулација со текст, табели, графикони,
слики, аудио и видео
', '', 'Солидно познавање на основите на информатичко-комуникасицките технологии, нивното
создавање, моментална состојба и иднината; начинот на кој функционираат сметачите,
основите на Веб, обработката на сликите, видеото и анимациите; клучните области на
информациско-комуникациските технологии и нивното влијание: спососност за
манипулација со текст, табели, графикони, слики, аудио и видео.
', '', 'Методи на учење:предавања, аудиториски вежби, лабораториски вежби, проектни задачи,
домашни задачи
', 'Механизам за интерна евалуација и анкети', '', 'Реализирани активности 15, 16', '30', '45', '15', '15', '75', '180',
        '10', '15', '70', '10'),
       ('CSEW103', '', '', '6', '1', '1', '2013', 'македонски или англиски',
        'Елементи од математичка логика: искази и логички операции, таблици на вистинитост и исказни формули, тавтологии и позначајни логички закони, нормални форми, исказни функции и квантификатори, правила на изведување на залучоци. Вовед во математички докази: техники на докажување. Множества, подмножества, операции со множества и нивни својства. Пресликувања (функции): дефиниција и видови пресликувања, композиција на пресликувања, инверзно пресликување. Низи. Кардиналност и преброивост. Цели броеви и деливост. Индукција и рекурзија: математичка индукција и принцип на строга математичка индукција. Аритметичка и геометриска прогресија. Рекурентни дефиниции: рекурентни функции, Фибоначиеви броеви, рекурентно дефинирани множества и структури, Релации: релации и нивни својства, претставување на релации со графови и матрици, затворање на релации, релации за еквивалентност и разбивања, релации за подредување, подредени множества, мрежи.',
        '', ' Да се запознае студентот со основните елементи од дискретнатаматематика која е основа на информатичката технологија.  Да ги користи формалните методи на симболичката логика
за моделирање на ситуации од реалниот живот вклучувајќи ги и тие од областа на компјутерските науки. Да ја
објасни со примери основната терминологија на множествата, функциите и релациите, основните операции како
и нивната примена. Да ги запознае и применува основните начини на докажување и методите на математичката
индукција.', '',
        'Усвојување на поимите, својствата и техниките со самостојна работа; решавање на поставени задачи и проблеми за вежбање.',
        'анкети', '',
        'За потпис нема услов. За положување: минимум 50% од испит или минимум 50% од колоквиуми при што од секој колок. потребен е мин од 40%',
        '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('CSEW104', '', '', '6', '1', '1', '2013', 'македонски, англиски', 'Дефиниција на функција. Својства на функции. Операции со функции. Прави. Фамилии од функции. Параметарски
равенки. Лимеси. Пресметување на лимеси. Непрекинатост. Лимеси и непрекинатост на тригонометриски
функции. Дефиниција на извод. Техники на диференцирање. Извод од тригонометриски функции. Локална линеарна апрокцимација. Диференцијал. Инверзни функции. Експоненцијални и логаритамски функции. Извод од експоненцијални и логаритамски функции. Инверзни тригонометриски функции. Лопиталово правило. Монотоност на функции. Конвексност и конкавност на функции. Локални екстреми. Испитување на својства и
скицирање на график на функција. Глобални екстреми. Теорема на Рол и теорема за средна вредност.', '', 'Предметот е од поддршка и е неопходен за воведување на поимите за функција, лимес и извод кои се неопходни
во скоро сите предмети од повисоки години.', '', 'усвојување на поимите, својствата и техниките со самостојна работа; решавање на поставени
задачи и проблеми за вежбање.', 'анкети', '', 'Тестови: минимум 50 бода', '30', '45', '15', '15', '75', '180', '10',
        '15', '70', '10'),
       ('CSEW105', '', '', '4', '1', '1', '2013', 'Англиски и македонски', 'Академско пишување - пасус и есеј.
Аплицирање за работа/стипендија - ЦВ, писмо за мотивација, препорака, интервју
Стручен и научен труд (во научни и професионални списанија)
Техничко пишување - видови технички текстови (елаборат, спецификација, извештај, техничка документација)
 Презентација - комуникација со публика и пренесување на идеи', '', '', '', 'Предавања со користење на презентации, интерактивни предавања, тимска работа, пример случаи, поканети
гости предавачи, самостојни задачи, самостојна презентација.', 'механизам на интерна евалуација и анкети', '',
        'Реализирани активности 15.2 и 16.1', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('CSEW106', '', '', '6', '1', '1', '2013', 'македонски и англиски', '', '', 'По комплетирање на курсот кандидатите се очекува да бидат запознаени со основите на структурата и начинот на
работа на глобалната мрежа и да добијат воведни знаења за можностите и начините на користење на основните
интернет сервиси, како и за дизајнирање и изработка на статички и едноставни динамички WWW страни.', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'механизам на интерна евалуација и анкети', '', 'реализирани активности 15.1 и 15.2', '30', '45', '15', '15',
        '75', '180', '10', '15', '70', '10'),
       ('CSEW107', '', '', '6', '1', '1', '2013', 'Македонски и англиски', 'Бројни системи, кодови, претворање на кодови. Булови функции. Теореми од логичка алгебра. Анализа на
комбинациони кола. Синтеза на комбинациони кола. Методи за минимизација. Мултиплексери,
демултиплексери, кодери и декодери. RAM, ROMи PLA. Флип-флопови, анализа на секвенцијални мрежи. Синтеза
на секвенцијални мрежи. Дијаграм на состојби, минимизација на табела на состојби. Регистри, бројачи.', '', 'Запознавање со основните методи за анализа и дизајн на логички кола и логички мрежи, како комбинациони така
и секвенцијални кола, регистри и бројачи.', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'Механизам на интерна евалуација и анкети', '', 'Реализирани активности 15.1 и 15.2', '30', '45', '15', '15',
        '75', '180', '10', '15', '70', '10'),
       ('CSEW108', '', '', '6', '1', '1', '2013', 'Македонски',
        'Множества. Математичка индукција. Прави. Низи. Конвергентни и дивергентни низи. Дефиниција на функција, својства и операции со функции. Лимеси. Пресметување на лимеси. Непрекинатост.  Дефиниција на извод. Техники на диференцирање. Инверзни функции. Монотоност на функции. Конвексност и конкавност на функции. Локални екстреми. Испитување на својства и скицирање на график на функција.',
        '', 'Предметот е од подршка и е неопходен за воведување на поимите за функција, лимес и извод кои се неопходни
во повисоките години.', '', 'усвојување на поимите, својствата и техниките со самостојна работа; решавање на поставени
задачи и проблеми за вежбање', 'анкети', '', 'Потпис- нема. За попожување-минимум 45 бода.', '30', '45', '15', '15',
        '75', '180', '10', '15', '70', '10'),
       ('CSEW109', '', '', '6', '1', '1', '2013', 'македонски', '', '', 'Запознавање со основните поими и појави од електростатиката, со основните закони и теореми во теоријата на
електричните кола и со некои методи за анализа на електрични мрежи со временски констатни струи и напони.
Користење на основните законитости во електротехниката при решавање на конкретни проблеми во
инженерството..', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски симулации), тимска работа, самостојна изработка и одбрана на семинарска работа, учење во
електронско опкружување (форуми, консултации)', 'Механизам за интерна евалуација и анкети', '',
        'Изработени лабораториски вежби и посетување настава', '30', '45', '15', '15', '75', '180', '10', '15', '70',
        '10'),
       ('CSEW110', '', '', '6', '1', '1', '2013', 'македонски', '', '', '', '', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'механизам на интерна евалуација и анкети', '', 'Реализирани актибвности 15.2 и 16.1',
        '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('CSEW301', '', '', '6', '3', '1', '2013', 'македонски и англиски',
        'Вовед, статички и динамички типови на податоци, што се алгоритми, карактеристики на алгоритми (ефикасно наспроти, коректно, валидност). Основна споредба на алгоритми преку Random Access Machine, асимптотски нотации. Линеарни податочни структури. Хеш структури. Магацини дефиниции и алгоритми. Поврзани листи - типови и алгоритми. Редови на чекање - дефиниции и алгоритми. Хиеархиски структури. Стебла - дефиниции, примена и алгоритми. Бинарни пребарувачки стебла - дефиниции и алгоритми. Бинарно пребарување и посебни техники за сортирање. Секвенцијално пребарување. Техники на сортирање. Техники за креирање алгоритми. Архетипи на алгоритми: Алчни алгоритми, Раздели и владеј, Динамичко програмирање, Алгоритми со случајни броеви, Алгоритми со враќање наназад. Вовед во nелинерани структури, графови-основни поими и податочни структури за компјутерска репрезентација на графови. Основни алгоритми за работа со графови ( тополошко сортирање. Изминување по широчина, изминување по длабочина и други)',
        '', 'Запознавање со основните податочни структури и алгоритми кои се понатаму неопходни за работа со бази на
податоци како и за други апликации. Студентот ќе биде оспособен за користење и развој на структури и алгоритми
со линеарни листи, стебла, графови како и и индекси за пребарување. Исто така ќе биде оспособен за
имплемнтација на различните архетипи на алгоритми што се користат во практичната имплементација на многу
софтверски решенија.', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка на домашни
задачи. учење во електронско опкружување (форуми, консултации).', 'Механизам за интерна евалуација и анкети', '',
        'реализирани активности 15.1 и 15.2', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('CSEW302', '', '', '6', '3', '1', '2013', 'македонски и англиски', '', '', 'Вовед во основните концепти на компјутерските мрежи. Студентот ќе се здобие со знаења поврзани со мрежната
архитектура, мрежните протоколи и дизајн на мрежи. Студентот ќе се запознае со главните компоненти и апликации на
TCP/IP свитата од протоколи.', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, учење со примери, употреба на симулатори и други електронски алатки за анализа на мрежата,
протоколите и сообраќајот, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и семинарска
работа, учење во електронско опкружување (форуми, консултации).', 'механизам на интерна евалуација и анкети', '',
        'Реализирани активности 15.1 и 15.2', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('CSEW303', '', '', '6', '3', '1', '2013', 'македонски и англиски',
        'Експерименти и настани. Дефиниција и својства на веројатност. Дискретен и непреброив простор на веројатност. Условна веројатност и независност на настани. Бернулиева шема. Случајни променливи: дефиниција, функција на распределба. Случајни променливи од дискретен и апсолутно-непрекинат тип. Случајни вектори. Функции од случајни променливи. Бројни карактеристики: математичко очекување, дисперзија. Моменти на случајни променливи и случајни вектори. Функција изводница. Слаб закон на големите броеви. Централна гранична теорема. Позначајни распределби во статистика. Веројатносен модел на примерок. Оценување на параметри: точкасто и интервално. Тестирање на хипотези: параметарски и непараметарски. Линеарна регресија.',
        '', 'Да се воведат основните концепти од веројатност и статистичко анализа со дискусија на примените во
компјутерските науки. Да се оспособат студентите за успешно следење на стручните предмети во кои се
применуваат елементи од теорија на веројатност и статистика.', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'Механизам за интерна евалуација и анкети', '', 'реализирани активности 15.1 и 15.2', '30', '45', '15', '15',
        '75', '180', '10', '15', '70', '10'),
       ('CSEW304', '', '', '6', '3', '1', '2013', 'македонски и англиски', 'Основни принципи за градење на кориснички интерфејси, Типови на кориснички интерфејси. Визуелни
кориснички интерфајси. Веб базирани интефејси. Дизајнирање на прозорци, менија и команди. Планирање на
распоред на екран, навигација, тек. Компоненти на кориснички екрани, пораки, текст. Бои, икони и звуци. Уреди
за корисничка интеракција. Интернационализација и локализација. ', '', 'Запознавање со основните елементи на и развој на кориснички интерфејси. Разбирање на основните типови на
корисничка интеракција. По завршување на курсот се очекува студентот да демонстрира познавање на основните
видови корисничка интеракција и принципите за нивно дизајнирање, и да може самостојно да развива
интерактивни апликации со користење на програмски алатки следејќи ги научените принципи.', '', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'Механизам за интерна евалуација и анкети', '', 'Реализирани активности 15, 16', '30',
        '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('CSEW305', '', '', '6', '3', '1', '2013', 'македонски и англиски', '- Вовед во предметот
- Архитектура на веб апликации
- Вовед во скриптирање
- JavaScript - контролни структури
- JavaScript - Функции
- JavaScript - Полиња
- JavaScript - Објекти
- Document Object Model
- JavaScript - Справување со грешки
- JQuery
- Ajax
- JSON', '', 'Целта на курсот е да овозможи запознавање на студентите со основните на програмирањето на интернет
клиентската страна. Во таа насока студентите ќе бидат запознаени со дел од програмските јазици и технологиите
за пишување програми што се извршуваат на клиентската страна. По завршување на курсот се очекува студентот
да може да развива интерактивни веб-страници со користење на компјалирани и скриптирачки јазици', '', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'Механизам за интерна евалуација и анкети', '', 'Реализирани активности 15.2 и 16.1',
        '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('CSEW306', '', '', '6', '3', '1', '2013', 'македонски', '', '', '', '',
        'предавања, проекти, дискусии, работилници', 'Механизам за интерна евалуација и анкети', '',
        'Реализирани активности 15, 16', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('CSEW307', '', '', '6', '3', '1', '2013', 'македонски и англиски', '', '', 'Предметот опфаќа методи за решавање на диференцијални равенки од прв и втор ред,
нумеричкото решавање на повеќе математички проблеми, како и примена на некои
позначајни математички трансформации во инженерството.', '', 'Предавања, вежби, самостојна работа, проектни задачи, семинарски
работи', 'Механизам за интерна евалуација и анкети', '', 'реализирани 15 и 16', '30', '45', '15', '15', '75', '180',
        '10', '15', '70', '10'),
       ('CSEW308', '', '', '6', '3', '1', '2013', 'македонски и англиски', '', '', '', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, аудиториски и лабораториски
вежби (користење на опрема и софтверски пакети), самостојна изработка на проектни задачи , учење во
електронско опкружување (форуми, консултации).', 'Механизам за интерна евалуација и анкети', '',
        'реализирани активности 15.1 и 15.2', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('CSEW309', '', '', '6', '2', '1', '2013', 'македонски и англиски', '', '', 'Целта на предметот е да се совладаат основните концепти на логичко и функционално програмирање. Студентите
ќе можат да развиваат програми со кои се решаваат проблеми користејќи декларативно и функционално
програмирање. Содржината/темите кои се обработуваат во предметот претставуваат добра основа/програмска
пракса за проблеми од доменот на вештачка интелигенција/интелигентни системи и паралелно и дистрибуирано процесирање.',
        '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), тимска работа, студија на случај, поканети гости предавачи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'Механизам за интерна евалуација и анкети', '', 'Реализирани активности 15, 16', '30', '45', '15', '15', '75',
        '180', '10', '15', '70', '10'),
       ('CSEW319', '', '', '6', '6', '1', '2013', 'македонски и англиски',
        'Вовед во Python, Најчесто користени податочни структури во научни истражувања, Контрола на верзии на софтвер, Тестирање, Софтверски проекти, Конструкција и дизајн, Напредни техники за програмирање, Програми со високи перформанси',
        '',
        'Со комплетирањето на овој предмет студентите ќе се здобијат со знаењето за конструирање на доверлив, читлив, и ефикасен софтвер за научни истражувања во колаборативна средина. Акцентот во предметот ќе биде  поставен на практични техники, совети, и технологии за ефективно градење и одржување на комплексен код. Предметот е интензивно ориентиран кон практична работа.',
        '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), тимска работа, студија на случај, поканети гости предавачи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'Механизам за интерна евалуација и анкети', '', 'Реализирани активности 15, 16', '30', '45', '15', '15', '75',
        '180', '10', '15', '70', '10'),
       ('CSEW310', '', '', '6', '3', '1', '2013', 'македонски', 'Основни поими и дефиниции на маркетинг; пазар; маркетинг менаџмент; развој на маркетинг стратегија; анализа на внатрешното и надворешното маркетинг опкружување; маркетинг микс; пазари и однесување на потрошувачите; задоволство на потрошувачите; однси со клиентите; сегментирање; таргетирање; позиционирање; производи, услуги и брендови; ценовни стратегии; маркетинг канали; промотивен микс – рекламирање, продажни промоции, директен маркетинг, лична продажба, односи со јавност.
Интернет маркетинг – основи на интернет маркетинг; е-бизнис; е-трговија; трансакции меѓу потрошувачи, бизниси и државни институции; видови веб присуство; SWOT анализа; интернет маркетинг стратегии; е-бизнис стратегии; онлајн таргетирање; интернет маркетинг микс; деинтермедијација; реинтермедијација; виртуелни организации; интернет промоција; интерактивни интернет маркетинг комуникации; вирален маркетинг; маркетинг на социјални мрежи.',
        '',
        'Вовед во главните елементи за развој на маркетинг стратегија и планирање на програма за маркетинг. Развој на вештини за решавање на маркетинг проблеми преку сет аналитички алатки (рамки, поими, модели и техники). Презентирање и анализа на примери и студии на случај како претпријатијата од повеќе дејности го организираат својот маркетинг. Интегрирање на е-маркетингот во вкупната маркетинг стратегија. Проценка на  содржината и структурата на веб страните наспроти бизнис целите. Примена на најнови техники кај интенет маркетинг комуникациите, како на пример вирален маркетинг, блогови или маркетинг на социјални мрежи.',
        '', 'Предавања поддржани со презентации преку слајдови, вежби, тимска работа, студии на случај, изработка
на проектна задача, учење во електронско опкружување (форуми, консултации)', 'Механизам за интерна евалуација и анкети',
        '', 'реализирани активности 15.1 и 15.2', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('CSEW312', '', '', '6', '3', '1', '2013', 'македонски', ' Вовед и општи поими поврзани со различните
медии, значење, влијанија и сеприсутност на мултимедијата во актуелното општество.
Планирање и чекори при дизајнирање на мултимедијални апликации. Зачувување и
пренос на мултимедијални податоци. Аудио технологии. Графика и слики. Видео
технологии. Анимации, компјутерски технологии за развој на анимации и моделирање.
Интеракција. Техники за компресија и пренос на мултимедијални податоци. Вовед во
виртуелна и преувеличена реалност. Развој на мултимедијална апликација', '', ' Целта на предметот е студентите да се
запознаат со основите на различните медии: аудио, слики, видео и анимации и да ги
сфатат различните својства на секој од нив. Да ги знае и разбере различните техники за
компресија. Да знае да применува одредени модификации и техники за различни медиуми.
Студентот треба да развие мал мултимедијален производ со примена на изучените техники и
методи.', '', 'Познавање на структурата на компјутерските системи, хардверските компоненти, поврзувањето и начинот на
работа, карактеристиките и стандардите што се употребуваат.', 'Анкети, разговор со студенти.', '',
        'Реализирани активности 15, 16', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('CSEW313', '', '', '6', '3', '1', '2013', 'македонски и англиски', 'Генеричко програмирање, апстрактни податочни типови, генерички функции, генерички класи, колекции со линеарен
пристап, колекции со случаен пристап, мапи, рефакторинг, основни концепти на шаблони за дизајн на софтвер, нитки и
конкурентност. Развојна околина, интегрирана развојна околина.', '', 'Да се воведат студентите во парадигмата на генеричкото програмирање. Да се запознаат со апстрактни податочни типови,
креирање на темплејт класи и функции. Да развијат вештини за употреба на колекции на податоци (вектори, редови, листи,
множества и речници). На крај се очекува студентите да можат да ги аплицираат концептите на шаблони за објектно-
ориентиран развој на софтвер при моделирање на некој специфициран проблем во робусна објектно-ориентирана програма.
Студентите ќе бидат запознаени со техниките за развивање на софтвер во интегрирана развојна околина.', '', 'CSES207',
        '30+65+30+20+35 = 180 часа', '', 'Реализирани активности 15, 16', '30', '45', '15', '15', '75', '180', '10',
        '15', '70', '10'),
       ('CSEW314', '', '', '6', '3', '1', '2013', 'македонски и англиски',
        'Вовед во објектно ориентираниот модел на реалниот свет, и негова примена во софтверското инженерство. Повторна употреба на кодот, стандардизација. Основни својства на објектно ориентираната парадигма. Класи и објекти и нотација. Развој на ОО софтвер. Модуларност, хиерархија, агрегација и генерализација. Основни концепти на УМЛ. Базични класни дијаграми. Асоцијации помеѓу класите. Ограничувања и квалификатори. Интерфејси. Дијаграми на кориснички сценарија. Функции на вклучување и проширување. Дијаграми на активности. Дијаграми на состојби. Секвентни дијаграми. Колаборациски дијаграми. Интеракција со други системи. Дефинирање на интерфејси кон други системи со користење на УМЛ. Дијаграми на компоненти. Развојни дијаграми за имплементација во УМЛ. Примена на УМЛ нотацијата.',
        '', 'Запознавање со техниките за анализа, дизајн и моделирање на објектно ориентираните системи. Оспособување
за практична анализа на кориснички барања и креирање ефективни ОО модели како почетна фаза на
имплементацијата на ОО системот. ', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'Механизам за интерна евалуација и анкети', '', 'реализирани активности 15.1 и 15.2', '30', '45', '15', '15',
        '75', '180', '10', '15', '70', '10'),
       ('CSEW315', '', '', '6', '3', '1', '2013', 'Македонски или англиски', 'Општи поими и дефинирање на комункациски системи. Анализа на сигнали и системи во фреквентен домен.
Фуриева анализа на периодични и апериодични сигнали. Пренос низ линеарни системи. Амплитудна, аглова и
фазна модулација и демодулација. Комуникациски системи со шум. Модел на шум, однос сигнал шум. Влијание
на шумот врз техниките за модулација.', '', 'Целта на предметот е студентите да се запознаат со анализата на сигнали и нивниот пренос низ линеарни
системи, типови на модулација и влијание на шумот врз модулациските техники.', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема
и софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и
одбрана на проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'механизам на интерна евалуација и анкети', '', 'реализирани активности 15.1 и 15.2', '30', '45', '15', '15',
        '75', '180', '10', '15', '70', '10'),
       ('CSEW316', '', '', '6', '3', '1', '2013', 'македонски и англиски', '', '', 'Познавање на методологијата за анализа и дизајн на информациски системи.
Структурна анализа и дизајн со користење на УМЛ дијаграми. Запознавање со
планирање и раководење на информатички проект.', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби
(користење на опрема и софтверски симулации), тимска работа, пример случаи, самостојна
изработка и одбрана на проектна задача и семинарска работа, учење во електронско
опкружување (форуми, консултации). ', 'Механизам за интерна евалуација и анкети', '',
        'Изработени лабораториски вежби и посетување настава', '30', '45', '15', '15', '75', '180', '10', '15', '70',
        '10'),
       ('CSEW317', '', '', '6', '3', '1', '2013', 'македонски', 'Вовед во автомати и формални јазици; Конечни автомати; Регуларни изрази и јазици;
Својства на регуларните јазици; Контекстно слободни граматики и јазици; Pushdown
автомати; Својства на контекстно слободните јазици; Тјурингови машини; Неодлучивост; P,
NP и други класи на проблеми; ', '', 'Оспособеност за користење на формалните модели на пресметливост како основа за
теорија и пракса на програрамските јазици, компајлери, како и за пратење на повисок курс
од теоријата на пресметливоста. Запознавање со јазици, регуларни и контекстно слободни
јазици, конечни автомати и push down автомати, граматики и врската меѓу определен вид
на автомати и јазици.', '', 'предавања, аудиториски вежби, лабораториски вежби, проектни задачи,
домашни задачи', '/', '', 'Реализирани активности 15, 16', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('CSEW501', '', '', '6', '5', '1', '2013', 'македонски и англиски', '', '', '', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби
(користење на опрема и софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна
изработка и одбрана на проектна задача и семинарска работа, учење во електронско опкружување (форуми,
дискусии).', 'механизам на интерна евалуација и анкети', '',
        'Редовно посетување настава (до 3 отсуства), навремно доставување домашни задачи, семинарски работи и дискусии на форум',
        '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('CSEW502', '', '', '6', '5', '1', '2013', 'македонски и англиски', 'Архитектура и инструкциско множество на Intel x86, асемблер, изучување на внатрешна градба на процесорот, прекини, BIOS, повикување на системски рутини од оперативен систем, процесирање раководено од прекини, Windows системски рутини на x86, примери на влезно излезни кола, микроконтролери, вградени системи, пресметување што продира насекаде. Архитектура на микрокомпјутерски систем. Влезно излезни контролери, типови на меморија, програмирање на влезно излезни уреди, DMA контролори, сериски и паралелни контролери, видео и диск контролери.
Програмирање со ограничени ресурси. Програмирање на развојни уреди со вградени микроконтролери. Програмирање на микроконтролери со виш програмски јазик.',
        '', 'Запознавање со структурата на 16 битни микропроцесори, интегрирани компоненти за поврзување со
влезно/излезни уреди, програмирање со асемблер.
Познавање на основите на архитектурата и организацијата на микропроцесорите како и техниката на нивно
програмирање. Сличности и разлики на микропроцесори со микроконтролери. ', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'механизам на интерна евалуација и анкети', '', 'реализирани активности 15.1 и 15.2', '30', '45', '15', '15',
        '75', '180', '10', '15', '70', '10'),
       ('CSEW503', '', '', '6', '5', '1', '2013', 'македонски и англиски',
        'Вовед, историски развој, oсновни концепти на системи на бази податоци, споредба на процесирање датотеки и бази податоци. Управувачки софтвери на база податоци (DBMS) и архитектури, податочна независност. Модел на реалниот свет, семантичко моделирање: модел на ентитети и релации (Е-R модел), проширен модел на ентитети и релации (ЕЕ-R модел), UML oбјектен модел (класен дијаграм). Релациски модел на бази на податоци, ограничувања на интегритет, логичка и физичка организација. Дизајн на релациски бази податоци, трансформација на ЕЕ-R модел во релациски модел. Формални прашални јазици: релациска алгебра и релациско сметање. Прашални јазици (SQL), ограничувања, тригери, складирани процедури, индекси, аналитички прашалници. Функционални, клучни, јоин и повеќевредносни зависности. Нормални форми: прва, втора, трета, Boyce-Codd-ова, четврта и пета нормална форма. Процес на нормализација. Tрансакциско управување и конторла на конкурентност. Развој на апликации на бази податоци, вметнување на прашални јазици во програмските јазици, поврзување со базата.',
        '', 'Запознавање на студентот со основните концепти за работа со бази на податоци, начините на нивно моделирање
и имплементирање, како и работа со прашалните јазици. Студентот ќе биде способен да моделира бази на
податоци преку семантичко и релациско моделирање и процес на нормализација, ќе знае практично да го
применува SQL стандардот за креирање, одржување и манипулација на релациските бази на податоци, ќе се
здобие со воведни знаења за креирање на апликации на бази податоци.', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'механизам на интерна евалуација и анкети', '', 'реализирани активности 15.2 и 16.1 и 16.2', '30', '45', '15',
        '15', '75', '180', '10', '15', '70', '10'),
       ('CSEW504', '', '', '6', '5', '1', '2013', 'македонски и англиски', 'Преглед на Linux опративните системи, нивен развој, имплементација и дистрибуција. Администрациски поглед
ан организацијата на оперативниот систем, основни поставки и конфигурации. Протоколи, инсталација и работа со
мрежни сервиси (DNS, DHCP, LDAP), поставување на Интернет сервери (HTTP, FTP), електронска пошта (SMTP, POP,
IMAP), сервери за бази податоци и мрежни датотечни системи (SAMBA, NFS), системи за заштита-огнен зид.
Централизиран менаџмент и конфигурација на мрежни компјутери, управување со корисници и привилегии за
пристап', '', 'Целта на овој курсот е да се покријат стандардните мрежни сервиси кои се нудат на корисници во локална и
глобална мрежа. Студентите ќе бидат способни да постават и управуваат стандардни мрежни сервиси.', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'механизам на интерна евалуација и анкети', '', 'реализирани активности 15.1 и 15.2', '30', '45', '15', '15',
        '75', '180', '10', '15', '70', '10'),
       ('CSEW505', '', '', '6', '5', '1', '2013', 'македонски и англиски', '', '', 'По завршувањето на предметот се очекува студентот да ги разбира и има продлабочено знаење во примена на техниките за
извлекување знаење од клиентот, да ги разбира техниките за документирање на софтверски и бизнис потреби, да ги разбира
и има продлабочено знаење во примената на техники за управување со промени кај софтверски и бизнис барања.', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на
опрема и софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'механизам на интерна евалуација и анкети', '',
        'Редовно посетување настава (до 3 отсуства), навремно доставување на сите домашни задачи, семинарски работи, дискусии на форум и проект',
        '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('CSEW506', '', '', '6', '5', '1', '2013', 'македонски и англиски', '', '',
        'Развој на напредни серверски базирани веб апликации базирани на шаблони. Развој на веб апликации во облак', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'механизам на интерна евалуација и анкети', '', 'реализирани активности 15.1 и 15.2', '30', '45', '15', '15',
        '75', '180', '10', '15', '70', '10'),
       ('CSEW507', '', '', '6', '5', '1', '2013', 'македонски и англиски', 'Вовед. Дефиниции и терминологија.Податоци и репрезентација на податоци. Тек и постапката за визуелизација.
Визуелизација на скалари. Мапирање на скаларни вредности во боја и избор на палета на бои. Изолинии и
изоповршини. Визуелизација на волумени. Визуелизација на вектори. Користење на икони за визуелизација на
вектрои. Визуелизација на движење и текови. Визуелизација на информации. Визуелизација на
повекедимензионални податоци. Визуелизација на релации. Анимација за визуелизација. Интеракциски техники
во процесот на визуелизација. ', '', 'Предметот треба да овозможи запознавање на студентите со концептот на вузуелизација на податоци, избор на
техники и алгоритми за визуелизација на различни податочни множества, и нивна програмска реализација. По
завршување на курсот се очекува студентот да демонстрира познавање на концептот на визуелизација на
податоци, да знае да избере и да реализира алгоритми за визуелизација на различни видови податоци
програмски и со користење на алатки за визуелизација.', '', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'механизам на интерна евалуација и анкети', '', 'Реализирани активности 15.2 и 16.1',
        '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('CSEW508', '', '', '6', '5', '1', '2013', 'македонски и англиски', '', '', 'Целта на курсот е да овозможи запознавање на студентите со концептите, компонентите и организацијата на виртуелните
виртуелните општества, како и технологиите за развој, интеркација и анализа на истите. По завршување на курсот се очекува
студентот да ги познава концептите, компонентите и организацијата на виртуелните општества, да може да учествува во
процеси на анализа и да ги користи технологиите за развој на виртуелни општества.', '', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски пакети),
тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и семинарска
работа.', 'механизам на интерна евалуација и анкети', '', 'Реализирани актибвности 15.2 и 16.1', '30', '45', '15', '15',
        '75', '180', '10', '15', '70', '10'),
       ('CSEW509', '', '', '6', '5', '1', '2013', 'македонски и англиски',
        'Дефиниција на поимот “робот” и роботика како дел од вештачката интелигенција. Објаснување на односот помеѓу индустриската роботика и “интелигентната роботика. Запознавање со сензорски и актуаторски делови од роботскиот систем. Интердисциплинарни аспекти на роботика (вовед во механика на роботи). Од сигналите од сензорите до високонивовски симболи. Роботите како отелотворени системи на вештачката интелигенција. Моделирање на однесување на роботски системи. Запознавање со концептите: состојба, место и навигација. Вовед во повеќе-роботски системи.',
        '', 'Во овој курс студентите се запознаваат со основните концепти на роботиката. Дадени се примери за три големи
класи роботи: манипулатори, одечки роботи и роботи кои се движат на друг тип погон, пр. тркала. Студентите се
воведуваат во концептите на роботско чувствување на светот преку роботските сензори. Се воведуваат во повеќе-
роботски системи.', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'механизам на интерна евалуација и анкети', '', 'реализирани активности 15.1 и 15.2', '30', '45', '15', '15',
        '75', '180', '10', '15', '70', '10'),
       ('CSEW510', '', '', '6', '5', '1', '2013', 'Македонски', ' Поим за дигитизација. Техники и технологии кои се
користат при дигитизација на разни видови материјали: текстуални записи, музика,
слики, објекти. Дигитизација на стари записи и печатени матријали. Дигитизација на
слики и звук. Дигитизација, моделирање и реконструкција на 3Д објекти: уметнички
дела, архитектонски објекти, археолошки и антрополошки артефакти. Архивирање и
презервација на различни видови дигитални материјали. Техники и технологии за
презентација на дигитизирани материјали.', '', 'Целта на предметот е да се научат
процесот и техниките за дигитизација. Студентите треба да ги совладаат основните
принципи за менаџирање со дигитални материјали и нивна презервација, како и техники
и технологии за нивно презентрање', '', 'Предавања, вежби, проекти, семинарски', 'Анкети, разговор со студенти.', '',
        'Реализирани активности 15, 16', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('CSEW511', '', '', '6', '7', '1', '2013', 'македонски и англиски', '', '', 'Целта на курсот е студентите да ги научат главните концепти на објектно ориентирана анализа и дизајн. Да се
запознаат со техниките на рефакторирање, шаблоните за дизајн и различните архитектури на софтвер. По
завршувањето на курсот кандидатите ќе можат да ги идентификуваат ограничувањата и проценат квалитетите на
софтверските системи. За конкретна софтверска спецификација ќе можат да ја проценат нејзината комплетност и
конзистентност, како и да дизајнираат софтверска архитектура во согласност со дадените барања.', '',
        'предавања, аудиториски вежби, лабораториски вежби, проектни задачи, домашни задачи',
        'интерна евалуација и анкети', '', 'Реализирани активности', '30', '45', '15', '15', '75', '180', '10', '15',
        '70', '10'),
       ('CSEW512', '', '', '6', '5', '1', '2013', 'македонски', '-	Модели и теории на учење
-	Традиционални околини за учење.
-       Алатки кои се користат во традиционалните околини за учење
-	Интеграција на технологијата во процесот на учење.
-       Технолошки потпомогнати околини за учење.
-	Типови образовен софтвер.
-	Содржини за учење
-	Циклус на развој на образовен софтвер
-	Дизајн на кориснички посредници кај образовните софтвери
-	Примери на примена на алатки за учење во средно образование
-	Примери на примена на алатки за учење во основно образование
-	Колаборативно учење и поучување. Е-учење 2.0', '', 'Разбирање на улогата на технолошки потпомогнатите околини за учење во образованието; Разбирање на новите трендови кај
технолошки потпомогнатите околини за учење; Вреднување на процесот на учење со помош на технолошки потпомогнатите
околини за учење.; Разбирање на структурата, функциите и значењето на дигиталната содржина во различните медиуми;
Разбирање на технологиите и стратегиите за развој и дистрибуција на дигиталната содржина', '',
        'настава, колаборативно учење. презентации, проекти', '/', '', 'Реализирани активности 15, 16', '30', '45',
        '15', '15', '75', '180', '10', '15', '70', '10'),
       ('CSEW513', '', '', '6', '5', '1', '2013', 'македонски и англиски', 'Архитектури на дистрибуирани системи. Меѓупроцесни комуникации и развојни платформи. Интернет протоколи
за комуникација. Стандардни апликативни решенија за дистрибуираните компјутерски системи. Основи на клиент
– сервер програмирање. Middleware платформи (CORBA, JavaBeans, DCOM, .NET). Мулти-агентски системи во
дистрибуирана околина. Web технологија кај дистрибуираните компјутерски системи. Web услуги и технологии кај
дистрибуираните компјутерски системи (архитектура и реализација).', '', 'Целта на курсот е студентите да се запознаат со модерните архитектури на дистрибуирани системи како и на
моделите на меѓу процесни комуникации во дистрибуирани комјутерски системи. По завршување на курсот се
очекува студентот да демонстрира познавање на принципите за проектирање и развој на клиент сервер базирани
решенија на елементарно ниво со користење на современи архитектури за развој на дистрибуирани комјутерски
системи.', '', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'Механизам за интерна евалуација и анкети', '', 'реализирани активности 15.1 и 15.2',
        '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('CSEW514', '', '', '6', '7', '1', '2013', 'македонски и англиски', 'Историја на концептот за системи со отворен код. Софтвер со отворен код (Free/Open Source Software - FOSS). Филозофија за развој со отворен код. Хардвер со отворен код.
Економска анализа на системи со отворен код. Бизнис анализа. Бизнис модели. Патентирање. Лиценцирање со отворен код и типови лиценци (GNU General Public License (GPL)). Споредба со системи со затворен код. Споредба со бесплатен софтвер.
Апликациски софтвер со отворен код. Оперативни системи со отворен код. Програмски јазици за развој со отворен код (PHP, Perl, Python, Ruby, PHDL). Серверски софтвер со отворен код. Широко користени продукти со отворен код. (LAMP) Едукациски системи со отворен код
Развојни алатки за софтвер со отворен код. Системи за менаџирање со зависности. Модели за развој со отворен код. Шаблони при развој на системи со отворен код. SOLID принципи. Менаџирање софтверски проект со отворен код. Следење на развојот на проектите, менаџирање на промени. Шаблони имплементирани во Open Source платформи. Библиотеки базирани на платформи со отворен код (можни - Laravel, Code Igniter, Zend Framework, Symfony). Практични техники при развој на веб апликации со отворен код. Стандарди за кодирање и документација.
Безбедност на софтвер со отворен код. Поддршка за системи со отворен код (заедници за развој на OSS). Блогови, групи, форуми, социјални мрежи за OSS. Иднината на софтверите со отворен код.',
        '', 'По завршување на курсот се очекува студентите да се оспособени за продуктивно учество во поголеми софтверски
тимови кои работат употребувајќи технологии со отворен код. Да бидат способни за работа во програмски јазици
со отворен код, да развиваат веб апликации на тие платформи. Да бидат способни да водат софтверски проект
базиран на технологии со отворен код.', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'механизам на интерна евалуација и анкети', '', 'реализирани активности 15.1 и 15.2', '30', '45', '15', '15',
        '75', '180', '10', '15', '70', '10'),
       ('CSEW515', '', '', '6', '5', '1', '2013', 'македонски и англиски', 'Новите технологии и нивното влијание
Што е плагијат и како да се избегне
Воведни поими за етиката
Етика, нормативи и нормативни акти
Основни поими за приватноста
Приватност на информациите
Законска заштита на приватноста
Техники за зголемување на заштитата на приватноста
Концепти и класификација на довербата
Доверба во компјутерската технологија
Надежност
Основни поими за безбедноста
Безбедност на технологијата
Безбедност на информациите
Надзор
Пристап кон информациите
Слобода на изразувањето
Асистивни технологии
Софтверско пиратство
Интелектуална сопственост
Заштита на интелектуалната сопственост
Софтверски патенти
Влијанието на ИКТ
Влијанието врз секојдневниот живот
Влијание врз културата и етнографијата
Глобализација', '', 'Способност да се согледаат клучните културни, општествени, правни и етички аспекти
на ИКТ, влијанието на ИКТ, значењето и професионалните одговорности на ИКТ
професионалците; Способност критички да се согледаат и дискутираат потенцијалните
ризици што со себе ги носи ИКТ, вклучувајќи ги и последиците од нејзиниот развој врз
развојот на човештвото; Стекнување информации за националните и меѓународните
закони за спречување и заштита од компјутерскиот криминал.', '', 'предавања, аудиториски вежби, индивидуални и групни проектни
задачи', 'Механизам за интерна евалуација и анкети', '', 'Реализирани активности 15, 16', '30', '45', '15', '15', '75',
        '180', '10', '15', '70', '10'),
       ('CSEW516', '', '', '6', '5', '1', '2013', 'македонски и англиски', '', '', 'Запознавањесоосновнитекриптографскипринципи и методи; изучувањенаосновнитекрипто-
дизајни; практичнокористењенаизученитекриптографски алгоритми', '',
        'Предавања, вежби, самостојна работа, проектни задачи, семинарски работи',
        'механизам на интерна евалуација и анкети', '', 'Реализирани активности 15, 16', '30', '45', '15', '15', '75',
        '180', '10', '15', '70', '10'),
       ('CSEW517', '', '', '6', '5', '1', '2013', 'македонски', 'Вовед во машинска интелигенција. Линеарна регресија со една и повеќе променливи. Логистичка регресија,
репрезентација на хипотеза, класификација, функции на чинење, евалуација на грешка, селекција на модел и
валидација. Баесова теорија, наивен Баесов класификатор, невронски мрежи, машини со носечки вектори, дрва
на одлучување, мрзливи класификатори. Ансамбли. Ненадгледувано учење и учење со поттикнување. Актуелни
проблеми на машинска интелигенција.', '', 'Целта на курсот е студентите да се запознаат со основите на модерните техники од областа на машинско учење.
По завршувањето на курсот кандидатите: ќе имаат продлабочени знаења за напредните технологии и методи за
машинско учење; ќе можат да разберат, анализираат и формулираат генерални проблеми од областа на
машинско учење; ќе можат успешно да применат алгоритми за машинско учење при решавање на реални
проблеми; ќе можат да конципираат, анализираат, реализираат и проценат перформанси на систем за машинско
учење.', '', ' предавања, аудиториски вежби, лабораториски вежби, проектни задачи, домашни задачи',
        'интерна евалуација и анкети', '', 'Реализирани активности 15, 16', '30', '45', '15', '15', '75', '180', '10',
        '15', '70', '10'),
       ('CSEW518', '', '', '6', '5', '1', '2013', 'македонски и англиски', '', '', 'Разбирање како мобилноста може да се поддржи во IP мрежите. Познавање и работа со клучните мобилни
функционалности кои коегзистираат на различни нивоа од мрежата. Донесување одлуки за избор на техники за
градење на мобилен Интернет.', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'механизам на интерна евалуација и анкети', '', 'реализирани активности 15.1 и 15.2', '30', '45', '15', '15',
        '75', '180', '10', '15', '70', '10'),
       ('CSEW519', '', '', '6', '5', '1', '2013', 'македонски и англиски', '', '', 'По завршувањето на предметот се очекува студентот да ги разбира и има продлабочено знаење од мобилни
оперативни системи, продлабочено знаење за програмирање нативни мобилни апликации, мобилен веб.', '', ' Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби
(користење на опрема и софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна
изработка и одбрана на проектна задача и семинарска работа, учење во електронско опкружување (форуми,
консултации).', 'интерна евалуација и анкети', '',
        'Редовно посетување настава (до 3 отсуства), навремно доставување на сите домашни задачи и проект', '30', '45',
        '15', '15', '75', '180', '10', '15', '70', '10'),
       ('CSEW520', '', '', '6', '5', '1', '2013', 'македонски и англиски',
        'Дефиниција и карактеристики на мрежни оперативни системи. Различни видови на мрежни оперативни системи  (Linux, Windows, Unix, NetWare, ОS/2). Структура на мрежни оперативни системи за посебна намена. Мрежно скрипт програмирање. Безбедносни аспекти. Самба и други алатки. Вовед во виртуелизирани податочни центри и cloud computing. Мрежни сервиси: web hosting, Active Directory, LDAP, SSH, FTP, SMTP, POP, IMAP, DNS.',
        '', 'Познавање на структурата и начинот на работа на мрежните оперативни системи. Познавање на техники и
постапки за заштита на компјутерските системи.', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'механизам на интерна евалуација и анкети', '', 'реализирани лабораториски вежби', '30', '45', '15', '15', '75',
        '180', '10', '15', '70', '10'),
       ('CSEW521', '', '', '6', '5', '1', '2013', 'македонски и англиски',
        'Вовед во мултимедија и класификација на мултимедиската содржина. Компоненти на еден мултимедиски систем. Креирање на мултимедиска содржина (signali, АД конверија, Фуриева трансформација, семплирање и квантизација, филтрирање и субсемплирање). Репрезентација и формати на мултимедиска содржина (слика, видео, аудио). YUV субсемплирање. Теорија на бои, трихроматност, физиологија на човековиот визуелен систем, колорни шеми (RGB, YUV, CMYK, ...).  Основи на компресија на мултимедиска содржина (ентропија, таксономија, метрики). Техники за компресија (Хофман кодирање, аритметичко кодирање, LZW, замена на урнеци, векторска квантизација, кодирање на подопсег, диференцијално пулсно-кодна модулација, хибридни шеми ...). Предизвици при компресија (симетрична vs. несиметрична, адаптивна vs. неадаптивна, брзина и комплексност на енкодер/декодер, ...). Компресија на слики (GIF, PNG, MPEG, MPEG 2000,  дискретна вејвлет трансформација, фрактално кодирање, ...). Компресија на видео (темпорална редундантност, блок-базирана предикција на рамки, пресметување на вектор на движење, I рамки, B рамки, P рамки, предикција на повеќе рамки, GOP видео структура). Комплексност на компензација на движење (логаритамско vs. хиерархиско пребарување). MPEG стандард. Компресија на аудио (делта модулација, логаритамска квантизација, ...). Основи за QoS и QoE.',
        '', 'Запознавање на студентот со основните концепти за работа со мултимедиските податоци, начините на нивно
компресирање и складирање. Студентот ќе биде способен да моделира
мултимедиски податоци, ќе знае практично да го применува содржински-базираното пребарување на
мултимедиските податоци, и ќе се здобие со воведни знаења за креирање на апликации базирани на
мултимедиските содржини.', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'механизам на интерна евалуација и анкети', '', 'реализирани активности 15.2 и 16.1 и 16.2', '30', '45', '15',
        '15', '75', '180', '10', '15', '70', '10'),
       ('CSEW522', '', '', '6', '5', '1', '2013', 'македонски и англиски', '- Вовед во предметот
- Естетика
- Responsive CSS
- CSS Frameworks, Bootstrap
- Графика на Веб
- Canvas
- SVG
- Search Engine Optimisation
- HTML5 Offline
- CSS Preprocessors
- Internet Marketing
- Content management Systems
- SMIL', '',
        'Целта на наставната програма е студентите да се запознаат со напредните технологии во областа на веб дизајнот и развојот на модерни динамички веб апликации. По завршување на предметот, студентите ќе имаат преглед на најновите технички достигнувања во областа на веб дизајнот и ќе бидат способни да ги користат истите во изработк на практични проекти',
        '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации)',
        'механизам на интерна евалуација и анкети', '', 'Реализирани активности 15.1 и 15.2', '30', '45', '15', '15',
        '75', '180', '10', '15', '70', '10'),
       ('CSEW523', '', '', '6', '5', '1', '2013', 'македонски и англиски',
        'Напредни принципи на ИЧК. Фактори кои влијаат на интеракцијата. Моделирање на корисничко искуство. Развој на ефикасни кориснички посредници. Интеракција за различни кориснички групи. Дизајн за корисници со специјални потреби. Интеракциски принципи за специјални апликации.Трансфер на технологии во ИЧК. Компатибилност во дизајнот на ИЧК. Техники на моделирање на корисници.Техники на моделирање на околината. Адаптибилни кориснички интерфејси. Кориснички интерфејси базирани на агенти. Мултимедиски кориснички интерфејси. Напредни интерфејси за колаборација помеѓу човекот и компјутерот. градливи кориснички интерфејси. Мобилни интерфејси. Когнитивни аспекти на корисничките интерфејси. Кориснички интерфејси за лица со оштетени сетила и со нарушена моторика. Тестирање и евалуација на корисничките интерфејси.',
        '',
        'Овој предмет ги запознава студентите со основите на комплексната интеракција која се одвива меѓу човекот и компјутерот. Студентите се запознаваат и со техниките за моделирање на корисници, проблеми, апликации и средини (амбиенти) како и на техники за евалуација и анализа на интелигентни интефејси. Се разгледуваат принципи за градење посредници кои ги опфаќаат ограничувањата и во двете примарно афектирани групи: човекот и компјутерот. Студентите треба да научат дека корисникот е еден од главните елементи при креирање на компјутерските системи. При тоа, се дава увид во начинот за развивање на хардверот и софтверот за различни групи на корисници, како и за специфични апликациски домени. Студентите стекнуваат познавања на принципи за проектирање на кориснички интерфејси адаптибилни на околината, интелигентни кориснички интерфејси базирани на агенти и интерфејси чувствителни на контекст, како и интелигентни решенија наменети за специфични типови на кориснички групи.',
        '', 'Предавања, вежби, самостојна работа, проектни задачи, семинарски
работи', 'механизам на интерна евалуација и анкети', '', 'реализирани активности 15.1 и 15.2', '30', '45', '15', '15',
        '75', '180', '10', '15', '70', '10'),
       ('CSEW525', '', 'IoT Applicatons', '6', '7', '1', '2013', 'македонски и англиски', '(1) Вовед во Internet of Things. Хардверски апстракции. Насоки/можности/Предизвици при дизајн.
(1) Електроника потребна за IoT
(1) Сензори за IoT
(1) IoT безжично поврзување
(1) LoRaWAN, ZigBee и Bluetooth Технологија за поврзување. RFID и NFC технологија
(1) 6LowPAN. Архитектура. 6LowPAN заглавие. 6LowPAN  адресирање. 6LowPAN   Компресија. Фрагментација и рутирање
(1) Протоколи на апликациско ниво. MQTT и COAP.
(1) Безбедносна шема со користење на Blockchain технологијата
(2) Градење на IoT апликации
(2) Обработка на податоците добиени од IoT сензорите. Податочна анализа со користење на различни Python пакети и визуелизација на податоците.',
        '',
        'По завршување на курсот студентите ќе бида оспособени да дизајнираат, креираат и тестираат комплетни вградливи апликации наменете за Интернет од нештата.',
        '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'механизам на интерна евалуација и анкети',
        'Вградливи микропроцесорски системи и (Компјутерски мрежи или Компјутерски мрежи и безбедност)',
        'реализирани лабораториски вежби', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('CSEW526', '', '', '6', '5', '1', '2013', 'македонски и англиски', '', '', 'По завршувањето на курсот се очекува студентот да има познавање на архитектурите со високи пресметувачки
перформанси. Да ги разбира системите кои пресметуваат со високи перформанси и да стекне напредни знаења за
забрзување на алгоритмите со нивна анализа и трансформација врз основа на расположивата хардверска
инфраструктура и посебен осврт на процесорот и мемориската хиерархија.', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации)',
        'механизам на интерна евалуација и анкети', '', 'реализирани активности 15.1 и 15.2', '30', '45', '15', '15',
        '75', '180', '10', '15', '70', '10'),
       ('CSEW527', '', '', '6', '5', '1', '2013', 'македонски и англиски',
        'Вовед во Експертни системи. Архитектури на Експретните системи. Процесот на инженеринг на знаење. Репрезентација на знаење. Расудување со несигурност. Процес на стекнување на знаење. Непрецизирана логика. Анализа на одлуки, методи и техники за моделирање во процесот на донесување одлуки, проблеми на донесување на одлуки, дисциплини поврзани со донесување на одлуки, информациски аспекти на поддршка на  одлуки. Системи базирани на правила. Агентско базирани експертски системи. Алатки и средини за развој и дизајн на Експертни системи.',
        '',
        'Целта на курсот е студентите да ги научат главните концепти на експертните системи и нивната архитектура. Да  се запознаат со методите, техниките и системите за поддршка за донесување на одлуки како и анализа на одлуките. Да се запознаат со техниките за стекнување на знаење и репрезентација на знаење. По завршувањето на курсот кандидатите: ќе имаат продлабочени знаења за експертните системи; ќе можат да моделираат експертни системи кои се базираат на цврста и непрецизна логика, правила на одлучување и невронски мрежи како и да креираат кориснички профили.',
        '', 'предавања, аудиториски вежби, лабораториски вежби, проектни задачи, домашни задачи',
        'механизам на интерна евалуација и анкети', '', 'Реализирани активности 15, 16', '30', '45', '15', '15', '75',
        '180', '10', '15', '70', '10'),
       ('CSEW528', '', '', '6', '5', '1', '2013', 'македонски и англиски', '', '', 'По завршувањето на курсот се очекува студентот да ги разбира методите и системите за решавање на ИТ проблемите преку
обезбедување на квалитетна техничка поддршка.', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и
семинарска работа, учење во електронско опкружување (форуми, консултации).', 'механизам на интерна евалуација и анкети',
        '', 'реализирани активности 15.1 и 15.2', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('CSEW701', '', '', '6', '7', '1', '2013', 'македонски',
        'Функции на бизнис и системски аналитичар. Дефиниција на информациски системи и негови компоненти. Начелени парадигми за анализа и дизајн на информациски системи. Физибилити студија. Специфики на процесот на дизајн на информациски систем како проект. Моделирање на податоци и процеси. Пишување на спецификации. Пристапи кон почетно обезбедување на квалитет при дизајнирање на информациски системи. Дизајн на информациски системи. Осврт кон агилен пристап на имплементација на информациски системи. Основни принципи на спецификација преку пример.',
        '',
        'Запознавање на студенти со актуелните техники за анализа и дизајн на информациските системи (ИС). Навлегување во студија на случај на развој на ИС со користење на актуелни методологии. Оспособување за практична анализа на кориснички побарувања и креирање ефективни модели во сите фази  развој на еден ИС , со нагласок на фазите на анализа и дизајн. По завршување на курсот се очекува студентот да демонстрира знаење за користење на современи пристапи во процесот на анализа и дизајн на информациските системи.',
        '', 'предавања, аудиториски вежби, лабораториски вежби, проектни задачи, домашни задачи',
        'интерна евалуација и анкети', '', 'Реализирани активности 15, 16', '30', '45', '15', '15', '75', '180', '10',
        '15', '70', '10'),
       ('CSEW702', '', '', '6', '7', '1', '2013', 'македонски и англиски', '', '', 'Развој на напредни веб 2.0 апликации. Развој на апликации за Веб 3.0 (Семантички веб). Користење на отворени
податоци. Поврзување наподатоците.', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'механизам на интерна евалуација и анкети', '', 'реализирани активности 15.1 и 15.2', '30', '45', '15', '15',
        '75', '180', '10', '15', '70', '10'),
       ('CSEW703', '', '', '6', '7', '1', '2013', 'македонски и англиски', 'Вовед во проблематиката на препознавање на облици. Машинска перцепција, компоненти на систем за препознавање на облици.  Видови на обележја, екстракција на обележја, селекција на обележја и генерирање на обележја. Класификатори базирани на Баесовата теорија на одлучување, линеарни класификатори, нелинеарни класификатори. Методи за ненадгледувано учење. Дизајн и имплементација на систем за препознавање на облици. Евалуација
на перформанси на систем. Примери за примена кај системи за идентификација и автентификација, за медицинска
дијагносика, одбрана, биоинформатика, препознавање на текст, ракопис, лица, отисоци од прст, биометриски
податоци,  препознавање на говор, класификација на текст.', '', 'Целта на курсот е студентите да ги научат главните концепти на методите и техниките кои се применуваат за
препознавање на облици.По завршувањето на курсот кандидатитеќе бидат оспособени за дизајнирање,
реализирање и имплементација на системи за автоматско препознавање на облици, проценка на нивните
перформанси и нивна оптимизација.', '',
        'предавања, аудиториски вежби, лабораториски вежби, проектни задачи, домашни задачи',
        'интерна евалуација и анкети', '', 'Реализирани активности 15, 16', '30', '45', '15', '15', '75', '180', '10',
        '15', '70', '10'),
       ('CSEW705', '', '', '6', '7', '1', '2013', 'македонски и англиски', 'Иновативни организации. Разбирање на иновативноста. Процес на иновирање во компаниите. Иновативни вештини.
Поддршка за креативност. Управување со процесот на иновирање. Функција на дизајнот во иновациите. Иновации водени од
дизајн. Мерење на иновативноста во организациите. Комерцијализација на иновациите. Ефективни иновациски планови.
Користење на ИКТ како поддршка за иновации. Иновирање во ИКТ. Забрзивање на иновациите со користење на ИКТ.Нови
ИКТ технологии и можности за иновирање.', '', 'Разбирање на иновативноста. Стекнување на иновативни вештини. Примена на ИКТ за креирање на иновации. Креирање на
иновации во ИКТ.', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и
семинарска работа, учење во електронско опкружување (форуми, консултации).', 'механизам на интерна евалуација и анкети',
        '', 'реализирани активности 15.1 и 15.2', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('CSEW707', '', '', '6', '7', '1', '2013', 'македонски и англиски', 'Основни поими за системи и модели
Дискретни системи и класификација
Примена на автомати за моделирање
Супервизорска контрола
Примена на Петриеви мрежи за моделирање на производни процеси
Временски и хибрдини модели
Стохастичко моделирање на производни процеси
Симулација на дискретни системи, распределување на настани
Компјутерски поддражан развој на производи
Работа со програмибилни логички контролери.', '', 'Целата на курсот е запознавање на студентите со теоријата, принципите и праксата за
компјутерски потпомогнато производство, основните поими за системи и модели, контрола
и симулација на производни процеси.', '', 'Предавања, вежби, самостојна работа, проектни задачи, семинарски
работи', 'интерна евалуација и анкети', '', 'реализирани активности 15.1 и 15.2', '30', '45', '15', '15', '75', '180',
        '10', '15', '70', '10'),
       ('CSEW708', '', '', '6', '7', '1', '2013', 'македонски и англиски', 'Продлабочен преглед на деталниот софтверски дизајн и конструкција. Продлабочено покривање
на образците за дизајн и рефацторинг. Вовед во формален дизајн. Анализа на дизајн базиран
базирана на интерни критериуми за квалитет. Подобрување на перформанските и одржливоста.
Реверсен инженеринг. Објектно ориентиран дизајн и програмирање', '', 'Целта на овој предмет е да се оспособат студентите да осознаат за деталниот софтверски дизајн,
потребата од реверсен инженеринг во спфтверското инженерство.', '',
        'Предавања, вежби, самостојна работа, проектни задачи, семинарски работи', 'интерна евалуација и анкети', '',
        'реализирани активности 15.1 и 15.2', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('CSEW709', '', '', '6', '7', '1', '2013', 'македонски',
        'Вовед во компјутерска визија. Камери и оптика. Осветлување и боја. Пиксели и филтри. Обработка на слики во фреквенциски домен. Пирамиди на слика. Машинско учење: кластерирање и класификација. Детекција на рабови и поклопување на линии. Робустно поклопување на линии (Hough трансформација, RANSAC и др.). Кластерирање и сегментација на слики. GMM (Gaussian Mixture Models). Детекција на точки од интерес. Следење на карактеристики. Оптички тек. Стерео коресподенција. Карактеристики на слика инваријантни на скалирање и ротација (SIFT, SURF). Речници од визуелни зборови. Препознавање и класификација на визуелни објекти.',
        '', 'Да се воведат студентите во основните концепти и техники во компјутерската визија. Студентите кои успешно ќе
го завршат курсот ќе бидат способни за дизајнирање на ефикасни системи за компјутерска визија како:
препознавање на ракопис, детекција и препознавање на лица, проценка на движење, следење на луѓе и возила,
препознавање на гестови, препознавање и класификација на визуелни објекти, разбирање и анализа на сцени
итн.', '', ' предавања, аудиториски вежби, лабораториски вежби, проектни задачи, домашни задачи',
        'интерна евалуација и анкети', '', 'Реализирани активности 15, 16', '30', '45', '15', '15', '75', '180', '10',
        '15', '70', '10'),
       ('CSEW710', '', '', '6', '7', '1', '2013', 'македонски и англиски', 'Основни парадигми на истражувачката работа. Предизвици на научно истражувачката работа во 21-виот век.
Дефинирање на предмет на истражување.
Основни етапи на еден истражувачки процес (хипотеза, анализа, експеримент, евалуација)
Улогата на технологијата за подршка на истражувањето.
Истражување и ИКТ, предизвици и парадигми (што е експеримет кога ИКТ е предмет на истражување, кога е тој веродостоен,
како се извршува неговаправилна евалуација)
Пишување на научно истражувачки труд, поделба на научно истражувачки трудови.
Правилно користење на литература воистражувачкиот процес. Плагијаторство наспроти цитирање.
Истражување и иновации. Основна постапка за патентирање.', '', 'По завршувањето на предметот се очекува студентот да ги разбира принципите на истражувачката работа, да има сознанија
за идентификување на можни научно-истражувачки прашања, како и да има основни познавања од текот на научно
истражувачкиот процес. ', '', ' Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби, тимска работа,
пример случаи, самостојна изработка и одбрана на проектна задача и семинарска работа', 'интерна евалуација и анкети',
        '',
        'Редовно посетување настава (до 3 отсуства), навремно доставување домашни задачи, семинарски работи, дискусии на форум и проект',
        '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('CSEW711', '', '', '6', '7', '1', '2013', 'македонски и англиски', '', '', 'Студентот ќе се здобие со знаења за користење на техники за моделирање со цел да го евалуира динамичкото
однесување на реалните системи. Студентот ќе се оспособи со знаење за конструирање, верификација и решавање
на моделите со соодветно ниво на апстракција и деталност. ', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'механизам на интерна евалуација и анкети', '', 'реализирани активности 15.1 и 15.2', '30', '45', '15', '15',
        '75', '180', '10', '15', '70', '10'),
       ('CSEW712', '', '', '6', '7', '1', '2013', 'македонски и англиски', 'Програмирање на мрежни сервиси и пример мрежни апликации. Архитектура на P2P системите, централизирани,
дистрибуирани и хибридни. Упатување и безбедност во P2P системи. P2P програмски алатки. Системи и
апликации. Архитектура на грид системи, развој и работа на EGEE.', '', 'Запознавање со програмирање во TCP/IP мрежна околина, програмирање на основни мрежни сервиси.
Програмирање на Web сервер, апликациски сервер. Peer-to-Peer и Grid структури.', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'механизам на интерна евалуација и анкети', '', 'реализирани активности 15.1 и 15.2', '30', '45', '15', '15',
        '75', '180', '10', '15', '70', '10'),
       ('CSEW713', '', '', '6', '7', '1', '2013', 'македонски и англиски',
        'Вовед во мрежите од следната генерација NGN. Архитектура на NGN. Кориснички пристап. Глас, видео и податоци во NGN околина. NGN мрежи и топологии. Апликации и интегрирани сервиси. 4-5G. Softswitch. IMS. SIP. VoIP. Mobile VoIP. Виртуелизација на мрежи. VxLAN. NVGRE. NFV. SDN. Whitebox switching. OVS.',
        '',
        'По завршувањето на курсот се очекува студентот да има познавање на архитектурата на мрежите од следните генерации. Да ги знае начините за кориснички пристап и технологиите за конвергирани мрежи и одвојување на корисничкaта од контролната рамнина, како и хардверот од софтверот.',
        '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'механизам на интерна евалуација и анкети', '', 'реализирани лабораториски вежби', '30', '45', '15', '15', '75',
        '180', '10', '15', '70', '10'),
       ('CSEW715', '', '', '6', '7', '1', '2013', 'македонски и англиски', 'Модели на мултимедиски сообраќај, координација и управување со трансфер на големи количини на податоци,
високо пропусни мрежи, упатувачки и транспортни протоколи, квалитет на услуги кај мултимедиски мрежи (на
ниво на мрежа), мрежни мултимедиски апликации (интрнет базирана интерактивна 3Д графика, дигитална
телевизија, P2P и GRID мултимедиски сервиси).', '', '.', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'механизам на интерна евалуација и анкети', '', 'реализирани активности 15.1 и 15.2', '30', '45', '15', '15',
        '75', '180', '10', '15', '70', '10'),
       ('CSEW716', '', '', '6', '7', '1', '2013', 'македонски и англиски', 'Вовед; Основна обработка на текстови; Морфологија; Синтакса, Семантика и
двосмисленост на природните јазици; Морфологија на зборовите и конечни
автомати; Mоделирање на природните јазици; Основни алгоритми за поправка на
правописни грешки (Spelling Correction); Коренување на зборовите (Stemming);
Парсирање; Класификација на текстови; Основи на машинско преведување; Основни
алгоритми за извлекување на информации од текстуални податоци;', '', 'Целта на предметот е студентитеда се стекнат со основните теоретски и практични
знаења за алгоритмите за обработка на природните јазици. Ќе стекнат знаења за тоа
како јазичната структура и значење се репрезентираат во структури наподатоци, како
овие структури и значење да се препознаат во текстуалниподатоци, и најбитно, како
да изградат алгоритми кои ќе ги препознаваатвистинските одговори помеѓу големиот
број опции. ', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања,
вежби (користење на опрема и софтверски пакети), тимска работа, пример случаи,
поканети гости предавачи, самостојна изработка и одбрана на проектна задача и
семинарска работа, учење во електронско опкружување (форуми, консултации).', 'механизам на интерна евалуација и анкети',
        '', 'реализирани активности 15.1 и 15.2', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('CSEW717', '', '', '6', '7', '1', '2013', 'македонски и англиски', 'Вовед во оптички мрежи. Оптички влакна. Слабеење и дисперзија. Оптички компоненти. Оптички мрежи (SDH,
ATM). WDM. IP преку оптика. GMPLS. Гигабитен и 10-гигабитен Етернет. Пристапни оптички мрежи. Пасивни
оптички мрежи (PON).', '', 'Студентот ќе се стекне со знаења за проектирање, контрола и управување со оптички мрежи со помош на
современите мрежни технологии.', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'механизам на интерна евалуација и анкети', '', 'реализирани активности 15.1 и 15.2', '30', '45', '15', '15',
        '75', '180', '10', '15', '70', '10'),
       ('CSEW718', '', '', '6', '7', '1', '2013', 'македонски и англиски',
        'Основи на паралелно и дистрибуирано пресметување, модели, алгоритми, специјално наменски архитектури, систолични алгоритми и архитектури, општонаменско паралелно и дистрибуирано програмирање, синхронизација на секвенцијални програмски сегменти, ограничен избор, паралелна композиција, рекурзија, алтернативен избор, недетерминистички избор, дистрибуирано зачувување и обработување на податоци, паралелни програмски јазици, дистрибуирано софтверски модели, дизајн, анализа и синтеза на паралелен и дистрибуирани алгоритми. Изучување на паралелни конструкти и јазици, Multipascal и MPI. Изучување на модели и технологии за дистрибуирано процесирање како MapReduce и Hadoop.',
        '',
        'Цел на предметот е студентите да ги совладаат методите на паралелно и дистрибуирано процесирање, можностите за паралелизација на секвенцијална програма, дистрибуирано процесирање на голем број на податоци и проблемите со кои треба да се справат во тој процес',
        '', '/', 'механизам на интерна евалуација и анкети', '',
        'Одбрана на проекти и редовна достава на домашни и лабораториски вежби', '30', '45', '15', '15', '75', '180',
        '10', '15', '70', '10'),
       ('CSEW719', '', '', '6', '7', '1', '2013', 'македонски и англиски', '', '', 'По завршување на курсот се очекува кандидатот да ги разбира концептите за
програмирање на специјални ефекти и видео игри и да може да развива системи што
содржат специјални ефекти како и да дизајнира и развива софтвер за видео игри.', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби
(користење на опрема и софтверски пакети), тимска работа, пример случаи, поканети
гости предавачи, самостојна изработка и одбрана на проектна задача и семинарска работа,
учење во електронско опкружување (форуми, консултации).', 'механизам на интерна евалуација и анкети', '',
        'реализирани активности 15.1 и 15.2', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L1S003', '', 'Computer Architecture and Organization', '6', '2', '1', '2023', 'македонски и англиски',
        '(1) Вовед во компјутерски системи. Преглед на компјутерски архитектури и пресметковни структури. Капацитет и перформанси на компјутерски системи. (2) Бројни системи. Машинско претставување на броеви. Комплементи. SM, RC, DC системи Аритметички алгоритми. Кодови. Хамингово растојание и код. Компресија. Броеви со подвижна запирка. (2) Булова алгебра, прекинувачки функции, логички порти, комбинациони кола, минимизација на кола. Анализа и дизајн на скевенцијални кола. (1) Организација на аритметичко-логички уред. Компјутерска аритметика. Типови на адресирање. Преведување и старт на програма. Инструкциски формати. MIPS. Процесирање на инструкции и операции. (2) Процесор, основна имплементација, контролна единица, операции над податочни патеки. (1) Техники на проточен дизајн, гледање на напред, повеќефунционални единици. Паралелизам. Конфликти. Прекини, софтверски, хардверски (2) Мемориска хиерархија. Кеш меморија. Виртуелна меморија. TLB (1) Користење на главната меморија. Типови на RAM меморија. Параметри на мемориски системи. Типични мемориски организации. (1) Складирање и други В/И уреди. Дискови, флеш меморија (1) Повеќејадрени, повеќепроцесорски системи кластери, работа со повеќе нишки, суперскаларност, типови на паралелизам, GPU, мрежни топологии за повеќепроцесорски системи',
        '(1) Introduction to Computer Systems. Overview of computer architectures and computational structures. Capacity and performance of computer systems. (2) Number systems. Machine representation of numbers. Accessories. SM, RC, DC systems Arithmetic algorithms. Codes. Hamming distance and codes. Compression. Floating point numbers. (2) Boolean algebra, switching functions, logical gates, combinational circuits, minimization of circuits. Analysis and design of frequency circuits. (1) Organization of the arithmetic-logical device. Computer Arithmetic. Types of addressing. Translating and launching a program. Instruction formats. MIPS. Processing instructions and operations. (2) Processor, basic implementation, control unit, operations over data paths. (1) Flow-flow techniques, front-view, multifunctional units. Parallelism. Conflicts. Termination, software, hardware (2) Memory hierarchy. Cache memory. Virtual memory. TLB (1) Using the main memory. Types of RAM. Parameters of memory systems. Typical memory organizations. (1) Storage and other I / O devices. Drives, flash memory (1) Multi-core, multiprocessor cluster systems, multi-threaded work, superscalarity, types of parallelism, GPUs, network topologies for multi-processor systems',
        'Разбирање на главните компјутерски архитектури, внатрешната организација, проценка на перформансите на поедините делови и компјутерскиот систем во целинa.',
        'Understanding the main parts of computer architectures, internal organization, performance evaluation of individual parts and the computer system in whole.',
        'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и',
        'механизам на интерна евалуација и анкети', '', '15.1 и 15.2', '30', '45', '15', '15', '75', '180', '10', '15',
        '70', '10'),
       ('F18L1S013', '', 'Calculus', '6', '2', '1', '2023', 'Македонски и англиски',
        '(1) Дефиниција на функција. Својства на функции. Oперации со функции. (1) Прави. Фамилии од функции. (1) Инверзни функции. Експоненцијални и логаритамски функци. (3) Лимеси. Пресметување на лимеси. Непрекинатост. (2) Дефиниција на извод. Техники на диференцирање. Извод од сложена функција. (1) Лопиталово правило. (1) Примена на изводи: монотоност на функции, конвексност и конкавност на функции, локални екстреми. (1) Испитување на својства и скицирање на график на функција. Глобални екстреми. (1) Интегрирање: неопределен интеграл, интегрирање со замена. (1) Определен интеграл. Фундаментална теорема во калкулус.',
        '(1) Function definition. Function properties. Operations with functions. (2) Lines. Families of functions. (1) Limits. Computing limits. Continuity. (2) Definition of derivative. Techniques of differentiation. Derivative of a composite function. (1) L`Hôpital`s rule. (1) Application of derivatives: monotonicity of  functions, concave and convex functions, relative extrema. (1) Analysis of properties and sketching the graph of a function. Absolute extrema. (1) Integration: indefinite integral, integration by substitution. (1) Definite integral. Fundamental theorem of calculus.',
        'Предметот е од подршка и е неопходен за воведување на поимите за функција, лимес, извод и интеграли кои се неопходни во скоро сите предмети од повисоки години.',
        'This course is a support course that is essential for introducing the terms of a function, limits, derivate and integrals. These terms are important for almost all courses in the following years.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'механизам на интерна евалуација и анкети', '', 'Реализирани актибвности 15.2 и 16.1',
        '45', '45', '10', '0', '80', '180', '0', '0', '100', '0'),
       ('F18L1S015', '', 'Object Oriented Analysis and Design', '6', '2', '1', '2023', 'македонски и англиски',
        'Вовед во објектно ориентираниот модел на реалниот свет, и негова примена во софтверското инженерство. Повторна употреба на кодот, стандардизација. Основни својства на објектно ориентираната парадигма. Класи и објекти и нотација. Развој на ОО софтвер. Модуларност, хиерархија, агрегација и генерализација. Основни концепти на УМЛ. Базични класни дијаграми. Асоцијации помеѓу класите. Ограничувања и квалификатори. Интерфејси. Дијаграми на кориснички сценарија. Функции на вклучување и проширување. Дијаграми на активности. Дијаграми на состојби. Секвентни дијаграми. Колаборациски дијаграми. Интеракција со други системи. Дефинирање на интерфејси кон други системи со користење на УМЛ. Дијаграми на компоненти. Развојни дијаграми за имплементација во УМЛ. Примена на УМЛ нотацијата.',
        'Introduction to the object-oriented model of the real world, and its application in software engineering. Code reusability, standardization. Basic characteristics of the object-oriented paradigm. Classes and objects and their notation. Development of OO software. Modularity, hierarchy, aggregation and generalization. Basic Concepts of UML. Basic class diagrams. Associations between classes. Restrictions and qualifiers. Interfaces. Use case diagrams. Functions of inclusion and expansion. Activity diagrams . State diagrams. Sequence diagrams. Collaboration diagrams. Interaction with other systems. Defining interfaces to other systems using UML. Component diagrams. Deployment diagrams in UML. Practical application of UML notation.',
        'Запознавање со техниките за анализа, дизајн и моделирање на објектно ориентираните системи. Оспособување за практична анализа на кориснички барања и креирање ефективни ОО модели како почетна фаза на имплементацијата на ОО системот.',
        'Introduction to the techniques that are necessary for analysis, design and modeling of object-oriented systems. Enabling practical analysis of user requirements and creating effective OO models as the initial phase of implementation of the OO system.',
        'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'Механизам за интерна евалуација и анкети', '', 'реализирани активности 15.1 и 15.2', '30', '45', '15', '15',
        '75', '180', '10', '15', '70', '10'),
       ('F18L1S016', '', 'Object oriented programming', '6', '2', '1', '2023', 'Македонски и англиски',
        'Вовед во објектно ориентирано програмирање / концепти на ООП,  Објекти, Класи, Конструктори и деструктори, Класи 2, copy конструктор, this покажувач, преоптоварување оператори, Наследување, Полиморфизам, Статички членови на класите, Повеќекратно наследување, Исклучоци, Обработка на практичен пример',
        'Introduction to object-oriented programming. Characteristics of OO programming languages. Terminology (objects, classes, methods, encapsulation, abstraction, inheritance, polymorphism). Implementation of methods. Constructors. Destructors. Constructor overloading. Objects as arguments. Embedding objects. Inheritance. Multiple inheritances. Conversions among basic and derived classes. Overloading and redefining functions in derived classes. Polymorphism. Abstract classes. Interfaces. Exceptions.', 'Целта на предметот е да го запознае студентот со основните концепти на објектно-ориентираното програмирање. За таа цел ќе бидат воведени концептите на објекти и класи, eнкапсулација, наследување и полиморфизам. Студентите ќе бидат запознаени и со хиерахијата на класи. Ќе се направат споредби на имплементациите на објектно-ориентираните концепти во различни програмски јазици.
По завршување на курсот студентот ќе ги разбира принципите на објектно-ориентираното програмирање и биде оспособен за развој на програми кои ги подржуваат овие принципи.', 'The goal of the course is to acquaint the student with the basic concepts of object-oriented programming. Therefore, the concepts of classes and objects will be introduced, encapsulation, inheritance and polymorphism. The students will be introduces to the concept of hierarchy of classes. Comparisons will be made of the implementation of the object-oriented concepts in different programming languages.
After the completion of the course, the student will understand the principles of object-oriented programming and will be able to develop programs based on these concepts and principles.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'механизам на интерна евалуација и анкети', '', 'Реализирани актибвности 15.2 и 16.1',
        '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L1S023', '', 'Business statistics', '6', '2', '1', '2023', 'Македонски и англиски',
        'Вовед. Видови податоци, собирање на податоци, примерок,  распределба на честоти на податоци, графички методи за прикажување на распределбата на честотите, истражувачка анализа на податоците. Мерки на централна тенденција и расејување на податоците.  Моделирање на несигурност. Основни елементи од веројатност, условна веројатност, независност, Баесова теорема. Случајни променливи, распредeлби на веројатности, очекување и дисперзија. Дискретни распределби: биномна распределба, Пуасонова распределба, геометриска распределба и примени. Апсолутно-непрекинати  распределби: рамномерна, експоненцијална и нормална распределба, основни својстава, стандардизација  и користење на таблици за определување на веројатности од настани. Популација и примерок. Распределба на статистики на примерок. Оценување на параметри: интервали на доверба за математичко очекување, дисперзија на популација и пропорции.  Тестирање на хипотези. Корелација и линеарна регресија. Непараметарски тестови за совпаѓање на распределби и независност на категориски карактеристики.',
        'Introduction, Types of data, data collection, sample, distribution of data frequencies, graphical methods for representing  of frequency distributions, research data analysis. Measures of central tendency and data variation. Modeling of uncertainty. Basic elements of probability, conditional probability, independence, Bayes theorem. Random variables, probability distribution, mean and variance. Discrete Distributions: binomial Distribution, Poisson Distribution, geometric Distribution and their applications. Continuous distributions: uniform, exponential and normal distribution, basic properties, standardization and using tables for finding event probabilities. Population and sample. Distribution of sample statistics. Parameters estimation: confidence intervals for mean, variance and proportions. Testing hypotheses. Correlation and linear regression. Non-parametric tests for distribution fitting and independence of categorical variables.',
        'Запознавање со основните статистички методи и техники за прикажување, анализа и истражување на податоци.',
        'Introduction to the basic statistical methods and techniques for representing, analyzing data and making conclusions.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'механизам на интерна евалуација и анкети', '', 'Реализирани актибвности 15.2 и 16.1',
        '45', '45', '30', '10', '50', '180', '0', '10', '90', '0'),
       ('F18L1S026', '', 'Marketing', '6', '2', '1', '2023', 'Македонски и англиски',
        'Вовед во основните поими од областа маркетинг; Организации; Анализа на маркетинг опкружувањето; Пазари за лична потрошувачка и однесување при купување на потрошувачите; Бизнис пазари и однесување при купување на бизнисите; Маркетинг стратегија водена од потрошувачите; Маркетинг микс; Производи, услуги и брендови; Развој на нов производ и стратегии за животен циклус на производ; Поставување цени; Ценовни стратегии; Маркетинг канали; Продажба на мало и на големо; Интегрирана стратегија за маркетинг комуникации; Рекламирање и односи со јавност; Лична продажба и продажна промоција; Директен и онлајн маркетинг; Градење долгорочни односи со клиентите.',
        'Introduction to the basic concepts in the field of marketing; Organizations; Analysis of the marketing environment; Consumer markets and consumer buying behavior; Business markets and business buying behavior; Consumer driven marketing strategy; Marketing mix; Products, services and brands; New product development and product life cycle strategies; Setting prices; Pricing strategies; Marketing channels; Retail and wholesale; Integrated Marketing Communications Strategy; Advertising and public relations; Personal sales and sales promotion; Direct and online marketing; Building long-term customer relationships.',
        'Вовед во главните елементи за развој на маркетинг стратегија и планирање на програма за маркетинг; Развој на вештини за решавање на маркетинг проблеми преку аналитички алатки (рамки, поими, модели и техники); Анализа на примери и студии на случај како претпријатијата го организираат својот маркетинг, со акцент на ИКТ претпријатија; Подобрување на комуникациските вештини, усни и писмени, работа во тим при изработка на проектна задача, презентирање на проектната задача.',
        'Introduction to the main elements for developing a marketing strategy and planning a marketing program; Development of skills to solve marketing problems through analytical tools (frameworks, concepts, models and techniques); Examples of case studies how enterprises are organizing their marketing operations, with an emphasis on ICT enterprises; Improving communication skills, oral and written, team work in the preparation of a project task, presenting the project task.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'механизам на интерна евалуација и анкети', '', 'Реализирани актибвности 15.2 и 16.1',
        '30', '45', '15', '15', '75', '180', '0', '15', '80', '10'),
       ('F18L1S032', '', 'Discrete structures 2', '6', '2', '1', '2023', 'Македонски и англиски',
        'Релации, подредувања. Еквиваленции. Индукција и рекурзија. Броење. Основна комбинаторика. Принцип на гулабови дупки. Напредни комбинаторни техники. Биномна формула. Графови (основни поими, претставување и својства) Изоморфизам, пат планарност. Дрва и нивни својства.  Дрва на пребарување',
        'Relations. Ordering. Equivalencies. Induction and recursion. Counting. Basic combinatorics. Pigeonhole principle. Advanced combinatorial techniques (combinatorial proofs). Binomial formula. Graphs (basic notions, representations, and properties) Isomorphism, path, planar graphs. Trees and their properties. Searching trees.',
        'Курсот претставува вовед во основните математички концепти неопходни за повисоките курсеви од компјутерски науки. Ќе се изучуваат напредни техники за докажување, индукција рекурзија. Студентите треба да стекнат вештини за решавање на комбинаторни задачи. Да се запознаат со основната терминологија и основите за претставување на графови.',
        'To introduce students to basic mathematical concepts as a foundation for the following courses in information technologies, computer and software engineering.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'механизам на интерна евалуација и анкети', '', 'Реализирани актибвности 15.2 и 16.1',
        '45', '45', '0', '0', '90', '180', '0', '0', '100', '0'),
       ('F18L1S034', '', 'Calculus 2', '6', '2', '1', '2023', 'Македонски и англиски',
        'Интегрирање: неопределен интеграл, интегрирање со замена. Определен интеграл. Фундаментална теорема во калкулус. Техники на интегрирање: парцијална интеграција, тригонометриски интеграли, тригонометриски смени, интегрирање на дробно-рационални функции. Примена на интеграли за пресметување на: плоштина, волумен, должина на лак на крива, плоштина на ротациона површина. Низи и редови. Диференцијални равенки: решавање на равенки со раздвоиви променливи, линеарни диференцијални равенки од прв ред, хомогени и нехомогени линеарни диференцијални равенки од втор ред.', 'Integration: Indefinite integral, Integration by substitution. Definite integral. Fundamental theorem of integral calculus. Integration techniques: integration by parts, trigonometric integrals, trigonometric substitution, integration of fractions. Application of integrals in computing: area, volume, arc length and
rotation area. Arrays and series. Differential equations: solving equation by separation of variables, first-order linear differential equations, second-order homogeneous and non-homogeneous differential equations.',
        'Предметот е од подршка и е неопходен за воведување на поимите за интеграли, примена на интерграли, низи и редови кои се неопходни во дел од предметите од повисоки години.',
        'This course is a support course. It introduces the terms of an integrals, application of integrals, sequences and series which are important for advanced courses.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'механизам на интерна евалуација и анкети', '', 'Реализирани актибвности 15.2 и 16.1',
        '45', '45', '10', '0', '80', '180', '0', '0', '100', '0'),
       ('F18L1S052', '', 'IT systems for learning', '6', '2', '1', '2023', 'Македонски и англиски',
        'Содржина на програмата: Модели/теории за учење: Бихејвиоризам, когнитивизам, конструктивизам... Наставен дизајн. Испитување и модели за оценување. Основна примена на ИКТ во образованието. Системи за управување со настава и наставни материјали. Пример на системи за е-учење на програмирање и други области. Системи за проверка на знаење. Учење низ компјутерски игри. Сегашност и иднина на системите за е-учење.',
        '',
        'Цели на предметната програма (компетенции): По успешното завршување на овој предмет, студентот ќе биде запознат со еволуцијата на теориите за учење и ќе биде во состојба да ги разбере улогата и новите трендови кај е-околините за учење и да го разбере преминот од традиционалните во е-околините за учење. Студентите ќе се стекнат со способност да понудат соодветни постојни системи за менаџмент со учење и наставни содржини и системи за проверка на знаење на бизнис побарувања, како и да креираат нови иновативни решенија во областа на е-учењето.',
        '', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'механизам на интерна евалуација и анкети', '', 'Реализирани актибвности 15.2 и 16.1',
        '30', '45', '15', '15', '75', '180', '0', '15', '40', '20'),
       ('F18L1S146', '', 'Fundamentals of web design', '6', '2', '1', '2023', 'македонски и англиски', 'Вовед во WWW, Историја на WWW, основи на прегледувачи. Структура на веб страници со HTML 5 тагови, својства, историја на тагови и системи. Компатибилност со поранешните верзии на HTML и XHTML. Каскадни стилови – CSS3, својства, единици за должина, селектори, псевдоелементи, моделна кутија, Позиционирање, маргини, организирање распоред на страна – методи
Вовед во дизајн, методологии, Структура и архитектура на сајт, навигација, функционалност, Пишување за веб, типографија, Боја, концепти од дизајн, златен пресек, контраст. Основи на Usability, Основи на Accessibility', 'Introduction to WWW, history of WWW, introduction to web browsers. Structuring the web pages with HTML 5 tags, properties, tag history, and systems. Compatibility between previous versions of HTML and XHTML. Cascading styles - CSS3, properties, length units, selectors, pseudo-elements, the box model, positioning, margins, layout organization - methods
Introduction to design, methodologies, structure and architecture of the site, navigation, functionality, writing for web, typography, color, concepts of design, gold cross-section, contrast. Fundamentals of Usability, Basics of Accessibility.', 'По комплетирање на курсот кандидатите се очекува студентите да добијат воведни знаењаза развој на веб страници со современ дизајн, употреба на ХТМЛ и каскадни стилови. Се очекува кандидатите да:
1. Демонстрираат основно разбирање на важноста на добар дизајн на веб страниците.
2. Демонстрираат практично знаење за технологиите за веб дизајн и да можат да го применат знаењето при основно дизајнирање на веб сајтови.
3. Да комуницираат со терминологија специфична за оваа област.
4. Критички да евалуираат примери на веб сајтови.', 'Upon completion of the course, students are expected to gain introductory knowledge for developing web pages with contemporary design, by using the HTML and cascading styles. The students are expected to:
1. Demonstrate a basic understanding of the importance of good website design.
2. Demonstrate practical knowledge about web design technologies and apply knowledge in basic designing of web sites.
3. To communicate by the usage of terminology specific to this area.
4. Critically evaluate examples of web sites.', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и
семинарска работа, учење во електронско опкружување (форуми, консултации).', 'механизам на интерна евалуација и анкети',
        '', 'реализирани активности 15.1 и 15.2', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L1W005', '', 'Business and Management', '6', '1', '1', '2023', 'Македонски и англиски',
        'Основни поими и дефиниции на менаџмент; претпријатија и менаџмент; историја на науката за менаџментот; ограничувања и предизвици со кои се соочува менаџментот денес; менаџмент на промени и иновации; менаџмент на општествена одговорност и етика; менаџерите како носители на одлуки; основи на планирање; стратегиски менаџмент; алатки и техники за планирање; традиционални и современи видови дизајн на организациите; менаџмент на човечки ресурси; менаџмент на кариера; менаџмент на тимови; разбирање на однесувањето на поединците; менаџери и комуникации; мотивирање на вработените; лидерство; контролирање; менаџмент на операции; менаџмент во глобално опкружување.',
        'Basic concepts and definitions of management; enterprises and management; history of management science; the limitations and challenges management faces today; change management and innovation; managing social responsibility and ethics; managers as decision makers; basics of planning; strategic management; planning tools and techniques; traditional and modern types of organizations design; human resource management; career management; team management; understanding the individual behavior; managers and communications; motivating employees; leadership; controlling; operation management; management in a global environment.', 'Развој на менаџерски способности: техничка, концепциска, комуникациска, аналитичка.
Усвојување на рамки, поими, модели и техники од областа на менаџментот.
Презентирање и анализа на примери, студии на случај и најдобри менаџмент практики од повеќе бизнис области и студии на случај на поодделни бизниси.', 'Developing managerial skills: technical, conceptual, communication, analytical.
Adoption of frameworks, concepts, models and techniques in the field of management.
Presentation and analysis of case studies and best management practices from multiple business areas and case studies of individual businesses.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'механизам на интерна евалуација и анкети', '', 'Реализирани актибвности 15.2 и 16.1',
        '30', '45', '15', '15', '75', '180', '0', '15', '80', '10'),
       ('F18L1W007', '', 'Introduction to Computer Science', '6', '1', '1', '2023', 'Македонски и англиски',
        'Историја на информатика и први компјутери. Аналогни и дигитални сигнали. Репрезентација на броеви: битови, бајти. Архитектура и организација на компјутери: процесори, меморија, периферни уреди. Интернет, ip адреси, рутирање, етернет, wi-fi. Софтвер и ако истиот се извршува. Општо за компјутерска безбедност. Дигитални податоци: слики, видеа, аудио, компресија. Преглед на областите во компјутерски науки и инженерство.',
        'The history of informatics and first computers. Analog and digital signals. Representation of numbers: bits, bytes. Architecture and organization of computers: processors, memory, peripherals. Internet, ip addresses, routing, ethernet, wi-fi. Software and its operations. Basics of computer security. Digital data: images, videos, audio, compression. An overview of computer science and engineering disciplines.',
        'Солидно познавање на основите на информатичко-комуникациските технологии, нивното создавање, моментална состојба и иднината; начинот на кој функционираат сметачите, основите на Веб, обработката на сликите, видеото и анимациите; клучните области на информациско-комуникациските технологии и нивното влијание: спососност за манипулација со текст, табели, графикони, слики, аудио и видео.',
        'The goal of this course is to obtain a solid knowledge of the basics of information and communication technologies, their creation, the current and future trends; the way computers work, the basics of the Web, image processing, video and animations; key areas of information and communication technologies and their impact: the ability to manipulate text, tables, graphs, images, audio and video.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'механизам на интерна евалуација и анкети', '', 'Реализирани активности 15.2 и 16.1',
        '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L1W011', '', 'Discrete Mathematics', '6', '1', '1', '2023', 'Македонски и англиски', '(1) Искази, операции со искази, исказни формули и логички закони (1) Исказни функции, предикатно сметање, превод на реченици во исказни формули и функции. (1) Методи на изведување на заклучоци и примена (1) Методи на докажување (1) Множества (1) Функции (1) Релации,  подредување и еквиваленција (1) Графови: презентација и својства (сврзаност, ојлеров и хамилтонов пат, најкраток пат).(1) Изоморфност, боење и планарност на графови.
Дрва: Основни поими кај дрва и коренови дрва (1) Примена на Коренови дрва и пребарување во коренови дрва.
Скелетни дрва (најлесни дрва и пребарувачки дрва) (1) Комбинаторика (премутации и комбинаци со и без повторување). биномна формула (1) Принцип на вклучување и исклуување, итераци и рекурзија',
        '(1) Propositions,  operations with propositions, compound propositions and Laws of logic, (1) Propositional functions, predicate calculus and translating sentences into compound propositions and propositional functions,  (1) Rules of inference and applications, (1) Proof methods, (1) Sets,  (1) Functions, (1) Relations: equivalence relations and partial ordering, (1) Graphs: representation and properties (connectivity, Euler and Hamilton paths, shortest path (1) Isomorphism , graph coloring and planar graphs. Trees: basic  terminology and  rooted  trees, (1) Applications of rooted  trees, Spanning trees (minimum spanning  trees and search trees), (1) Combinatorics (permutations and combinations), binomial formula, (1)  Inclusion-exclusion principle, iterations and recursion.',
        'Курсот претставува вовед во основните математички концепти неопходни за повисоките курсеви од информациски технологии, компјутерско и софтверско инженерство.',
        'To introduce students to basic mathematical concepts as a foundation for the following courses in information technologies, computer and software engineering.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'механизам на интерна евалуација и анкети', '', 'Реализирани актибвности 15.2 и 16.1',
        '45', '45', '0', '0', '90', '180', '0', '0', '100', '0'),
       ('F18L1W018', '', 'Professional skills', '6', '1', '1', '2023', 'Македонски и англиски',
        'Содржина по недели: (1) Вовед, нетехнички вештини за еден инженер, начин на кој технологијата ја менува комуникацијата меѓу луѓето, етика наспроти закон (2) Ефикасни комуникациски стратегии, (2) Пишување технички извештаи (1) Вештини за комуникација и презентација (2) Подготовка на презентации, стратегии за ефективна комуникација (1) Користење на визуелна помош и алатки за комуникација (1) Работа во тимови, интердисциплинани тимови, решавање на конфликти (1) Социјални ефекти на инженерските решенија (ризици, сигурност, ...) (1) Етички прашања во професијата (1) Интелектуална сопственост и правни аспекти.',
        'Introduction. Nontechnical skills of an engineer. The change of way of communication between the humans induced by the technology. Ethics versus law. Effective communication strategies. Writing technical reports. Communication and presentation skills. Preparation of presentations and strategies for effective communication. Using visual tools for communication. Teamwork, interdisciplinary teams and conflict resolution. Social effects of engineering solutions (risks, security). Ethical issues in the profession. Intellectual rights and law.',
        'Целта на курсот е да студентите да се стекнат со вештини потребни за академско и техничко пишување и презентирање, со водење сметка за етиката и критичкото мислење. По завршување на курсот се очекува студентот да може да изработи квалитетни академски текстови (пасус, есеј, CV, формално писмо) на англиски и македонски јазик; да разликува помеѓу различни технички текстови (спецификација, елаборат, извештај, техничка документација) и да идентификува нивни делови; да одржи 15-минутна ефективна презентација на зададена тема на англиски јазик и да одговори на прашања поврзани со презентацијата;',
        'The aim of the course is to provide the students with the skills necessary for academic writing and presentation, by caring about the ethics and critical thinking. After completion of the course it is expected from the student to be able to write quality academic texts (paragraph, essay, CV, formal letter) both in Macedonian and English language; to differentiate between different technical texts (specification, report, study, technical documentation) and to identify their parts; to give effective 15 minutes presentation on given topic in English language and to reply to the given questions about the presentation.',
        'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и семинарска работа.',
        'механизам на интерна евалуација и анкети', '', 'Реализирани активности 15.2 и 16.1', '60', '0', '15', '15',
        '60', '180', '10', '15', '70', '10'),
       ('F18L1W020', '', 'Structural programming', '6', '1', '1', '2023', 'Македонски и англиски',
        'Вовед во предметот, програмски јазици, Начин на запис на  броеви во компјутер, концепт на структурно програмирање, променливи, прва програма, Операции / аритметички / релациски, логички, Контролни структури, ако-тогаш-инаку, циклуси, алгоритми (правилно алгоритамско размислување и развивање  програми, Низи, Функции, Низи од знаци, Функции 2 / рекурзија, Датотеки, Обработка на интегриран пример',
        'Introduction, Programming languages and paradigms, Number representation, Structured programming concepts, Variables, Types of data and operations, Control structures, Algorithms, Functions, Recursion, Complex data structures – arrays, matrices, pointers. Files. Applications: programming language working environment.', 'Да се воведат студентите во парадигмата на структурното програмирање, да го разберат концептот на алгоритми и да се оспособат да развиваат алгоритми, да кодират, тестираат и компајлираат програми.
Ќе бидат воведени податочните типови, контролните структури,функциите, полињата, датотеките.', 'To introduce the students to the Structured programming paradigm, to understand the concept of algorithms and to enable them to develop algorithms, to code, test and compile programs.
There will be introduction of data types, control structures, functions, arrays and files.',
        'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и семинарска работа.',
        'механизам на интерна евалуација и анкети', '', 'Реализирани активности 15.2 и 16.1', '30', '60', '15', '15',
        '60', '180', '15', '15', '75', '10'),
       ('F18L1W031', '', 'Discrete structures', '6', '1', '1', '2023', 'Македонски и англиски',
        'Исказна логика и логички закони. Предикатна логика и квантификатори. Изведување на логички заклучоци. Докази и техники за докажување. Множества. Функции и кардиналност., Суми. Деливост. Булови алгебри, Булови функции, логички кола и минимизација.',
        'Propositional logic and Laws of logic. Predicate logic and quantifiers. Rules of inference. Proofs and proof techniques.  Sets. Functions and cardinality. Sums. Divisibility. Boolean algebra, Boolean functions,  logic gates and minimization.',
        'Во овој предмет ќе се изучуваат базични математички концепти за компјутерски науки. Студентите ќе се запознаат со основите на множества, исказна и предикатна логика, техники за докажување и булова алгебра.',
        'To introduce students to basic mathematical concepts as a foundation for the following courses in information technologies, computer and software engineering.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'механизам на интерна евалуација и анкети', '', 'Реализирани актибвности 15.2 и 16.1',
        '45', '45', '0', '0', '90', '180', '0', '0', '100', '0'),
       ('F18L1W033', '', 'Calculus 1', '6', '1', '1', '2023', 'Македонски и англиски', 'Дефиниција на функција. Својства на функции. Oперации со функции. Прави. Фамилии од функции. (2)Инверзни функции. Инверзни тригонометриски функции. Експоненцијални и логаритамски функции и нивни
инверзни функции. Лимеси. Пресметување на лимеси. Непрекинатост. Дефиниција на извод. Техники на диференцирање. Извод од сложена Функција. Апроксимација со тангента и диференцијал.  Лопиталово правило.
Примена на изводи: монотоност на функции, конвексност и конкавност на функции, локални екстреми. Испитување на својства и скицирање на график на функција. Глобални екстреми.',
        'Definition of function. Function properties. Operations with functions. Lines. Family of functions.  Inverse functions. Inverse trigonometric functions. Exponential and logarithmic functions and their inverse functions.  Limits. Limit calculations. Continuity. Derivative definition.  Derivation techniques. Derivative of a composite function. Tangent and deferential approximation. L`Hôpital`s rule. Application of derivatives: function monotonicity, concave and convex functions, local extreme values. Properties of functions and making graph of a function. Global extreme values.',
        'Предметот е од подршка и е неопходен за воведување на поимите за функција, лимес и извод кои се неопходни во скоро сите предмети од повисоки години.',
        'This course is a support course that is essential for introducing the terms of a function, limits and derivative. These terms are important for almost all courses in the following years.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'механизам на интерна евалуација и анкети', '', 'Реализирани актибвности 15.2 и 16.1',
        '45', '45', '10', '0', '80', '180', '0', '0', '100', '0'),
       ('F18L1W041', '', 'Digital design', '6', '1', '1', '2023', 'Македонски и англиски',
        '(1) Бројни системи, систем со основа r, претворба (2) Комплементи, прв, втор, радикс. Булова аритметика. Кодови, тежински, грејов, BCD, ASCII, Хамингово растојание, Хамингов код (2) Булова алгебра и прекинувачки фунции, логички порти, минтерми, макстерми, нивоа на интегираност (1) Минимизација на функции со Карноови мапи и Квин Меклавски (1) Анализа и дизајн на комбинациони кола, табела на вистинитост, полусобирач, целосен собирач (1) Кодери, декодери, мултиплексери и демултиплексери, ROM, PLA (2) Синхрони и асинхрони секвенцијални кола, такт генератор, лечови и флип-флопови, карактеристични табели и равенки (2) Анализа и дизајн на синхрони секвенцијални кола, равенки, табела и дијаграм на состојби, Мурови и Милиеви автомати, минимизација на бројот на состојби, кодирање на состојби  (2) Регистри, паралелно и сериско полнење, поместување и бројачи, модуло бројачи, кружни бројачи, Џонсонов бројач',
        'Number systems with base r, Number-Base conversion, Complements of numbers, Boolean arithmetic, Codes, weighted codes, Gray code, BCD, ASCII, Hamming distance, Hamming code, Boolean algebra and switching functions, Logical gates, Minterms, Maxterms, Levels of integration, Gate-Level Minimization,  Analysis and design of digital circuits, Truth  table, Half and Full adder, Coder, Decoders, Multiplexers and Demultiplexer, ROM, PLA, Synchronous and asynchronous sequential circuits, Clock generator, Latch and flip-flop, State table and equation, Analysis and design of synchronous sequential circuits,  Mealy and Moore machine,  Minimazation of number of states,  State coding, Registers, Serial and parallel data loading, Shifting, Counters,  Ripple counters, Jonson counter', 'Запознавање со основните методи за анализа и дизајн на логички кола и логички мрежи, како комбинациони така
и секвенцијални кола, регистри и бројачи.',
        'Introduction of basic methods for analysis and design of combinational and sequential circuits, registers and counters.',
        'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и семинарска работа.',
        'механизам на интерна евалуација и анкети', '', 'Реализирани активности 15.2 и 16.1', '30', '45', '15', '15',
        '75', '180', '10', '15', '70', '10'),
       ('F18L1W049', '', 'Physics', '6', '1', '1', '2023', 'македонски и англиски',
        'Физички велични и единици. Скаларни и векторски величини. Кинематика на материјална точка. Њутнови закони на движењето. Работа, енергија, импулс и закони за запазување. Осцилаторно движење. Механички бранови. Механика на кружното движење. Механика на флуиди. Температура и топлина. Гасни закони. Геометриска оптика. Физичка оптика',
        'Physical quantities and units. Scalar and vector quantities. Kinematics. Newton laws of motion. Work, energy, momentum and conservation laws. Oscillatory motion. Mechanical waves. Mechanics of rotational motion. Fluid mechanics. Temperature and heat. Gas laws. Geometrical optics. Physical optics.',
        'Студентите ќе се запознаат со основните физички величини и закони од класичната механика. Тие ќе се стекнат со основни вештини за експериментална работа, како и за пресметување и правилно толкување на добиените резултати од областите кои се дел од содржината. Теоретските знаења на студентите ќе бидат солидна подлога за понатамошна надградба која е потребна за разбирање и моделирање на различните процеси каде што се применуваат информатиката и компјутерското инженерство.',
        'The students will gain knowledge about the basic physical quantities and laws in classical mechanics. They will learn the basic skills for experimental work, as well as calculations and proper interpretation of the obtained results in the physical areas which are studied of the course. The theoretical knowledge will be solid basis for further further upgrade which is necessary for understanding and modeling different phenomena where the computer science and engineering are applied.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'механизам на интерна евалуација и анкети', '', 'завршени лабораториски вежби', '45',
        '30', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L1W070', '', 'Pedagogy', '6', '1', '1', '2023', 'Македонски и англиски', '(1) Педагогијата како наука.
(1) Темелни определби на педагошката наука.
(1) Педагогијата и другите науки.
(2) Системот на педагошките дисциплини.
(2)  Феноменот на воспитанието.
(2) Моќта и границите на воспитанието.
(1) Воспитен процес.
(1) Целта и задачите на воспитанието.
(1) Темелни воспитни подрачја.
(1) Училишен систем.', '', '', '', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'механизам на интерна евалуација и анкети', '', 'Реализирани актибвности 15.2 и 16.1',
        '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L2S002', '', 'Software requirements analysis', '6', '4', '1', '2023', 'македонски и англиски', '(1)Дефинирање на барања (на пр., Производ, проект, ограничувања, системски граници, надворешни и внатрешни)
(1)Процес на инженерство на барања
(1)Слоеви / нивоа на барања (на пр., Потреби, цели, кориснички барања, системски барања и софтверски барања)
(1)Карактеристики на барањата (на пример, тестирање, недвосмислена, конзистентна, точна, следи, и приоритет)
(1)Анализа на квалитетот (нефункционалните) барања (на пример, безбедноста, безбедноста, употребливоста и перформансите)
(1) Софтверски барања во контекст на системско инженерство
(1)Евоуција на барања, следење, приоритет, анализа на компромис, анализа на ризик и анализа на влијанието
(1)Управување со барања (на пример, управување со конзистентноста, планирање на издавање и повторна употреба), Интеракција меѓу барањата и архитектурата
(1)Елицитација на барања, извори за извлекување (на пр., засегнати страни, експерти за домен, и оперативни и организациски средини), техники за елцитација (на пример, интервјуа, прашалници / анкети, прототипови, случаи на употреба, опсервација и техники на партиципација)
(1)Спецификација и документација на барања , основа на документација за барања (на пр., видови, намена, структура, квалитет, атрибути и стандарди)
(1)Техники за спецификација на софтверски барања (на пр., Документација за барања за планови, табели за одлуки, кориснички приказни и спецификации за однесувањето)
(1)Валидација на барањата, Осврти и инспекции, Прототипирање за да се потврдат барањата
(1)Дизајн за тест за прифаќање, Потврдување на атрибути за квалитет на производот, Анализа на интеракција на барањата (на пример, функциска интеракција), Анализа на формални барања',
        '', 'По завршувањето на предметот се очекува студентот да ги разбира и има продлабочено знаење во примена на техниките за
извлекување знаење од клиентот, да ги разбира техниките за документирање на софтверски и бизнис потреби, да ги разбира
и има продлабочено знаење во примената на техники за управување со промени кај софтверски и бизнис барања.', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на
опрема и софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'механизам на интерна евалуација и анкети', 'Објектно ориентирана анализа и дизајн или Софтверско инженерство',
        'Редовно посетување настава (до 3 отсуства), навремно доставување на сите домашни задачи, семинарски работи, дискусии на форум и проект',
        '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L2S030', '', 'Artificial Intelligence', '6', '4', '1', '2023', 'Македонски и англиски', 'За вештачката интелигенција
За интелигентните агенти
Вовед во пребарувањето
Неинформирано пребарување
Информирано пребарување
Спротивставено пребарување
Исполнување услови
Логички агенти и предикатно сметање
Веројатносно расудување
Претставување на знаењето
Учење на вештачките системи
Невронски мрежи
Генетски алгоритми
Комуникација меѓу агентите', 'Artificial intelligence
Intelligent agents
Introduction to search
Heuristic search
Adversarial search
Constraints satisfaction
Logical agents and predicate calculus
Probabilistic reasoning
Knowledge representation
Learning
Neural networks
Genetic algorithms
Communication',
        'Успешниот студент ќе има продлабочени познавања од основните области на вештачката интелигенција, вклучувајќи ги: пребарувањето, решавањето проблеми, претставувањето на знаењето, расудувањето, донесувањето одлуки, планирањето и учењето и нивната примена. Исто така, ќе биде во состојба да ги дизајнира и реализира клучните проблеми од интелигентните системи со средна сложеност и да го процени нивното однесување.',
        'Upon successful completion of the course, students will have an understanding of the basic areas of artificial intelligence including search, problem solving, knowledge representation, reasoning, decision making, planning, perception and action, and learning -- and their applications. Students will also be able to design and implement key components of intelligent agents of moderate complexity and evaluate their performance.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'механизам на интерна евалуација и анкети', 'Алгоритми и податочни структури',
        'Реализирани активности 15.2 и 16.1', '30', '60', '15', '15', '60', '180', '40', '15', '50', '10'),
       ('F18L2S042', '', 'Electric Circuits', '6', '4', '1', '2023', 'Македонски и англиски',
        '(1) Потенцијал на електрично поле и електричен напон. (1)  Капацитивност и кондензатори. (1) Стационарна електрична струја ( DC). Електрична отпорност. Омов  и  Џулов закон.  (1)  Електрични извори и електромоторна сила. Електрични мрежи во DC-режим. (2) Методи за решавање на електрични кола. Суперпозиција. Тевененова теорема. (5ч) Софтверски алатки за решавање на DC-електрични кола. (1)  Временски константно магнетно поле. Вектор на магнетна индукција. (1) Амперов закон. (1) Електромагнетна индукција. Принцип на работа на електричен генератор, мотор и трансформатор. (1) Временски променливи простопериодични струи и нивно претставување со фазори и комплексни броеви. Аналитички методи за решавање на RLC. (1) Методи за решавање на сложени електрични кола во AC- режим. (1) Модел и анализа на едноставни  RLC кола со помош на симулатор на коло.',
        'Potential of electric field and electric voltage. Capacities and capacitors. Stationary electrical current (DC) .Electric resistance. Om and Jules Law. Electric sources and electromotive force. Electrical networks in DC mode. Methods for solving electric circuits. Superposition. Teven`s theorem. Software tools for solving DC-electric circuits.Time constant magnetic field. Vector of magnetic induction.  Ampere law. Electromagnetic induction. Principle of operation of electric generator, motor and transformer. Time variables of simple periodic currents and their representation with phases and complex numbers. Analytical methods for solving RLC. Methods for solving complex electrical circuits in AC mode. Model and analysis of simple RLC circuits using a circuit simulator.',
        'Запознавање со основните поими и појави од електричните кола, со основните закони и теореми во теоријата на електричните кола и со некои методи за анализа на електрични мрежи со временски констатни и временски прпоменливи струи и напони. Користење на основните законитости во електротехниката при решавање на конкретни проблеми во инженерството.',
        'Introduction to the basic concepts and phenomena of electric circuits, basic laws and theories in the theory of electric circuits and some methods for analyzing electrical networks with time constant and time-varying currents and voltages. Using the basic laws in electrical engineering in solving specific problems in engineering.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'механизам на интерна евалуација и анкети', '', 'Реализирани актибвности 15.2 и 16.1',
        '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L2S051', '', 'ICT in education', '6', '4', '1', '2023', 'Македонски и англиски',
        'Содржина на програмата: Oсновни концепти за е-учење, м-учење, е-учење 2.0. Разгледување на предизвици при воведување на ИКТ во образованието во светот, актуелни примери на воведување на ИКТ во образованието кај развиените земји и земјите во развој. Видео игри, масивни отворени онлајн курсеви, оддалечени и виртуелни лаборатории, виртуелни училници, социјални мрежи и мултимедија во образованието. Вовед во компјутерско размислување. Користење на апстракции и препознавање на шаблони за прикажување на проблеми на нови и различни начини. Логично организирање и анализа на податоци. Декомпозиција на проблеми во помали делови. Напад на проблемот користејќи техники за програмско размислување, како што се повторување, симболичка репрезентација и логички операции. Онлајн и офлајн алатки за развој на компјутерското размислување. Компјутерско размислување во едукативни дигитални игри. Имплементација на решенија во визуелен програмски јазик.',
        '',
        'Преку изучување на основните концепти за е-учење, м-учење, е-учење 2.0, разгледување на предизвици при воведување на ИКТ во образованието во светот, актуелни примери на воведување на ИКТ во образованието кај развиените земји и земјите во развој студентите ќе добијат еден поширок и сеопфатен поглед на темата. Низ примери за примена на видео игри, масивни отворени онлајн курсеви, оддалечени и виртуелни лаборатории, виртуелни училници студентите ќе се запознаат со можностите за искористување на ИКТ за поддршка на образованието и со современите едукативните принципи кои се користат во процесот на учење потпомогнато со технологии. Преку практична работа студентите ќе се запознаат и ќе развијат вештини за компјутерско размислување.',
        '', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'механизам на интерна евалуација и анкети', 'ИТ системи за учење',
        'Реализирани актибвности 15.2 и 16.1', '30', '45', '15', '15', '75', '180', '0', '15', '20', '35'),
       ('F18L2S082', '', 'Visual programming', '6', '4', '1', '2023', 'македонски и англиски',
        'Развојни околини. Настански водено програмирање. Волшебник за креирање апликации и дизајнер на форми. Контроли за приказ на информации на корисникот, контроли кои поттикнуваат настани, контроли за внесување текст, за приказ и промена на состојбата, за приказ на информации во вид на листи контроли за групирање на други контроли во рамки на апликација. Генерирање и обработка на настани. Временски поттикнати настани. Графички кориснички интерфејс за напредни апликации, локализација (l10n) и интернационализација (i18n). Кориснички менија, алатници и статусни ленти. Креирање на кориснички дефинирани контроли. Нитки и меѓупроцесна комуникација, споделување на ресурси и размена на содржина помеѓу апликации. Креирање на инсталациски пакети.',
        'Development environments. Event-driven programming. Application wizards and forms designers. User controls, event controls, text controls, state controls, list controls, group controls. Generating and handling events. Time generated events. Graphical user interfaces, localization (l10n) and internationalization (i18n). User menus, toolbars and status bars. Custom user controls. Multithreading, resource sharing, inter-process communication. Creating installation packages.', 'Со завршување на овој курс се очекува студентите да се запознаени со техниките за развивање на софтвер во
напредна интегрирана развојна околина користејќи модерен објектно-ориентиран програмски јазик, дизајнирање
на богати графички кориснички интерфејси и откривање и отстранување на грешки во истата.Се очекува
студентите да бидат оспособени за развој на настански водени апликации, развој на графички кориснички
интерфејси, напредни форми за внесување на податоци, кориснички дефинирани контроли и креирање на
инсталациски пакети.',
        'The student will attain knowledge of software development techniques by using modern object-oriented programming language in advanced integrated development environment, designing user interfaces and software debugging. After completing the course, the students will be capable for developing event-driven application, graphical user interfaces, advanced forms for user input, custom user controls and creating installation packages.',
        'предавања, аудиториски вежби, лабораториски вежби, проектни задачи, домашни задачи',
        'механизам на интерна евалуација и анкети', 'Објектно-ориентирано програмирање',
        'реализирани активности 15 и 16', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L2S090', '', 'Introduction to Stochastic Processes', '6', '4', '1', '2023', 'македонски и англиски', 'Случајни процеси: дефиниција, карактеристики, класификација, трансформации. Стационарност на случајни
процеси. Вериги на Марков. Процеси на разгранување. Пуасонов процес. Марков процес.  Системи за масовно опслужување (системи со редици на чекање). Брауново движење (Винеров процес).', 'Stochastic processes: definition, characteristics, and transformations. Stationary of random processes. Markov chain. Branching processes.
Poisson process. Markov process. Queuing systems. Brownian motion (Winner process).', 'Да се оспособат студентите да моделираат случајни процеси за реални ситуации.
', 'Students will be able for modelling of stochastic processes in real situations.', 'Усвојување на поимите, својствата и техниките со самостојна работа; решавање на поставени задачи и проблеми
за вежбање; изработка на проектна задача.
', 'механизам на интерна евалуација и анкети', 'Веројатност и статистика или Основи на теорија на информации',
        '15.1 и 15.2', '30', '30', '25', '15', '80', '180', '0', '15', '75', '0'),
       ('F18L2S095', '', 'Digital image processing', '6', '4', '1', '2023', 'македонски и англиски',
        'Историски преглед; Видови на слики и уреди за креирање на слики; Приказ на слики; Дигитални слики и пиксели; Компоненти на боја; Преглед на апликации и примери за дигитална обработка на слики; Дигитализација на слика: 2-D семплирање и реконструкција; квантизација; дигитализација; Вовед во OpenCV и Python; Основни операции со слики; Трансформации на ниво на пиксели во слики; Хистограм на слики; Констраст и гама на слика; Израмнување на хистограми; Адаптивнио израмнување на хистограми; Простор на бои; Линеарни филтри и конволуција; Измазнување и изострување на слика; Детекција на рабови: методи базирани на градиентот, методи засновани на лапласијанот; спојување на рабови; Сегаментација на слика: сегментација базирана на прагови; сегментација базирана на региони; Морфолошки операции над слика: дилатација/ерозија; отворање/затворање; екстракција на граница; пополнување на региони; екстракција на поврзани компоненти; истенчување; здебелување; скелетонизација; 2-D Фуриеова трансформација и особини. Вејвлети и мултирезолуциско процесирање. Темплејти и пирамиди на слики; Компресија на слика; Детекација на форми во слика и анализа на контури; Извлекување на визуелни карактеристики од слики. Детекација на клучни точки; Панорамски слики; Примена на алгоритми за обработка на слики.',
        'Introduction; The basics of digital image processing; Representation and digitalization of images; Tools and programs for digital image processing; Digital images and pixels; Color components; Application domains; 2-D sampling and reconstruction; quantization; digitalization; Introduction to OpenCV and Python; Basic operations with images; Point based operations; Image histograms; Contrast and gamma; Histogram equalization; Adaptive histogram equalization; Color space; Theory of colour. Colour correction and special effects; Linear filters and convolution;  Blurring and Sharpening Images; Edge detection; Image segmentation; Morphological operations: dilatation/erosion; opening/closing; Contour extraction; Region filling; Skeletonization; Transformations, effects, filters and deformation; Visual descriptors; Key-point extraction; Panorama stitching',
        'По завршување на курсот се очекува студентот да ги владее и користи основните алатки и методи за обработка на слики.',
        'Upon the completion of the course the student is expected to rule and use the basic tools and methods for image processing.', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).
', 'механизам на интерна евалуација и анкети', 'Дсикретна математика или Дискретни структури 2',
        'реализирани активности 15.1 и 15.2', '30', '45', '15', '15', '75', '180', '0', '15', '70', '0'),
       ('F18L2S097', '', 'Algorithm design', '6', '4', '1', '2023', 'македонски и англиски',
        'Што е алгоритам. Техники за дизајнирање на алгоритми и техники за пресметување на сложеност. Повеќедимензионално динамичко и алчно програмирање. Мемоизација во ДП. Пребарување во графови (класификација на ребра и темиња, време на посета и својства поврзани со нив). Алгорими за најкратки патишта од секое до секое теме и нивна примена. Алгоритми кои користат техники за премерување. Union find, фибоначиев куп и други понапредни структури  и пимена. Проток низ мрежа и min-cut max-flow. Дрва за пребарување (сегментни, интервални индексни). Алгоритми за шаблони во стрингови. Геометриски алгорими.',
        'Definition of an algorithm. Techniques for algorithm design and complexity analysis. Multidimensional dynamic programming and greedy algorithms. Memoization in DP. Graph searching (classification of edges and vertices, visiting time).All-pairs shortest paths from algorithms with  application. Reweighting. Union find, Fibonacci heaps and other advanced structures. Network flow and min-cut max-flow theorem. Search trees (segment, interval index). String processing. Geometric algorithms.',
        'Во овој курс ќе се научат повеќе алгоритми и методи за решавање на проблемите со компјутер, како и одредени структури на податоци за имплементација на истите. Студентот ќе стекне искуство од програмирање, ќе ги разбере  принципите на дизајнирање на алгоритми, анализа на перформансите на алгоритмите и ќе ги научи фундаменталните идеи за дизајн на ефикасен алгоритам и комбинирање на истиот со соодветна структура на податоци. Идеите ќе се применат во пракса преку лабораториск вежби.',
        'Upon completion of this course, students will become familiar with major algorithms and data structures and he will be able to apply important algorithmic design paradigms and methods of analysis and synthesize efficient algorithms in common engineering design situations. He will also learn to analyze the asymptotic performance of algorithms, and check the correctness of algorithms.', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка на домашни задачи. учење во
електронско опкружување (форуми, консултации).
', 'механизам на интерна евалуација и анкети', 'Објектно ориентирано програмирање',
        'реализирани активности 15.1 и 15.2', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L2S099', '', 'E-government', '6', '4', '1', '2023', 'македонски',
        'Вовед во е-влада; Дефинирање на информациски системи и информациската технологија; Дефинирање на јавниот сектор и примената на информациската технологија во јавниот сектор; Теориски модели на управување: минимална држава; корпоративно управување; нов јавен менаџмент; добро управување;социо-кибернетски систем; само-организирачки мрежи; Фази на развој на е-влада и е-управување; Придобивки и ризици на е-влада и е-управување; Дигитален јаз; Теории и модели за е-управување: Модел на интеракција меѓу јавната администрација и граѓаните од аспект на информациските системи од Chadwick и May; Моделот на четири фази на Layne и Lee; Стратегиската рамка на Watson и Mundy за е-Демократија; Адаптацијата на Flak и Rose на Теоријата на стеикхолдери од менаџмент теоријата кон областа на е-влада или е-управување; Моделот на Henderson и Venkatraman; Адаптација на теоријата на Henderson и Venkatraman, како доминантна теорија за примена на информациската технологија во приватниот сектор за примена во јавниот сектор; Согледување на светските искуства од најважните области на примена на е-Влада и на стратегиите за примена на информациските технологии во јавниот сектор според области на примена: е-инфраструктура, е-бизнис; Примена на информациските технологии во јавниот сектор според области на примена: е-здравство, е-образование, е-партиципација; Преглед на успешни стратегии на најнапредните земји од областа на е-влада: Естонија, Словенија, Австрија, Данска, Ирска, Финска, Индија, Сингапур, Европска Унија; Компаративна анализа на ИКТ проектите на владите на Македонија, Естонија и Словенија; Утврдување на перспективите на примената на информациската технологија во јавниот сектор и на е-влада во Република Македонија.',
        'Introduction to e-government; Defining information systems and information technology; Defining the public sector and the application of information technology in the public sector; Theoretical models of governance: a minimal state; corporate governance; new public management; good governance; socio-cybernetic system; self-organizing networks; Phases of e-government development and e-governance; Benefits and risks of e-government and e-governance; Digital Divide; Theories and models for e-governance: Model of interaction between public administration and citizens in terms of information systems from Chadwick and May; The model of the four stages of Layne and Lee; Watson and Mundy`s Strategic Framework for e-Democracy; The adaptation of Flak and Rose to Theory of steakholders from management theory to e-government or e-governance; The model of Henderson and Venkatraman; Adapting the theory of Henderson and Venkatraman as the dominant theory for the application of information technology in the private sector for application in the public sector; Recognizing the world-wide experiences of the most important areas of eGovernment application and strategies for applying information technologies in the public sector by application areas: e-infrastructure, e-business; Application of information technologies in the public sector according to the fields of application: e-health, e-education, e-participation; Overview of successful strategies in the most advanced e-government countries: Estonia, Slovenia, Austria, Denmark, Ireland, Finland, India, Singapore, the European Union; Comparative analysis of the ICT projects of the governments of Macedonia, Estonia and Slovenia; Determining the perspectives of the application of information technology in the public sector and e-government in the Republic of Macedonia.',
        'Целта на курсот е студентите да се запознаат со испораката на услугите од страна на владините институции кон корисниците: граѓаните, бизнисите и организациите од невладиниот сектор и примената на информациските технологии во тие процеси; да се запознаат со напредните држави и напредните области на примена на е-влада преку анализа на примери, студии на случај и најдобри практики; Подобрување на комуникациските вештини, усни и писмени, работа во тим при изработка на проектна задача, презентирање на проектната задача.', 'The students will be introduced to the delivery of services by government institutions to the beneficiaries: citizens, businesses and organizations from the non-governmental sector and the application of information technologies in those processes; they will get acquainted with advanced countries and advanced areas of e-government application through number of case studies and best practices.
The course will encourage development of communication skills, oral and written, team work skills in the preparation of a project task, presenting skills through the project task presentations.',
        'предавања, аудиториски вежби, проектни задачи, домашни задачи', 'механизам на интерна евалуација и анкети',
        'Бизнис и менаџмент', 'Реализирани актибвности 15.2 и 16.1', '30', '45', '15', '15', '75', '180', '0', '15',
        '80', '10'),
       ('F18L2S100', '', 'Economy for ICT engineers', '6', '3', '1', '2023', 'Македонски и англиски',
        'Што е економија? Економскиот проблем;  Понуда и побарувачка; Еластичност; Ефикасност и праведност; Организација на производството; Аутпут и трошоци; Главни активности кои се извршуваат при финансиски менаџмент на ИКТ услуги; Вреднување на ИКТ услугите; Моделирање побарувачка на ИКТ услугите; Менаџмент на портфолио на ИКТ услуги;  Оптимизација на обезбедување ИКТ услуги; Анализа на инвестиции во ИКТ услугите; Буџетирање, сметководство и определување цени; Финансиска усогласеност',
        'What is economics? The economic problem; Offer and demand; Elasticity; Efficiency and fairness; Organization of production; Output and costs; Main activities that are performed in the financial management of ICT services; Evaluation of ICT services; Modeling demand for ICT services; Management of a portfolio of ICT services; Optimization of providing ICT services; Analysis of investments in ICT services; Budgeting, accounting and pricing; Financial Compliance.',
        'ИКТ инженерите, изработувајќи и нудејќи ИКТ услуги, се соочуваат со прашања во врска со SLA договорите, продавачите, добавувачите, со финансиските аспекти на ИКТ услугите – колку чини услугата, зошто токму толку, колкави се трошоците, колку е дозволено да бидат трошоците и слично. Области кои им е потребно да ги владеат се буџетирање, книговодство, определување на цени, финансиско планирање, финансиска анализа и известување. Овој курс има за задача да им овозможи да ги совладаат овие области преку опис на основните  економски модели; демонстрирање како овие модели работат; опис на главните економски феномени со користење економски модели.',
        'ICT engineers, designing and offering ICT services, face questions about SLAs, vendors, suppliers, the financial aspects of ICT services - how much the service should be priced, why exactly that much , how much are the costs, how much they are allowed to cost, etc.. The areas that need to be introduced are budgeting, bookkeeping, pricing, financial planning, financial analysis and reporting. This course has the task of helping them to master these areas through a description of the underlying economic models; demonstrating how these models work; description of the main economic phenomena using economic models.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'механизам на интерна евалуација и анкети', 'Бизнис и менаџмент',
        'Реализирани актибвности 15.2 и 16.1', '30', '45', '35', '30', '40', '180', '10', '30', '70', '10'),
       ('F18L2S110', '', 'Internet technologies', '6', '4', '1', '2023', 'македонски и англиски',
        'Архитектура на динамички веб апликации. Комуникација на веб. Вовед во Web Application Development. Вовед во ASP.NET. Основи на веб форми. Веб контроли. Мастер страници и теми. Управување со состојби. Навигација. Работа со бази на податоци. Работа со бази на податоци. Сигурност на веб апликација. СОА и веб сервиси. MVC',
        'Architecture of dynamic web applications. Web communication. Introduction to Web Application Development. Introduction to ASP.NET. Basics of web forms. Web controls. Master pages and themes. Management of conditions. Navigation. Working with databases. Working with databases. Web application security. SOA and web services. MVC', 'Познавање на механизмите кај HTTP протоколот. Запознавање со платформи за развој на интернет апликации.
Креирање и развој на веб апликции. Креирање и користење на веб сервиси.
',
        'Knowledge of the mechanisms in the HTTP protocol. Introduction to Internet Application Development Platforms. Creating and developing web apps. Creating and using web services.',
        'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'механизам на интерна евалуација и анкети', 'Објектно-ориентирано програмирање', '30 + 45 + 105 = 180 часа',
        '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L2S119', '', 'Concepts of Information Society', '6', '4', '1', '2023', 'македонски и англиски',
        'Развојот на информатичкото општество и основни концепти; Глобализацијата и информатичката технологија: развојот на информатичкото општество и влијанието на глобализацијата на дигиталниот свет; Победници и губитници во времео на информатичкото општество: анализа на теми на национално, локално и индивидуално ниво; Дигитален јаз. Информатичките технологии и дигиталните домови. Влијанието на мобилните телефони, WIFI, дигиталните технологии во начинот на живеење; Интернет и неговото значење во секојдневниот живот на луѓето; Концептуални рамки за анализа на различните влијанија на информатичките технологии; Компјутерски криминал;    Паметни картички, дигитален индетитет; Компјутерска етика; Надгледувано општество и ИТ;     ИТ и заканите за безбедност во модерните општества.',
        '', 'Целта на курсот е да се запознаат студентите со теориите и пристапите кои ја анализираат улогата на информатичката технологија, медиумите и знаењето во модерното општество. По завршување на модулот студентите треба да бидат способни да:
1.  Систематски и критично дискутираат, евалуираат и ги анализираат главните теми, принципи, концепти и теории на информатичкото општество
2.  Применуваат различни концепти од информатичкото општество
3.  Покажат разбирање за важноста на информатичката технологја и знаењето во модерното општество', '',
        'предавања, проекти, дискусии, работилници', 'механизам на интерна евалуација и анкети',
        'Вовед во компјутерски науки', 'Реализирани активности 15, 16', '30', '45', '15', '15', '75', '180', '10', '15',
        '70', '10'),
       ('F18L2S124', '', 'Media and Communications', '6', '4', '1', '2023', 'македонски и англиски',
        'Теорија на комуникации, комуникациски модели, раскажување на приказни, јавен настап, односи со јавност, ИКТ како комуникациска алатка, Типови Медиуми, Какрактерисктики на елетронски медиуми, нови медиуми и социјални мрежи, технолошки алатки за деловна комуникација, основи на анализа на јавно мислење, дефинирање на бренд, социјалните мрежи како алатки за брендирање, виртуелни општества, основни поими за кибер-култура,',
        'Communication theories, communication models, story telling, public speaking, public relations, ICT as communication tool, media types, digital media features, new media and social networks, cooperative communication tools, introduction to analyses of public opinion, brand definition, social media for brand promotion, virtual societies, ciberculture.', ':По завршувањето на предметот се очекува студентот да ги разбира основните
поими од комуникатологијата како наука, како и да има продлабочено знаење во примена на постоечките техники и
сознанија за подобрување за комуникацијата помеѓу чинителите на комуникацијата. Посебен осврт ќе биден даден на комуникацијата преку новите медиуми и начинот на кој новите медиуми влијаат во различни општествени сфери. Студентите ќе бидат запознаени со основните принципи за испитување на јавно мислење и користење на новите медиуми (со посебен фокус на социјалните мрежи) за градење и промовирање на бренд (личен или корпоративен).',
        'After the course, the student will be able to understand fundamental topics from communication as science, and have deeper knowledge of how to apply contemporary techniques and findings in order to increase the achieved quality of communication among communication stakeholders. Special focus will be given to new media, and how they fit in different sociological environments. Students will be introduced to basic principles of analyses of public opinion and usage of social media to create and promote brands (personal or cooperate).', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, тимска работа, пример
случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и семинарска работа, учење во
електронско опкружување (форуми, консултации).
', 'механизам на интерна евалуација и анкети', 'Вовед во компјутерски науки',
        'Редовно посетување настава (до 3 отсуства), навремно доставување домашни задачи, семинарски работи, дискусии на форум и проект',
        '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L2W001', '', 'Algorithms and Data Structures', '6', '3', '1', '2023', 'македонски и англиски', '(1) Вовед во податочни структури
(1) Анализа на алгоритми и сложеност на алгоритми
(2) Репрезентација на податоци со фундаментални податочни структури (низи и листи)
(2) Вовед во алгоритми и техники за креирање алгоритми (brute force, greedy, divide-and-conquer, dynamic programing…)
(1) Еднодимензионални податочни структури (магацин, редица)
(1) Алгоритми за сортирање
(1) HASH структури
(2) Хиерархиски структури - дрва
(2) Графови', '(1) Introduction to data structures
(1) Algorithm analyses and complexity
(2) Data representation using fundamental data structures (arrays and lists)
(2) Introduction to algorithms and algorithms` design techniques (brute force, greedy, divide and conquer, dynamic programming...)
(1) One dimensional data structures (stack, queue)
(1) Sorting algorithms
(1) HASH structures
(2) Hierarchical data structures - trees
(2) Graphs', 'Запознавање со основните податочни структури и алгоритми кои се понатаму неопходни за работа со бази на
податоци како и за други апликации. Студентот ќе биде оспособен за користење и развој на структури и алгоритми
со линеарни листи, стебла, графови како и и индекси за пребарување. Исто така ќе биде оспособен за
имплемнтација на различните архетипи на алгоритми што се користат во практичната имплементација на многу
софтверски решенија.',
        'Introduction to basic data structures and algorithms needed to understand different technologies (e.g. databases, application development frameworks). Students will be able to develop algorithms using f data structures such are: lists, trees, graphs, as well as searching indexes. Student will be able to implement different algorithms` archetypes which are used in implementation of many software solutions.',
        'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка на домашни задачи. учење во електронско опкружување (форуми, консултации).',
        'механизам на интерна евалуација и анкети', 'Објектно-ориентирано програмирање',
        'реализирани лабораториски вежби', '30', '60', '10', '10', '70', '180', '10', '10', '70', '10'),
       ('F18L2W006', '', 'Probability and statistics', '6', '3', '1', '2023', 'Македонски и англиски', 'Елементи од комбинаторика. Веројатност на случајни настани. Својства на веројатности. Дискретен простор на веројатност. Класична дефиниција. Условна веројатност. Баесово правило. Независност на случајни настани.  Бернулиева шема. Дискретни и непрекинати распределби. Случајни вектори: маргинални и условни распределби. Функции од случајни променливи. Бројни карактеристики на случајни променливи: математичко очекување, дисперзија на случајна променлива, коефициент на корелација помеѓу две случајни променливи.
Закон на големите броеви. Централна гранична терорема. Елементи од статистика: популација и примерок, параметри и статистики.  Основна обработка на податоци и дескриптивни статистики. Математички модел на случаен примерок. Распределби на статистики на примерок: нормална, t-распределба, Хи квадрат и F-распределба. Оценување на параметри на обележјето: метод на моменти, метод на       максимална подобност, интервали на доверба. Параметарски тестови. Непараметарски тестови. Линеарна регресија, оценување со метод       на најмали квадрати.',
        'Elements of combinatorics. Probability of random events. Probability properties. Discrete probability space. Classical definition of probability. Conditional probability. Bayes` rule. Independence of random events. Bernoulli`s scheme. Discrete and continuous distributions. Random vectors: marginal and conditional distributions. Functions of random variables. Numerical characteristics of random variables: mean, variance of random variable, correlation coefficient between two random variables. Law of large numbers.Central limit theorem. Elements of statistics: population and sample, parameters and statistics. Elementary data analyses and descriptive statistics. Mathematical model of random sample. Distributions of sample statistics: Normal distribution, t-distribution, Chi-square distribution and  F-distribution. Point estimation: method of moments, maximum  likelihood method and confidence intervals. Parametric tests. Nonparametric tests. Linear regression, the least squares estimators.',
        'Да се воведат основните концепти од веројатност и статистичка анализа со дискусија на примените во компјутерските науки. Да се оспособат студентите за успешно следење на стручните предмети во кои се применуваат елементи од теорија на веројатност и статистика.',
        'Students will be introduced to basic concepts of probability and statistical analyses with their application in computer sciences. The knowledge of this subject is solid support for advanced courses where elements of probability and statistics are applied.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'механизам на интерна евалуација и анкети',
        'Калкулус или Калкулус 2 или Бизнис статистика', 'Реализирани актибвности 15.2 и 16.1', '45', '45', '45', '0',
        '45', '180', '0', '0', '100', '0'),
       ('F18L2W046', '', 'Computer networks', '6', '3', '1', '2023', 'македонски и англиски',
        '(1) Mрежи, класификација на мрежи, модел на комуникациски систем, стандарди, протоколи, слоевитост. (1) Пренос на податоци, типови на медиуми, спектар и пропусен опсег, аналогни и дигитални податоци, шум, капацитет на комуникациски канал. (1) Податочен слој, врамување, детекција на грешки, PPP, контрола на проток, лизгачки прозорци, ARQ механизми, HDLC. (1) Tехнологии кај LAN и MAC подслој. ЛАН топологии. Повеќекратен пристап, MAC протоколи. (1) Принципи на работа на hub. Преплавување. Баферирање. Преклопување. (1) Ethernet. Структура на рамка. Адресирање. CSMA/CD. Switch. Учење наназад. Бродкаст и колизиски домени. ARP. (1) Mостови за поврзување различни технологии. Бродкаст бура. Протокол на скелетно дрво.  (1) Пакетен пренос. Датаграми и виртуелни кола. (1) Мрежен слој. IP. Адресирање. Упатување. Работа на упатувачи. Рутирачки табели.  (1) Протоколи за упатување. Типови на упатување. Статички патеки. IRP vs ERP. AS. Метрики. DV vs LS. (1) Приватни адреси, NAT, PAT, IPv6, DHCP. (2) Транспортен слој. Воспоставување на конекцијата. Мултиплексирање. UDP. RTP. TCP. Контрола на задушување. Порти (1) Web. HTTP. FTP. DNS.',
        '(1) Networks, network classification, communication system model, standards, protocol, layering. (1) Data transmission, medium types, spectrum and bandwidth, analogue and digital data, noise, communication channel capacity. (1) Data layer, framing, error detection PPP, flow control, sliding window, ARQ mechanisms, HDLC. (1) LAN technologies, MAC sublayer. LAN topologies, Multiple access, MAC protocols (1) Hubs, flooding, buffering, switching. (1) Ethernet. Frame structure, addressing. CSMA/CD. Switch. Backward learning. Broadcast and collision domains. ARP. (1) Connecting different network technologies using bridges. Broadcast storm. Spanning tree protocol. (1) Packet transmission. Datagrams and virtual circuits. (1) Network layer. IP addressing. Routing. Routers. Routing tables.  (1) Routing protocols. Routing types. Static routing. IRP vs ERP. AS. Metrics. DV vs LS. (1) Private addressing, NAT, PAT, IPv6, DHCP. (2) Transport layer. Connection establishment. Multiplexing. UDP. RTP. TCP. Congestion control. Ports (1) Web. HTTP. FTP. DNS.',
        'Вовед во основните концепти на компјутерските мрежи. Студентот ќе се здобие со знаења поврзани со мрежната архитектура, мрежните протоколи и дизајн на мрежи. Студентот ќе се запознае со главните компоненти и апликации на TCP/IP свитата од протоколи.',
        'Introduction to the basic computer networks concepts. The student will obtain the knowledge necessary to understand the network architecture, network protocols, and network design. The student will understand the main components and applications of the TCP/IP protocol suite.',
        'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и софтверски пакети), тимска работа, учење со примери, употреба на симулатори и други електронски алатки за анализа на мрежата, протоколите и сообраќајот, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'механизам на интерна евалуација и анкети', 'Компјутерски архитектури', 'реализирани лабораториски вежби', '30',
        '60', '15', '0', '75', '180', '10', '0', '70', '10'),
       ('F18L2W067', '', 'Fundamentals of information theory', '6', '3', '1', '2023', 'Македонски и англиски', '(1) Елементи од комбинаторика. Веројатност на случајни настани. Својства на веројатности. (1) Дискретен простор на веројатност. Класична дефиниција. Условна веројатност. Баесово правило. (1) Независност на случајни настани.  Бернулиева шема.
(2) Дискретни и непрекинати распределби. (1) Случајни вектори: маргинални и условни распределби. Функции од случајни променливи. (1) Бројни карактеристики на случајни променливи: математичко очекување, дисперзија на случајна променлива, коефициент на корелација помеѓу две случајни променливи. Централна гранична теорема. (2) Ентропија и инфомација
(3) Компресија на податоци: оптимални кодови со својство на префикс. Хуфманов алгоритам. Алгоритам на Шенон-Фано-Елијас.      Аритметички кодови. (1) Комуникациски канал.',
        '(1) Elements of combinatorics. Probability of random events. Probability properties. (1) Discrete probability space. Classical definition of probability. Conditional probability. Bayes` theorem. (1) Independence of random events. Bernoulli`s scheme. (2) Discrete and continuous distributions. (1) Random vectors: marginal and conditional distributions. Functions of random variables (1) Numerical characteristics of random variables: mean, variance of random variable, correlation coefficient between two random variables. Central limit theorem. (2) Entropy and information. (3) Data compression: optimal codes, Huffman codes, Shanon-Fano-Elias coding, arithmetic coding. Communication channel.',
        'Студентите ќе бидат запознати со основите на теорија на веројатност, а потоа и основните поими од теорија на информации и нејзината примена во реални комуникациски системи.',
        'Students will become familiar with the basics of probability theory, the basic terms of the of information theory and its application in real communication systems.',
        'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и семинарска работа.',
        'механизам на интерна евалуација и анкети', 'Калкулус', 'Реализирани активности', '30', '45', '15', '15', '75',
        '180', '0', '15', '90', '10'),
       ('F18L2W096', '', 'Digitization', '6', '3', '1', '2023', 'Македонски',
        'Поим за дигитизација. Техники и технологии кои се користат при дигитизација на разни видови материјали: текстуални записи, музика, слики, објекти. Дигитизација на стари записи и печатени матријали. Дигитизација на слики и звук. Дигитизација, моделирање и реконструкција на 3Д објекти: уметнички дела, архитектонски објекти, археолошки и антрополошки артефакти. Архивирање и презервација на различни видови дигитални материјали. Техники и технологии за презентација на дигитизирани материјали.',
        '',
        'Целта на предметот е да се научат процесот и техниките за дигитизација. Студентите треба да ги совладаат основните принципи за менаџирање со дигитални материјали и нивна презервација, како и техники и технологии за нивно презентрање.',
        '', 'Предавања, вежби, проекти, семинарски', 'Анкети, разговор со студенти.', 'Вовед во компјутерски науки',
        'Реализирани активности 15, 16', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L2W104', '', 'Еngineering mathematics', '6', '3', '1', '2023', 'македонски и англиски', 'Нумеричка математика - Приближни броеви: претставување и операции, Видови грешки (апсолутна и релативна грешка), Заокружување на приближни броеви: точни и значајни цифри, Грешки при пресметување вредности на функции од една независна променлива, Примери за грешки на елементарни функции, Приближно решавање на нелинеарни равенки, Нумерички методи за решавање на системи линеарни равенки, Пресметувачки шеми за полиноми и нивна практична примена, Граници на интервал во кој се наоѓаат реалните корени на полиномните
равенки (Критериуми на Лагранж, Нутн, Декарт);
Математички трансформации - Комплексни броеви: дефиниција, својства, модул, аргумент, Практични примери, Комплексни функции, Видови комплексни функции, Извод на комплексни функции, Коши- Риманови услови,  Лапласова трансформација (дефиниција, егзистенција, својства), Инверзна Лапласова трансформација, Практични примери за решавање на обични диференцијални равенки со Лапласова трансформација, Фуриеви трансформации, Фуриеви редови, Фуриев интеграл, Инверзна Фуриева трансформација, Практични примери за определување на Фуриеви трансформации за функции.', 'Numerical mathematics: Approximate numbers: presentation of numbers and operations. Analysis of errors (absolute and relative errors). Rounding an approximate number: exact and significant digits, Approximation of functions, Some examples of errors obtained from elementary functions, Approximately solving nonlinear equations, Numerical methods for solving systems of linear equations,  Calculating schemas for polynomials and their applications, Interval of real polynomial roots (Criteria of Lagrange, Newton and Descartes);
Mathematical transformations - Complex numbers: definition, properties, modul, argument, Practical applications, Complex functions: types, derivatives. Cauchy -Riemann conditions,  Laplace transformation (definition, existence, properties), Inverse Laplace transformation,  Practical examples for  solving ordinary differential equations with Laplace transformation, Fourier transformations,  Fourier series,  Fourier integral, Inverse Fourier transformation,  Practical examples for finding Fourier transformations of functions.', 'Предметот опфаќа методи за нумеричкото решавање на повеќе математички проблеми, како и примена на некои
позначајни математички трансформации во инженерството.',
        'The course covers methods for numerical solving of many mathematical problems and application of some significant mathematical transformations in engineering.', 'Предавања, вежби, самостојна работа, проектни задачи, семинарски
работи', 'Механизам за интерна евалуација и анкети', 'Калкулус 2 или Калкулус', 'реализирани 15 и 16', '30', '45', '15',
        '15', '75', '180', '10', '15', '70', '10'),
       ('F18L2W140', '', 'Advanced programming', '6', '3', '1', '2023', 'македонски и англиски',
        'Генеричко програмирање, апстрактни податочни типови, генерички функции, генерички класи, колекции со линеарен пристап, колекции со случаен пристап, мапи, рефакторинг, основни концепти на шаблони за дизајн на софтвер, нитки и конкурентност. Развојна околина, интегрирана развојна околина.',
        'Generic programming, abstract data types, generic functions, generic classes, data collections with direct and linear access, maps, refactoring, basic concepts of software design patterns, multithreading and concurrency concepts, integrated development environments.', 'Да се воведат студентите во парадигмата на генеричкото програмирање. Да се запознаат со апстрактни податочни типови,
креирање на темплејт класи и функции. Да развијат вештини за употреба на колекции на податоци (вектори, редови, листи,
множества и речници). На крај се очекува студентите да можат да ги аплицираат концептите на шаблони за објектно-
ориентиран развој на софтвер при моделирање на некој специфициран проблем во робусна објектно-ориентирана програма.
Студентите ќе бидат запознаени со техниките за развивање на софтвер во интегрирана развојна околина.',
        'The student will attain knowledge of generic programming, abstract data types, creation of template classes and functions. After completing the course, the students will be capable for using generic data collections, maps, iterators and basic design patterns for rapid object oriented software development.',
        'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        '30+65+30+20+35 = 180 часа', 'Објектно-ориентирано програмирање', 'Реализирани активности 15, 16', '30', '60',
        '15', '15', '60', '180', '10', '15', '70', '10'),
       ('F18L2W147', '', 'Fundamentals of communication systems', '6', '3', '1', '2023', 'Македонски или англиски',
        'Општи поими и дефинирање на комункациски системи. Анализа на комуникациски сигнали и системи во фреквентен домен. Пренос на комуникациски сигнали низ линеарни системи. Амплитудна, аглова и фазна модулација и демодулација. Семплирање и пулсно-кодна модулација. Основни принципи на дигитален пренос. Комуникациски системи со шум и влијанието на шумот врз техниките за модулација. Софтверски дефинирано радио и современи комуникациски технологии. Тековен развој на комуникациски системи, оптички и безжични комуникации.',
        'General concepts and definition of communication systems. Analysis of communication signals and systems in a frequency domain. Transmission of communication signals through linear systems. Amplitude, frequency and phase modulation and demodulation. Sampling and pulse-code modulation. Basic principles of digital transmission. Communication systems with noise and the impact of noise on the modulation techniques. Software defined radio and modern communication technologies. Current development of communication systems, optical and wireless communications.',
        'Главна цел на предметот е студентите да се запознаат со анализата на комуникациски сигнали и нивниот пренос низ медиум, типовите на модулација и влијанието на шумот врз модулациските техники. Дополнително студентите ќе се здобијат со познавање од софтверски дефинирано радио, современите комуникациски системи и нивниот тековен развој.',
        'The main objective of the course is to familiarize the students with the analysis of communication signals and their transmission through mediа, the modulation types and the noise impact on the modulation techniques. In addition, the students will gain knowledge of software defined radio, modern communication systems and their ongoing development.',
        'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'механизам на интерна евалуација и анкети', 'Калкулус или Калкулус 2', 'реализирани активности 15.1 и 15.2',
        '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3S012', '', 'Integrated Systems', '6', '6', '1', '2023', 'Македонски и англиски', 'Курсот опфаќа дизајн, избор, имплементација и менаџмент на ентерпрајз IT решенија. Фокусот е на апликациите и инфраструктурата и нивното поклопување со бизнисот. Студентите ќе научат за рамки и стратегии за менаџирање инфраструктура,
систем администрација, податочни архитектури, менаџирање со содржини,  дистрибуирано процесирање, интеграција на legacy системи, консолидација на системи, избор на софтвер, пресметка на вкупна цена на чинење, анализа на IT инвестиции
и нови технологии. Менаџирање ризик и безбедност како и поддршка на стандарди.  Ќе се обрне внимание и на способноста кај студентите да се пренесат стратегиите  за технолошките архитектури на општата деловна заедница.  (1) Вовед во интеграција на ИТ системи (enterprise architecture frameworks). (1) Типови на системска интеграција (софтверска, хардверска). (1) Enterprise data models, Data / information architecture and data integration. (1) Data / information architecture and data integration (методологии). (2) Вовед во складишта на податоци, ETL и манипулација со податоци. (2) Технологии за системска интеграција (XML, SOA, Web Services, COTS). (1) Виртуелизација, Облак, Software as a Service, Отворен код. (2) Enterprise Resource Planning Systems and business process models. (1) Менаџирање со ризици, тотална цена на чинење и поврат на инвестиција, ревизија и стандарди. (1) IT стратегија и метрика, Emerging technologies, System administration', 'This course explores the design, selection, implementation and management of enterprise IT solutions. The focus is on applications and infrastructure and their fit with the business. Students learn frameworks and strategies for infrastructure management, system administration, data/information architecture, content management, distributed
computing, middleware, legacy system integration, system consolidation, software selection, total cost of ownership calculation, IT investment analysis, and emerging technologies. These topics are addressed both within and beyond the organization, with attention paid to managing risk and security within audit and compliance standards.
Students also hone their ability to communicate technology architecture strategies concisely to a general business audience.
(1) Introduction to integration of IT systems (enterprise architecture frameworks). (1) Types of system integration (software, hardware). (1) Enterprise data models, Data / information architecture and data integration. (1) Data / information architecture and data integration (methodologies). (2) Introduction to data warehouses, ETL and data manipulation. (2) Technologies for system integration (XML, SOA, Web Services, COTS). (1) Virtualization, Cloud, Software as a Service, Open Source. (2) Enterprise Resource Planning Systems and business process models. (1) Management of risks, total cost of ownership and return of investment, revision and standards. (1) IT strategy and metrics, Emerging technologies, System administration',
        'По завршување на курсот се очекува студентите да се оспособени за  дизајн, избор, имплементација и менаџмент на ентерпрајз IT решенија.  Да бидат способни за работа во  корпоративна средина при имплементација и одржување со надградба на ентерпрајз IT решенија. Да бидат способни да развиваат стратегии за технолошки архитектури на комплексни софтверски системи кои опслужуваат обемни податоци, многу корисници и широк спектар деловно процеси.',
        'After completing the course, it is expected for students to be able to design, select, implement and manage enterprise IT solutions. To  be capable of working in a corporate environment while implementing and maintaining enterprise IT solutions. To be capable of developing strategies for technological architectures of complex software systems serving wast amounts of data, many users and wide specter of business processes.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'механизам на интерна евалуација и анкети',
        'Анализа и дизајн на софтверски барања или Софтверско инженерство', 'Реализирани актибвности 15.2 и 16.1', '30',
        '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3S019', '', 'Software quality and testing', '6', '6', '1', '2023', 'македонски и англиски', 'Основи на тестирање на софтвер,  Валидација и верификација на софтвер, V&V терминологија и основи. Цели и ограничувања V&V, планирање и документирање V&V, метрики и мерки, учесници во процесот,  Видови тестирања, статички анализи и динамичко тестирање, функционално и Не-функционално тестирање. Моделирање на софтвер со графови. Моделирање на логички изрази
Партиционирање на влезен простор. Синтаксно моделирање. Тестирање на објектно ориентирани апликации. Тестирање на веб апликации и веб сервиси. Современи трендови во тестирањето.',
        'Introduction to software testing;  Software validation and verification. V&V terminology and basics. Goals and restrictions of V&V, planning and documenting V&V. Types of testing, static analysis, and dynamic testing, functional and non-functional testing; Modeling software with graphs; Modeling of logical expressions; Input space partitioning; Syntax-based modeling; Testing object-oriented applications; Testing web applications and web services; Testing graphical user-interfaces; Modern trends in software testing.',
        'Целата на курсот е запознавање на студентие со потребата од тестирање на софтвер, различните техники на моделирање на софтверот и искористување на тие модели за тестирање, како и практични работа на тестирање, валидација и верификација на софтвер',
        'The goal of this course is to understand the need for software testing, different techniques of software modeling, and using those models for testing. Also, practical software testing, verification, and validation are the goals of the proposed course.',
        'Предавања, вежби, самостојна работа, проектни задачи, семинарски работи',
        'механизам на интерна евалуација и анкети', 'Софтверско инженерство или Дизајн и архитектура на софтвер',
        'реализирани лабораториски вежби', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3S022', '', 'ICT Project Management', '6', '8', '1', '2023', 'македонски и англиски', '(1) Видови на проектно управување (Agile, Extreme, Lean)
(1) Управување со тимови. Орагнизациј на тимови. Виртуелни и глобални тимови
(1) Процес за работа во тим (одговорности, состаноци, распоред на задачи).
(1) Комуникација во проектот. Разрешување на конфликти,
(1) Менаџирање и Лидерство.
(1) Управување со барања
(1) Проценка и планирање
(1) Распоред и следење
(1) Контрола на квалитет
(1) Управување со ризик
(1) Управување со конфигурација и промени
(1) Алатки за управување со проекти', '(1) Project Management types (Agile, Extreme, Lean)
(1) Team management. Organization of teams. Virtual and global teams
(1) Teamwork (responsibilities, meetings, task scheduling).
(1) Project communication. Conflict resolution.
(1) Management and Leadership.
(1) Requirements engineering
(1) Assessment and planning
(1) Schedule and monitoring
(1) Quality control
(1) Risk management
(1) Configuration and change management
(1) Project Management Tools',
        'По завршувањето на предметот се очекува студентот да ги разбира и има продлабочено знаење во примена на техниките и методите за управување со ИКТ проекти, да има продлабочено знаење во утврдување софтверски и системски барања, познавање на метриките за следење на проекти и евалуација, да има знаење да примени техники за управување со барањата на разни проектни интересни групи, знаење за примена на тенхики за анализа  на трошоци, знаење за изготвување на извештаи, познавање на практични софтверски алатки за управување со проектен циклус.',
        'After completion of the course, the student is expected to understand and have broader knowledge in applying the techniques and methods for managing ICT projects. To have in-depth knowledge in managing software and system requirements, project monitoring and evaluation metrics. To know to apply tools for managing various project interest groups, analyze and manage the project costs, and to prepare management reports. To use software tools for project life-cycle management.',
        'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'механизам на интерна евалуација и анкети',
        '(Софтверско инженерство или Анализа на софтверски барања) и (Веб прогрмирање или Интернет технологии или Имплементација на системи со отворен и слободен код)',
        'Редовно посетување настава (до 3 отсуства), навремно доставување на сите домашни задачи, семинарски работи, дискусии на форум и проект',
        '30', '45', '15', '15', '75', '180', '0', '15', '70', '10'),
       ('F18L3S025', '', 'Electronic and Mobile Commerce', '6', '6', '1', '2023', 'Македонски и англиски', '(1) Вовед во е-Трговија
(2) Бизнис модели и бизнис план
(2) Бизнис модели во е-Трговија
(1) Инфраструктура за е-Трговија
(1) Развој на присутност во е-Трговија: Веб страници, страници за мобилни уреди, мобилни апликации
(2) Сигурност и плаќање во е-Трговија
(2) Маркетинг и рекламирање во е-Трговија
(1) Социјален, мобилен и локален маркетинг
(1) On-line продавници', '(1) Introduction to e-Commerce
(2) Business models and business plan
(2) Business models in e-Commerce
(1) Infrastructure for e-Commerce
(1) Developing e-commerce presence: Web pages, mobile device pages, mobile apps
(2) Security and payment in e-Commerce
(2) Marketing and advertising in e-commerce
(1) Social, mobile and local marketing
(1) Online stores',
        'Студентот со завршување ќе се стекне со вештини за развој на апликации за е-трговија и м-трговија. Ќе се запознаат со платформите за е-трговија и ќе научат да ги користат и употребуваат истите за градба на електронски продавници.',
        'The student upon completion will acquire the skills to develop applications for e-commerce and m-commerce. Developing e-business plans.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'механизам на интерна евалуација и анкети',
        'Веб прогрмирање или Интернет технологии или Имплемнтација на системи со отворен и слободен код',
        'Реализирани актибвности 15.2 и 16.1', '30', '45', '15', '15', '75', '180', '0', '15', '65', '15'),
       ('F18L3S028', '', 'Entrepreneurship', '6', '8', '1', '2023', 'македонски и англиски',
        'Предавањата се блиски до формата на старт-ап викенд. Студентите ќе имаат можност да контактираат со многу претставници и чинители на старт-ап заедницата во Македонија. Поим на вредности од различни аспекти на чинителите во еден бизнис. Поим за иновација, типови иновација и како да се имплементира иновација во еден бизнис. Вовед во претприемништво. Евалуација на идеи. Истражување на пазар. Бизнис и лин канвас. Типови на претставување на продукт и/или услуга. Старт-ап метрики. Раководење со финансии во старт-ап опкружување. Можни организациски структури на еден старт-ап. Принципи на скалирање на бизнис. Правна регулатива поврзани со старт-ап претпријатија во Македонија. Пристап до финансии.', 'The lectures are close in format to the start-up weekend event. Students will have opportunities to contact with representatives and stakeholders of the Macedonian start-up community.
Business values, company values and customer values. Innovation, innovation types, and how to implement innovation. Introduction to entrepreneurship. Idea evaluation. Market analyses. Business and lean canvas. Product (Service) presentation types. Start-up metrics. Finance management for start-ups. Start-ups` organizational structures. Business scaling principles. Legal regulations related to start-ups in Macedonia.  Access to finance.',
        'Студентите ќе бидат запознаени со предизвиците со кои ќе се соочат доколку се решат да започнат сопствен бизнис. Тие ќе можат да изработат иницијално истражување на пазарот, да ги дефинираат метриките со кои ќе ја следат успеноста на својот бизнис, како и да знаат како да препознаат дали обезбедиле вредност за своите клиенти. Конечно, тие ќе бидат оспособени да се претстават пред потенцијални клиенти, партнери и инвеститори.',
        'Students will be introduced with challenges that will face if they decide to create their own business. They will be able to produce initial market analyses, to define metrics needed to evaluate the success of their business, as well as to know how to recognize whether they have managed to create values for their customers (users). Finally, they will be able to present (pitch) their business or business idea in front of potential clients, partners and investors.',
        'Предавања поддржани со презентации преку слајдови, вежби, тимска работа, студии на случај, изработка на проектна задача, учење во електронско опкружување (форуми, консултации)',
        'механизам на интерна евалуација и анкети',
        'Бизнис и менаџмент и (Веб прогрмирање или Интернет технологии или Имплемнтација на системи со отворен и слободен код)',
        'реализирани активности 15.1 и 15.2', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3S036', '', 'Machine learning', '6', '6', '1', '2023', 'Македонски и англиски',
        'Вовед во машинско учење, Генеративни модели, Гаусови модели, Линеарна регресија со една и повеќе променливи, Логистичка регресија (репрезентација на хипотеза, функции на чинење, евалуација на грешка, селекција на модел и валидација), Ненадгледувано учење, мешани модели и EM алгоритам, Кернел методи, машини со носечки вектори, Невронски мрежи, регуларизација во невроснки мрежи, Класификациски и регресиони дрва на одлучување, Длабоко учење.',
        'Introduction to Machine Learning, Generative Models, Gaussian Models, Univariate and Multivariate Linear Regression, Logistic Regression (Hypothesis Representation, Cost Functions, Error Evaluation, Model Selection and Validation), Unsupervised Learning, Mixed Models and EM Algorithm, Kernel methods, support vector machines, Neural networks, regularization in neural networks, Classification and regression decision trees, Deep learning.',
        'Целта на курсот е студентите да се запознаат со основите на модерните техники од областа на машинско учење. По завршувањето на курсот кандидатите: ќе имаат продлабочени знаења за напредните технологии и методи за машинско учење; ќе можат да разберат, анализираат и формулираат генерални проблеми од областа на машинско учење; ќе можат успешно да применат алгоритми за машинско учење при решавање на реални проблеми; ќе можат да конципираат, анализираат, реализираат и проценат перформанси на систем за машинско учење.',
        'The aim of the course is for the students to become familiar with the basics of modern machine learning techniques. Upon completion of the course, candidates will have deeper knowledge of advanced technologies and methods of machine learning; they will be able to understand, analyze and formulate general problems in the field of machine learning; they can successfully apply algorithms for machine learning in solving real problems; will be able to conceptualize, analyze, realize and evaluate the performance of a machine learning system.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'механизам на интерна евалуација и анкети',
        'Веројатност и статистика или Бизнис статистика', 'Реализирани актибвности 15.2 и 16.1', '30', '45', '15', '15',
        '75', '180', '10', '15', '70', '10'),
       ('F18L3S039', '', 'Formal languages and automata', '6', '6', '1', '2023', 'Македонски и англиски',
        'Вовед во автомати и формални јазици; Конечни автомати; Регуларни изрази и јазици; Својства на регуларните јазици; Контекстно слободни граматики и јазици; Pushdown автомати; Својства на контекстно слободните јазици; Тјурингови машини; Неодлучивост; P, NP и други класи на проблеми;',
        'Introduction to automata and formal languages; Finite automata; Regular expressions and languages; Properties of regular languages; Context free grammars and languages; Push-down automata; Properties of context free languages; Turing machines; decidability; P, NP and other complexity classes;',
        'Оспособеност за користење на формалните модели на пресметливост како основа за теорија и пракса на програрамските јазици, компајлери, како и за пратење на повисок курс од теоријата на пресметливоста. Запознавање со јазици, регуларни и контекстно слободни јазици, конечни автомати и push down автомати, граматики и врската меѓу определен вид на автомати и јазици.', 'The purpose of this course is to acquaint the student with an overview of the theoretical foundations of computer science from the perspective of formal languages.
- Classify machines by their power to recognize languages.
- Employ finite state machines to solve problems in computing.
- Explain deterministic and non-deterministic machines.
- Comprehend the hierarchy of problems arising in the computer sciences.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'механизам на интерна евалуација и анкети', 'Структурно програмирање',
        'Реализирани активности 15.2 и 16.1', '30', '45', '15', '15', '75', '180', '0', '15', '90', '0'),
       ('F18L3S040', '', 'Embedded microprocessor systems', '6', '6', '1', '2023', 'Македонски и англиски',
        'Микропроцесори. Архитектура на процесори за вградливи системи. Споредба на различни типови на процесори за вградливи системи: микроконтролери, GPU, хетерогени SoC. FPGA базирани процесори. Паралелен влез/излез. Асинхрона и синхрона сериска комуникација. Прекини и мерење на време. Конверзија на аналогни и дигитални сигнали. Контрола, сензори и актуатори. Техники за работа со мала потрошувачка. Вмрежувања и мобилност на вградливи системи – чекор кон Интернет на нештата (IoT). Напредни протоколи за сериска комуникација и меморија за вградливи системи. Програмирање на вградени системи.',
        'Microprocessors. Embedded systems processor architecture. Types of processors for embedded systems: micro controllers, GPU, heterogeneous SoC. FPGA based processors. Parallel I/O. serial communication. Interrupts and timing.  A/D and D/A signal conversion. Control, sensors and actuators. Low power consumption techniques. Networking an mobility of embedded systems - toward Internet of things  (IoT). Advanced protocols of r serial communication and memory of embedded systems. Programming the embedded systems.',
        'Студентите ќе се стекнат со разбирање на хардверот, софтверот и состемскиот дизајн на вградените системи. Тие ќе ја разберат важноста на интеракцијата меѓу хардверот и софтверот и поврзувањата со сензори и актуатори. Ќе ги стекнат основите на програмирање на вградени системи. Студентите ќе бидат способни да ги дефинираат архитектуралните барања, вклучувајќи го и хардверот и софтверот потребен за да се изгради модерен вграен систем.',
        'Students shall gain familiarity with embedded systems hardware, software and systems design. They will understand the importance of the hardware-software interaction, and interfacing with sensors and actuators. They will gain familiarity in programming embedded systems in both assembly and a high-order language. The students will  be able to define and execute architectural trade-offs, including hardware and software needed to build a modern embedded system.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'механизам на интерна евалуација и анкети',
        'Архитектура и организација на компјутери или Компјутерски архитектури', 'Реализирани актибвности 15.2 и 16.1',
        '30', '45', '15', '15', '75', '180', '10', '15', '50', '10'),
       ('F18L3S047', '', 'Signal processing', '6', '6', '1', '2023', 'Македонски и англиски',
        'Вовед во дигитално процесирање на сигналите. Основни сигнали во дискретно време и операции со нив. Дискретна Фуриеова трансформација и Фуриеова трансформација во дискретно време. Врски меѓу Фуриеовите трансформации и нивни особини. Брза Фуриеова трансформација. Линеарни временски инваријатни системи. z – трансформација и инверзна z – трансформација. Дигитални филтри. Дизајнирање на филтри. Земање примероци и интерполација. Процесирање на стохастични сигнали и квантизација. Дводимензионална Фуриеова анализа. Основи на теорија на управување.',
        'Fourier transform and discrete time Fourier transform. Relationships between Fourier transforms and their properties. Fast Fourier transform. Linear time invariant systems. Z-transform and inverse Z-transform. Digital filters. Filter design. Sampling and interpolation.  Stochastic signal processing and quantization. Two dimensional Fourier analysis. Control theory basics.',
        'Познавањето на основите и техниките на дигиталното процесирање на сигнали е важно за секој инженер кој работи на апликации каде што има процесирање на сигнали. Со курсот студентите се воведуваат во теоретските основи дигитално процесирање на сигнали кои вклучуваат дискретизација, Фуриеова и z – трансформација. Студентите ќе стекнат и познавања од основните алатки како што се дигиталните IIR и FIR филтри. Во курсот ќе бидат дадени и основите на теоријата на управување. Преку бројните примери и вежби студентите ќе научат и практично да користат готови алатки за процесирање на сигнали.',
        'Knowledge of the basic techniques for digital signal processing is important for every engineer who works on applications where any signal processing is involved. Within this course the students are introduced to the theoretical grounds of digital signal processing which include discretization, Fourier and Z-transform. The students will gain knowledge for basic tools like the digital IIR and FIR filters. Within this course are also included the basics of the control theory. Through numerous examples and exercises the students will learn to use tools for signal processing.',
        'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и семинарска работа.',
        'механизам на интерна евалуација и анкети', 'Инженерска математика или Калкулус 2',
        'Реализирани актибвности 15.2 и 16.1', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3S054', '', 'Methodics of Informatics', '6', '8', '1', '2023', 'Македонски и англиски',
        'Карактеристики и особености на наставата по информатика. Организација на часот. Научни методи во наставата по информатика. Користење ЕСР рамка. Методи на одржување разни видови часови. Техники на презентирање. Развивање критичко мислење кај учениците. Активна настава. Проверка на знаење. Оценување. Мотивација и работа во групи',
        'Characteristics and peculiarities of teaching in informatics. Organization of the class. Scientific methods in IT teaching. Using the ESR framework. Methods of maintaining various types of classes. Presentation Techniques. Developing critical thinking among students. Active teaching. Knowledge check. Evaluation. Motivation and group work.',
        'Целта на предметот е оспособување на студентите да користат најсовремени техники за работа на час за да го предизвикаат интересот на учениците и истите да ги поттикнат на усвојување нови знаења за време на наставата во училницата. Студентите ќе се оспособат да спроведуваат активна настава во училницата, користејќи креативни техники според возраста на учениците и материјалот според наставниот план.',
        'The goal of the course is to enable students to use the most sophisticated techniques for working in the clasroom to challenge the interest of students and to encourage them to adopt new knowledge during classroom instruction. Students will be able to conduct active classroom instruction using creative techniques according to the age of the students and material according to the curriculum.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'механизам на интерна евалуација и анкети', 'освоени минимум 150 кредити',
        'Реализирани актибвности 15.2 и 16.1', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3S056', '', 'Personalized learning', '6', '6', '1', '2023', 'Македонски и англиски',
        'Вовед во персонализирано учење - едукациски модели,алатки, дизајн и поддршка за воспоставување персонализирана околина за учење, tеорија за мотивација и вклучување во процесот на учење, алатки за запознавање со начинот на учење на секој ученик, uченик - ориентирано оценување, технологија и оценување, употреба на технологија за унапредување на предавање и учење во персонализирана околин, )развивање колегијални релации и колаборативно учење, измена на улогата на наставникот - наставникот во улога на поттикнувач на усвојување нови знаења',
        'Introduction to personalized learning - educational models, tools, design and support for establishing a personalized learning environment, motivation theory and inclusion in the learning process, tools for acquainting with each student `s learning method, student - oriented assessment, technology and assessment, use of technology to promote teaching and learning in a personalized environment,) developing collegial relations and collaborative learning, changing the role of the teacher - the teacher in the role of the instigator of adopting а new knowledge.',
        'Персонализираното учење е современ начин на одржување на наставата која ги пресретнува индивудуалните потреби на секој ученик. Студентите се оспособуваат да ги препознаат спецификите на совладување на знаењата кај учениците од основните и средните училишта. Студентите ќе осознаат како да се справат со предизвикот за вклучување на персонализираното учење во рамки на класичната училница и како да се поттикнува усвојувањето на нови знаења кај различните стилови на учење.',
        'Personalized learning is a modern way of teaching that meets the individual needs of each student. Students are able to recognize the specifics of mastering the knowledge of primary and secondary school students. Students will learn how to cope with the challenge of including personalized learning within a classroom and how to encourage the acquisition of new knowledge in different learning styles.',
        'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и семинарска работа.',
        'механизам на интерна евалуација и анкети', 'ИКТ во образование', 'Реализирани активности 15.2 и 16.1', '30',
        '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3S057', '', 'Working with talented students', '6', '6', '1', '2023', 'Македонски и англиски', '(1) Вовед  (1) техники за препознавање надарени ученици (1) техники за развивање мотивација за екстракурикуларни активности
со надарени ученици (1)Техника на бура на идеи за развивање алгоритми (3)  основи на структури на податоци и соодветни алгоритми за задачи за  Натпревари: (листи, дрва, графови), рекурзија, алчни алгоритми,  раздели па владеј, динамичко програмирање
(4) типови задачи за натпревари  (1)Правила и прописи за учество на Интернационални олимпијади.  (2) разработка на задачи од натпревари',
        '',
        'Студентите се оспособуваат да станат професори кои успешно ќе идентификуваат ученици кои имаат потенцијал да го прошират знаењето од областа на информатиката и решавање задачи од алгоритамска природа, со употреба на напредни структури и алгоритми коишто не се опфатени со редовната програма. Идните наставници се оспособуваат да пренесат основно знаење за напредната програма на учениците и да ги насочат во процесот на учество на национални и интернационални натпревари по информатика.',
        '',
        'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и семинарска работа.',
        'механизам на интерна евалуација и анкети', 'ИКТ во образование', 'Реализирани актибвности 15.2 и 16.1', '30',
        '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3S059', '', 'Network administration', '6', '6', '1', '2023', 'македонски и англиски', '(1) Вовед. Што е NM, зошто e потребно, предизвици и еволуција
(1) Димензии, животен циклус, интероперабилност, слоеви, функции, процеси и организација
(2) Oсновни концепти, NM архитектура, управување уреди, агенти, MIB, системи за администрација, мрежа за администрација
(2) Протоколи, шеми на комуникација, SNMP, CLI, syslog, netconf, netflow, IPFIX
(1) Функции, откривање на уреди и конфигурации, складирање на податоци, мониторинг
(2) FCAPS - fault, configuration, accounting, performance, security management
(1) Интеграција, можности, перспективи, предизвици, пристапи
(1) NGOSS & Framework, еТОМ, BPF, SID, TAM
(2) SNMP, oрганизациски и функциски модел, информациски модел, комуникациски модел, администрација и безбедност, v1, 2, 3. USM, VACM
(1) Управување во NFV/SDN околина', '(1) Introduction. What is NM, why is it necessary, challenges and evolution
(1) Dimensions, life cycle, interoperability, layers, functions, processes and organization
(2) Basic Concepts, NM Architecture, Management Devices, Agents, MIB, systems for administration, network administration
(2) Protocols, communication modes, SNMP, CLI, syslog, netconf, netflow, IPFIX
(1) Functions, device detection and configuration, data storage, monitoring
(2) FCAPS - fault, configuration, accounting, performance, security management
(1) Integration, opportunities, perspectives, challenges, approaches
(1) NGOSS & Framework, eTOM, BPF, SID, TAM
(2) SNMP, organizational and functional model, information model, communication model, administration and security, v1, 2, 3. USM, VACM
(1) Management in NFV/SDN environment', 'По завршувањето на курсот се очекува студентот да ги разбира проблемите на администрацијата со мрежи и да знае
да ги применува на методите и алатките за администрација со комуникациски мрежи.',
        'Upon completion of the course, the student is expected to understand the problems of network administration and to know to apply the methods and tools for administration of communication networks.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'Механизам на интерна евалуација и анкети', 'Компјутерски мрежи',
        'изработени лабораториски вежби', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L2S061', '', '', '6', '6', '1', '2023', 'македонски и англиски', '', '', '',
        'Upon completion of the course, the student is expected to understand the problems of network administration and to know to apply the methods and tools for administration of communication networks.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'Механизам на интерна евалуација и анкети', 'Компјутерски мрежи',
        'изработени лабораториски вежби', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L1S120', '', '', '6', '6', '1', '2023', 'македонски и англиски', '', '', '',
        'Upon completion of the course, the student is expected to understand the problems of network administration and to know to apply the methods and tools for administration of communication networks.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'Механизам на интерна евалуација и анкети', 'Компјутерски мрежи',
        'изработени лабораториски вежби', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L2S017', '', '', '6', '6', '1', '2023', 'македонски и англиски', '', '', '',
        'Upon completion of the course, the student is expected to understand the problems of network administration and to know to apply the methods and tools for administration of communication networks.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'Механизам на интерна евалуација и анкети', 'Компјутерски мрежи',
        'изработени лабораториски вежби', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L2S029', '', '', '6', '6', '1', '2023', 'македонски и англиски', '', '', '',
        'Upon completion of the course, the student is expected to understand the problems of network administration and to know to apply the methods and tools for administration of communication networks.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'Механизам на интерна евалуација и анкети', 'Компјутерски мрежи',
        'изработени лабораториски вежби', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L2W109', '', '', '6', '6', '1', '2023', 'македонски и англиски', '', '', '',
        'Upon completion of the course, the student is expected to understand the problems of network administration and to know to apply the methods and tools for administration of communication networks.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'Механизам на интерна евалуација и анкети', 'Компјутерски мрежи',
        'изработени лабораториски вежби', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3S091', '', '', '6', '6', '1', '2023', 'македонски и англиски', '', '', '',
        'Upon completion of the course, the student is expected to understand the problems of network administration and to know to apply the methods and tools for administration of communication networks.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'Механизам на интерна евалуација и анкети', 'Компјутерски мрежи',
        'изработени лабораториски вежби', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3S138', '', '', '6', '6', '1', '2023', 'македонски и англиски', '', '', '',
        'Upon completion of the course, the student is expected to understand the problems of network administration and to know to apply the methods and tools for administration of communication networks.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'Механизам на интерна евалуација и анкети', 'Компјутерски мрежи',
        'изработени лабораториски вежби', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3S159', '', '', '6', '6', '1', '2023', 'македонски и англиски', '','','',
        'Upon completion of the course, the student is expected to understand the problems of network administration and to know to apply the methods and tools for administration of communication networks.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'Механизам на интерна евалуација и анкети', 'Компјутерски мрежи',
        'изработени лабораториски вежби', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3W024', '', '', '6', '6', '1', '2023', 'македонски и англиски', '','','',
        'Upon completion of the course, the student is expected to understand the problems of network administration and to know to apply the methods and tools for administration of communication networks.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'Механизам на интерна евалуација и анкети', 'Компјутерски мрежи',
        'изработени лабораториски вежби', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3W160', '', '', '6', '6', '1', '2023', 'македонски и англиски', '','','',
        'Upon completion of the course, the student is expected to understand the problems of network administration and to know to apply the methods and tools for administration of communication networks.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'Механизам на интерна евалуација и анкети', 'Компјутерски мрежи',
        'изработени лабораториски вежби', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L2S114', '', '', '6', '6', '1', '2023', 'македонски и англиски', '','','',
        'Upon completion of the course, the student is expected to understand the problems of network administration and to know to apply the methods and tools for administration of communication networks.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'Механизам на интерна евалуација и анкети', 'Компјутерски мрежи',
        'изработени лабораториски вежби', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L2W014', '', '', '6', '6', '1', '2023', 'македонски и англиски', '','','',
        'Upon completion of the course, the student is expected to understand the problems of network administration and to know to apply the methods and tools for administration of communication networks.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'Механизам на интерна евалуација и анкети', 'Компјутерски мрежи',
        'изработени лабораториски вежби', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L2W167', '', '', '6', '6', '1', '2023', 'македонски и англиски', '','','',
        'Upon completion of the course, the student is expected to understand the problems of network administration and to know to apply the methods and tools for administration of communication networks.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'Механизам на интерна евалуација и анкети', 'Компјутерски мрежи',
        'изработени лабораториски вежби', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3S083', '', '', '6', '6', '1', '2023', 'македонски и англиски', '','','',
        'Upon completion of the course, the student is expected to understand the problems of network administration and to know to apply the methods and tools for administration of communication networks.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'Механизам на интерна евалуација и анкети', 'Компјутерски мрежи',
        'изработени лабораториски вежби', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L2S164', '', '', '6', '6', '1', '2023', 'македонски и англиски', '','','',
        'Upon completion of the course, the student is expected to understand the problems of network administration and to know to apply the methods and tools for administration of communication networks.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'Механизам на интерна евалуација и анкети', 'Компјутерски мрежи',
        'изработени лабораториски вежби', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3W027', '', '', '6', '6', '1', '2023', 'македонски и англиски', '','','',
        'Upon completion of the course, the student is expected to understand the problems of network administration and to know to apply the methods and tools for administration of communication networks.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'Механизам на интерна евалуација и анкети', 'Компјутерски мрежи',
        'изработени лабораториски вежби', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3S106', '', '', '6', '6', '1', '2023', 'македонски и англиски', '','','',
        'Upon completion of the course, the student is expected to understand the problems of network administration and to know to apply the methods and tools for administration of communication networks.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'Механизам на интерна евалуација и анкети', 'Компјутерски мрежи',
        'изработени лабораториски вежби', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),


       ('F18L3W074', '', '', '6', '6', '1', '2023', 'македонски и англиски', '','','',
        'Upon completion of the course, the student is expected to understand the problems of network administration and to know to apply the methods and tools for administration of communication networks.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'Механизам на интерна евалуација и анкети', 'Компјутерски мрежи',
        'изработени лабораториски вежби', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3W079', '', '', '6', '6', '1', '2023', 'македонски и англиски', '','','',
        'Upon completion of the course, the student is expected to understand the problems of network administration and to know to apply the methods and tools for administration of communication networks.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'Механизам на интерна евалуација и анкети', 'Компјутерски мрежи',
        'изработени лабораториски вежби', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3W081', '', '', '6', '6', '1', '2023', 'македонски и англиски', '','','',
        'Upon completion of the course, the student is expected to understand the problems of network administration and to know to apply the methods and tools for administration of communication networks.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'Механизам на интерна евалуација и анкети', 'Компјутерски мрежи',
        'изработени лабораториски вежби', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3W103', '', '', '6', '6', '1', '2023', 'македонски и англиски', '','','',
        'Upon completion of the course, the student is expected to understand the problems of network administration and to know to apply the methods and tools for administration of communication networks.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'Механизам на интерна евалуација и анкети', 'Компјутерски мрежи',
        'изработени лабораториски вежби', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3W115', '', '', '6', '6', '1', '2023', 'македонски и англиски', '','','',
        'Upon completion of the course, the student is expected to understand the problems of network administration and to know to apply the methods and tools for administration of communication networks.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'Механизам на интерна евалуација и анкети', 'Компјутерски мрежи',
        'изработени лабораториски вежби', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3W117', '', '', '6', '6', '1', '2023', 'македонски и англиски', '','','',
        'Upon completion of the course, the student is expected to understand the problems of network administration and to know to apply the methods and tools for administration of communication networks.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'Механизам на интерна евалуација и анкети', 'Компјутерски мрежи',
        'изработени лабораториски вежби', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3W126', '', '', '6', '6', '1', '2023', 'македонски и англиски', '','','',
        'Upon completion of the course, the student is expected to understand the problems of network administration and to know to apply the methods and tools for administration of communication networks.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'Механизам на интерна евалуација и анкети', 'Компјутерски мрежи',
        'изработени лабораториски вежби', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3W128', '', '', '6', '6', '1', '2023', 'македонски и англиски', '','','',
        'Upon completion of the course, the student is expected to understand the problems of network administration and to know to apply the methods and tools for administration of communication networks.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'Механизам на интерна евалуација и анкети', 'Компјутерски мрежи',
        'изработени лабораториски вежби', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3W133', '', '', '6', '6', '1', '2023', 'македонски и англиски', '','','',
        'Upon completion of the course, the student is expected to understand the problems of network administration and to know to apply the methods and tools for administration of communication networks.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'Механизам на интерна евалуација и анкети', 'Компјутерски мрежи',
        'изработени лабораториски вежби', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3W137', '', '', '6', '6', '1', '2023', 'македонски и англиски', '','','',
        'Upon completion of the course, the student is expected to understand the problems of network administration and to know to apply the methods and tools for administration of communication networks.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'Механизам на интерна евалуација и анкети', 'Компјутерски мрежи',
        'изработени лабораториски вежби', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3W152', '', '', '6', '6', '1', '2023', 'македонски и англиски', '','','',
        'Upon completion of the course, the student is expected to understand the problems of network administration and to know to apply the methods and tools for administration of communication networks.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'Механизам на интерна евалуација и анкети', 'Компјутерски мрежи',
        'изработени лабораториски вежби', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),

       ('F18L3W065', '', '', '6', '6', '1', '2023', 'македонски и англиски', '','','',
        'Upon completion of the course, the student is expected to understand the problems of network administration and to know to apply the methods and tools for administration of communication networks.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'Механизам на интерна евалуација и анкети', 'Компјутерски мрежи',
        'изработени лабораториски вежби', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3S141', '', '', '6', '6', '1', '2023', 'македонски и англиски', '', '', '',
        'Upon completion of the course, the student is expected to understand the problems of network administration and to know to apply the methods and tools for administration of communication networks.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'Механизам на интерна евалуација и анкети', 'Компјутерски мрежи',
        'изработени лабораториски вежби', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3S118', '', '', '6', '6', '1', '2023', 'македонски и англиски', '', '', '',
        'Upon completion of the course, the student is expected to understand the problems of network administration and to know to apply the methods and tools for administration of communication networks.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'Механизам на интерна евалуација и анкети', 'Компјутерски мрежи',
        'изработени лабораториски вежби', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3S077', '', '', '6', '6', '1', '2023', 'македонски и англиски', '', '', '',
        'Upon completion of the course, the student is expected to understand the problems of network administration and to know to apply the methods and tools for administration of communication networks.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'Механизам на интерна евалуација и анкети', 'Компјутерски мрежи',
        'изработени лабораториски вежби', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3S010', '', '', '6', '6', '1', '2023', 'македонски и англиски', '', '', '',
        'Upon completion of the course, the student is expected to understand the problems of network administration and to know to apply the methods and tools for administration of communication networks.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'Механизам на интерна евалуација и анкети', 'Компјутерски мрежи',
        'изработени лабораториски вежби', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L2W165', '', '', '6', '6', '1', '2023', 'македонски и англиски', '', '', '',
        'Upon completion of the course, the student is expected to understand the problems of network administration and to know to apply the methods and tools for administration of communication networks.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'Механизам на интерна евалуација и анкети', 'Компјутерски мрежи',
        'изработени лабораториски вежби', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L2S084', '', '', '6', '6', '1', '2023', 'македонски и англиски', '', '', '',
        'Upon completion of the course, the student is expected to understand the problems of network administration and to know to apply the methods and tools for administration of communication networks.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'Механизам на интерна евалуација и анкети', 'Компјутерски мрежи',
        'изработени лабораториски вежби', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L1S116', '', '', '6', '6', '1', '2023', 'македонски и англиски', '', '', '',
        'Upon completion of the course, the student is expected to understand the problems of network administration and to know to apply the methods and tools for administration of communication networks.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'Механизам на интерна евалуација и анкети', 'Компјутерски мрежи',
        'изработени лабораториски вежби', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L1S066', '', '', '6', '6', '1', '2023', 'македонски и англиски', '', '', '',
        'Upon completion of the course, the student is expected to understand the problems of network administration and to know to apply the methods and tools for administration of communication networks.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'Механизам на интерна евалуација и анкети', 'Компјутерски мрежи',
        'изработени лабораториски вежби', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3S062', '', 'Virtualization', '6', '6', '1', '2023', 'Македонски и англиски',
        'Концепти на виртуелизација. Типови на хипервизори. Теорија на виртуелизација, придобивки во сервер околина, виртуелизација на апликации. Виртуелни машини. Типови на CPU виртуелизација. Виртуелизација на физички машини. Процесор и меморија во виртуелна средина. Паравиртуелизација. Xen. Нови архитектури за виртуелизација. Виртуелизација на уреди за складирање на податоци. Динамичко и статичко складирање. Клонирање и копирање. Редундантност, заштитна копија, клонирање и templates. Snapshot и checkpoint. Управување со уреди во виртуелна околина. Споделување на ресурси. Виртуелизација на мрежниот дел. ористење на виртуелизација. Безбедност во виртуелна средина. Консолидација на сервери. Миграција на виртуелни машини.',
        'Concepts of virtualization. Types of hypervisors. Theory of virtualization, advantages in server environment, application virtualization. Virtual machines. Types of CPU virtualization. Virtualization of physical machines. CPU and memory in virtual environment. Paravirtualization. Xen. New architectures for virtualization. Virtualization of devices for data storage. Dynamic and static storage. Cloning and copying. Redundancy, backup, cloning and templates. Snapshot and checkpoint. Manageemnt with devices in virtual environment. Resource sharing .Virtualization of the network. Using virtualization. Security in virtual environment. Server consolidation. Migration of virtual machines.',
        'Запознавање со виртуелизацијата како парадигма на креирање на виртуелни компјутерски системи преку софтверска виртуелизација на харверските компоненти. Обработка на различните аспекти на виртуелизацијата, технологиите и техниките вклучени во процесот, како и придобивките и губитоците кои се појавуваат во процесот на виртуелизација.',
        'Introduction to virtualization as a paradigm for creation of virtual computer systems using software virtualization of hardware components. Analysis of different aspects of virtualization, technologies and techniques included in the process, as well as advantages and disadvantages introduces by using virtualization.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'механизам на интерна евалуација и анкети', 'Оперативни системи',
        'Реализирани актибвности 15.2 и 16.1', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3S063', '', 'Computer Network Design', '6', '8', '1', '2023', 'Македонски и англиски',
        '(1) Воведување на QoS. Потреби. Конвергирани мрежи. Типови на доцнење. QoS барања за различен тип на сообраќај. QoS полиси. (1) Градбени блокови на QoS. Интегрирани и диференцирани сервиси. PHB. QoS механизми. (1) Kласификација и означување. Управување со задушување. Избегнување на задушување. (1) Полиси и обликување на сообраќај. Ефикасност на линк. (1) Автономни системи и упатување. RIP, EIGRP, OSPF. (1) Поврзување на автономни системи. BGP. (1) Mетодологии за дизајн на мрежи. Мрежна архитектура на бизнис мрежа. Структуриран дизајн на мрежа. Животен циклус на системски развој. (1) Чекори при мрежен дизајн. Цели и опфат на проектот. Контакт со клиентот. (1) Tехнички цели. Скалабилност. Достапност. Перформанси. Безбедност. Управливост. Корисност.  (1) Kарактеризација на постојна мрежа и сообраќај. Алатки за работа. Фактори кај мрежниот сообраќај. (1) Структурирање и модуларизација на мрежата. Дизајн на кампус мрежи и мрежи во податочни центри. Редундантност. Дизајн на јадро. Виртуелизирана мрежна околина. (1) Mултикаст сообраќај и протоколи. (1) SLA. Креирање и одржување на SLA.',
        '(1) Introduction of QoS. Needs. Converged Networks. Types of delay. QoS requests for different types of traffic. QoS policy. (1) QoS building blocks. Integrated and differentiated services. PHB. QoS mechanisms. (1) Classification and marking. Managing congestion. Avoiding congestion. (1) Traffic policies and shaping. Link Efficiency. (1) Autonomous systems and routing. RIP, EIGRP, OSPF. (1) Connecting to autonomous systems. BGP. (1) Network Design Methodologies. Network architecture of the business network. Structured network design. Life cycle of systemic development. (1) Steps in network design. Objectives and scope of the project. Contact with the client. (1) Technical goals. Scalability. Availability. Performance. Security. Management. Usability. (1) The characteristic of the existing network and traffic. Work Tools. Factors in network traffic. (1) Structuring and modulating the network. Design of campus networks and networks in data centers. Redundancy. Core design. Virtualized network environment. (1) Multicast traffic and protocols. (1) SLA. Creating and maintaining SLA.',
        'Целта на овој курсот е да го оспособи студентот да работи со големи компјутерски мрежи и да обезбеди колаборативна работа на различни административни региони, како и да дизајнира различни типови компјутерски мрежи според потребите на крајните корисници.',
        'The aim of this course is to enable the student to work with large computer networks and provide collaborative work in different administrative regions, as well as to design different types of computer networks according to the needs of end users.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'механизам на интерна евалуација и анкети', 'Компјутерски мрежи',
        'Реализирани актибвности 15.2 и 16.1', '30', '60', '15', '0', '75', '180', '10', '0', '70', '10'),
       ('F18L3S069', '', '', '6', '8', '1', '2023', 'Македонски и англиски', 'Теоретски основи на културата на говорот. Теоретски основи на културата на говорот (зборувањето). Културата на говорот во служба на комуникативното совршенство. Употребата на јазичната структура на македонскиот јазик во хуманитарните и природните науки. Јазикот како систем на знаци во меѓучовечката комуникација. Говорот како сукцесивна распределба и организација на јазичните знаци. Говорната дејност како целокупност на психо-физичките процеси на говорната реализација. Поимот текст: усна и писмена реализација на текстот. Содржината на текстот. Структура на говорот. Односот говор - јазик, Осносот говор мислење, Односот говор - реалност.  Односот говор - приемач (адресат). Односот говорни - неговорни структури. Правилност на говорот. Фонетски норми. Акцентски норми. Граматички норми.   Поимот стандарден јазик. Односот стандарден јазик - дијалектен јазик.
(1)Особини на успешниот говор. Точност на говорот. Логичност на говорот. Чистота на говорот. Изразност на говорот. Богатство на говорот. Умесност на говорот.
(1) Композиција на излагањето. Јазичните стилови и културата на говорот.
(1) Стилот и неговите видови. Стилските фигури и тропи. Комуникативната особина на говорот и јазичните стилови.
(1)Посебно за стиловите на јазикот: уметничкиот, научниот, деловниот, публицис- тичкиот, административниот, разговорниот. Културата на говорот во практична функција.
(1)Културата на говорот во научното општење. Културата на говорот во педагошката практика. Културата на говорот во јавниот настап. Културата на говорот и другите науки: психологијата, логиката, етиката, теоријата на комуникацијата и др. Психофизичките и моралните особини на говорникот. (1)Психологија на говорникот. Психологија на аудиториумот.',
        '', '', '', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'механизам на интерна евалуација и анкети', '', 'Реализирани актибвности 15.2 и 16.1',
        '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3S071', '', 'Child psychology', '6', '6', '1', '2023', 'Македонски и англиски', '(1) Предмет на психологијата (1) Когнитивен развој / типови стимули (1) Внимание, перцепција, работна меморија, нивоа на процесирање (1) Социјален и морален развој (1) Разлики кај потребите кај учениците (1) Бихервистички поглед на учењето - принципи
(2) Комплексни когнитивни процеси - мислење и говор (1) Емоции, Мотивација при учење и предавање (1) Помнење и заборавање
(2) Креирање околини на учење - надарени ученици, проблем деца (1) Психологија на ефикасната настава', '', '', '',
        'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и семинарска работа.',
        'механизам на интерна евалуација и анкети', '', 'Реализирани актибвности 15.2 и 16.1', '30', '45', '15', '15',
        '75', '180', '10', '15', '70', '10'),
       ('F18L3S073', '', 'Agent-based systems', '6', '6', '1', '2023', 'Македонски и англиски',
        'Теми кои ќе се обработуваат вклучуваат архитектури на агенти, репрезентација на знаење, расудување и способност за прилагодување и учење кај агентите, јазици и платформи за реализација и моделирање на агенти, симулација и предиктивна анализа на агентни системи, справување со несигурност во знаењето и расудувањето, вовед во теорија на игри како математички модел за преговори, соработка, конкуренција и колацирање на агенти.',
        'Selected topics: agent architecture; knowledge representation, reasoning, adaptation and learning in agents; programming languages and platforms for modeling, designing and implementing agents; simulations and predictive analysis in agent systems; reasoning with uncertain knowledge; introduction to game theory as a mathematical model for designing agent interactions: cooperation, negotiation, concurrency and forming coalitions.',
        'Агентно-базираното моделирање нуди природна метафора за разбирање и објаснување на многу феномени од доменот на биолошки и социјални системи – од еволуција и ширење на епидемии до сегрегација и формирање на коалиции. Многу системи може да се моделираат како средини составени од автономни агенти кои може да комуницираат, соработуваат, преговараат, да се спротивставуваат, да се водат од сопствени интереси или делуваат алтруистички. Микро-однесувањето на агенти водени од едноставни правила може да предизвика нови квалитети и комплексни појави во макро размери. Целта на предметот е запознавање на студентот со агентската парадигма за репрезентација и моделирање на системи од различни домени (пр. игри, роботи, однесување на социјални групи). По завршување на курсот се очекува студентот да има способност да дизајнира, моделира и реализира едно-агентен или повеќе-агентен систем користејќи соодветни алатки и платформи за развој.',
        'Agent based modeling offers a natural metaphor for explaining phenomena in the natural and social sciences, ranging from evolution to epidemic spread to racial segregation and forming coalitions.. Many systems can be modeled as being composed of self-interested or altruistic agents interacting with their environment and one another: cooperating, negotiating, competing or forming coalitions.  Very simple rules governing agent (micro) behavior can lead to complex and emergent phenomena (macro-level).The aim of this course is to introduce students to the agent paradigm suitable for modeling systems in different domains (e.g., games, robots, social behavior). After completion of the course the student will be able to design and implement single- and  multi-agent systems using suitable tools and platforms.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'механизам на интерна евалуација и анкети', 'Вештачка интелигенција',
        'Реализирани актибвности 15.2 и 16.1', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3S078', '', 'Biology inspired computing', '6', '8', '1', '2023', 'Македонски и англиски', 'Вовед во биолошки инспирирано пресметување; Пребарување и оптимизација;
Техники за локално пребарување;
Генетски алгоритми;
Генетско програмирање;
Интелигенција на јато; Оптимизација со колонија на мравки;
Оптимизација на рој честици; Вештачка колонија на пчели;
Вештачки имунолошки системи;
Невронски мрежи;
Само-организирачки невронски мрежи;
Задоволување на ограничувања;
Останати биолошки инспирирани хевристики;', 'Introduction to biologically inspired computation; Search and optimization;
Local search techniques;
Genetic algorithms;
Genetic programming;
Swarm intelligence; Ant colony optimization;
Particle swarm optimization; Artificial bee colony;
Artificial immune systems;
Neural networks;
Self-organizing neural networks;
Constraint satisfaction;
Other biologically inspired heuristics;', 'Целта на овој курс е запознавање на студентите со алгоритми кои се инспирирани од феномени кои се појавуваат во природата и примена на истите за решавање на проблеми од оптимизација, дизајн и учење. Фокусот ќе биде поставен врз абстракцијата на алгоритмите од воочените феномени, анализа на нивниот резултат како и нивна споредба. Во текот на курсот ќе се посвети внимание на конкретни примени на споменатите алгоритми. По завршувањето на курсот се очекува студентите да се здобијат со:
-   Знаење за природните феномени кои се инспирација за дискутираните алгоритми
-   Разбирање за силните и слабите страни на алгоритмите
-   Способност за идентификување на соодветноста на алгоритмите и нивна примена во проблеми од оптимизација, дизајн и учење', 'The goal of this course is to introduce students to algorithms inspired by naturally appearing phenomena and their application in solving problems in optimization, design and learning. The focus will be on algorithms abstraction from the observed phenomena, analysis and comparison of their results. Within the course special attention will be given to specific applications to the aforementioned algorithms. Upon completion students should acquire the following:
-   Knowledge of naturally occurring phenomena that are the inspiration for the learned algorithms
-   Understanding of the strengths and weaknesses of learned algorithms
-   Ability to identify the appropriateness of learned algorithms and their application to problems of optimization, design and learning', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'механизам на интерна евалуација и анкети',
        'Алгоритми и податочни структури и Вештачка интелигенција', 'Реализирани актибвности 15.2 и 16.1', '30', '45',
        '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3S080', '', 'Web search engines', '6', '8', '1', '2023', 'Македонски и англиски',
        'Вовед во веб пребарувачки системи; Процесирање на прашања; Пребарување со повратна врска; Векторски простори; Структура на документи; Креирање на индекси; Евалуација на системите за пребарување; Кластерирање и класификација на документи; Собирање на информации од веб и социјални мрежи и нивно индексирање; Персонализирано пребарување; Алгоритми за одговарање на прашања; Пребарување и индексирање на слики;',
        'Introduction to web retrieval systems; Query processing; Retrieval using relevance feedback; Vector-space; Document structure; Index creating; Evaluating retrieval systems; Clustering and classification of document; Gathering information from web and social media and indexing it; Personalized retrieval; Algorithms for question answering; Retrieving and indexing images;',
        'Запознавање со концепти за развој на веб пребарувачките системи. Разбирање на начините на обработување на прашањата и множеството на документи низ кои се пребарува, како и начини за автоматско собирање податоци од веб. По завршувањето на курсот се очекува студентот да демонстрира познавање на методи за процесирање на прашања, репрезентација на документите и нивно индексирање и класификацирање, да демонстрира познавање на методи за пребарување и индексирање на слики и да може самостојно да развива алгоритми за пребарување со користење на програмски алатки.',
        'The goal of the course is to get familiar with concepts for developing web retrieval systems. Understanding ways to process questions and retrieval data sets, as well as ways to automatically gather data from the web. After completing the course, the student is expected to demonstrate knowledge of methods for processing queries, document representation, indexing and classification, to demonstrate knowledge of methods for retrieval and indexing images and to be able to develop retrieval algorithms independently using developer tools.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'механизам на интерна евалуација и анкети', 'Обработка на природните јазици',
        'Реализирани актибвности 15.2 и 16.1', '30', '45', '15', '15', '75', '180', '0', '15', '70', '0'),
       ('F18L3S086', '', 'Introduction to cognitive science', '6', '8', '1', '2023', 'македонски', 'Што е когнитивна наука. Еволуција на умот. Визуелна репрезентација на невроните во
човечкиот мозок. Перцепцијата, визуелна когниција, мислење, меморија, фантазија,
внимание, емоции, лингвистика, интелигенција, донесување одлуки, решавање
проблеми. Учење, учечки агенти, таксономии на учење. Неврофизиологија и
оштетување на мозокот. Минато, сегашност и иднина на когнитивната наука.', '',
        'Целта е да се разбере како работи човечкиот мозок. Студентите ќе се запознаат со теоретските и емпириските погледи кои ја дефинираат когнитивната наука. Ќе се запознаат со истражувањата за природата на менталните процеси како перцепцијата, мислењето, меморијата, фантазијата, вниманието, јазикот, интелигенцијата, донесувањето одлуки и решавањето проблеми. Студентите ќе научат кои се алатките превземени од експерименталната психологија, наука на развојот, комјутерската наука, лингвистика, визуализацијата, филозофијата, антропологијата, бихевиоризмот, неврологијата. Курсот ќе ги поврзе сите овие пристапи кои се поврзуваат во когнитивната наука.',
        '', 'предавања, проекти, дискусии, работилници', '/', 'Вештачка интелигенција или Вовед во наука за податоците',
        'Реализирани активности 15, 16', '30', '45', '15', '15', '75', '180', '0', '15', '50', '15'),
       ('F18L3S087', '', 'Introduction to network science', '6', '6', '1', '2023', 'македонски и англиски',
        'Вовед во мрежна наука. Својства на комплексни и реални мрежи: ефект на мал свет, транзитивност на јазли, поврзување со преференца.  Модели на реални мрежи. Социјални, информациски мрежи, биолошки, техничко-технолошки мрежи.  Откривање на заедници и графлети во комплексни мрежи. Робустност на комплексни мрежи преку анализа на врски и јазли. Користење на мерки за централност и алгоритми за рангирање. Парадокси во социјални мрежи: статусна хомофилија, вредносна хомофилија, социјално влијание, надворешни влијанија.  Динамички процеси во комплексни мрежи: ширење на влијанија, информации и зарази, консензус и синхронизација. Теорија на игри во социјални мрежи: монетизација во социјални мрежи, формирање на социјални мрежи, наддавање и селекција на целно множество.  Повеќеслојни и временско-променливи комплексни мрежи: модели, алгоритми и динамички процеси. Оптимизација на проток, транспорт, распределба на ресурси, пакување и рутирање во реални мрежи. Податочно рударење и предвидување во големи мрежи. Предвидување на линкови, развој на топологија и атрибути. Предвидување на исходи од динамички процеси и изминување на комплексни мрежи.',
        'Introduction to Network Science. Properties in complex and real-data networks: small-world phenomenon, node transitivity, preferential attachment. Real-data network models. Social, information, biological and technological networks. Community detection and graphlets in complex networks. Node and edge analysis of network robustness. Centrality measures and ranking algorithms. Social network paradoxes: status homophily, value homophily, social influence, external influence. Dynamical processes in complex networks: influence spreading, information and virus spreading, consensus and synchronization. Game theory in social networks: monetization in social networks, social network formation, bidding and target set selection. Multilayer and temporal complex networks: models, algorithms and dynamical processes. Flow optimization, resource distribution, packing and routing in real networks.  Data mining and prediction in massive complex networks. Link and topology prediction. Prediction of the dynamical processes` outcome and traversing of complex networks..',
        'Запознавање со основните концепти од мрежна наука со реални податоци. Оспособување на студентите за анализа на својствата и динамичките процеси во реалните комплексни мрежи и нивно моделирање и визуелизација. Изучување на основните методи за октривање на заедници, оценка на робустноста, оптимизација, податочно рударење и предвидување во комплексни мрежи.',
        'Students will be introduced to concepts in Network Science on real data. At the end of the course the student would be able to analyze different properties and dynamical processes in real complex networks, and they would be able to model and visualize networks and dynamical processes on networks. Students throughout the course will learn the basic methods for community detection, robustness evaluation, network optimization, data mining and prediction in networks.',
        'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'механизам на интерна евалуација и анкети', 'Веројатност и статистика или Основи на теорија на информации',
        'Реализирани активности 15.1 и 15.2', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3S093', '', 'Digital Forensics', '6', '6', '1', '2023', 'македонски и англиски', '(1) Основи на дигиталната форензика, анализа и менаџирање на ситуацијата по извршен напад
(1) Форензика на податочен систем, план за форензика и технологии кај Linux и Android
(1) Мемориска форензика кај Windows Системи и алатки кои се користат под Windows
(1) Алатки за форензика кај податочен систем кај Windows
(1) Прибирање на податоци кај Windows/Linux системи
(1) Форензичка анализа кај Windows преку користење на регистри и други артефакти
(1) Rootkits јадредни модули
(1) Техники за структурирање на добиените податоци од дигиталната форензика и нивна визуелизација
(1) Техники и алатки за откривање на перење на пари и криминал на Интернет
(1) Blockchain технологија И Eterhium
(1) Користење на blockchain технологијата за форензички апликации
(1) Користење на chain анализа за заштита на интегритетот на дигиталните нешта.', '(1) Digital forensics fundamentals, analysis and managing the situation after a cyber attack
(1) File system forensics, forensic plan and Linux and Android technologies
(1) Memory forensics under Windows and Windows forensics tools
(1) Windows file system forensic tools
(1) Data acquisition in Windows/Linux systems
(1) Forensics analysis in Windows using registers and other artefacts.
(1) Rootkits kernel modules
(1) Techniques for structuring forensic data and data visualization
(1) Tools and techniques for discovering money laundry, fraud detection and cyber criminal
(1) Blockchain technology and Eterhium
(1) Using the blockchain technology in forensic applications
(1) Using chain analysis for integrity protection of the digital assets',
        'По завршување на курсот студентите ќе се стекнат со знаење за принципите и техниките потребни за една дигитална форензичка истрага. Студентите ќе се стекнат и со практично искуство за работа со различни форензички алатки за различни оперативни системи.',
        'After finishing the course student will know the fundamental principles and techniques needed to carry out digital forensic investigation. Student will obtain practical knowledge to work with different forensic tools for different operating systems.', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'механизам на интерна евалуација и анкети', 'Информациска безбедност', 'реализирани активности 15.1 и 15.2',
        '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3S094', '', 'Digital libraries', '6', '6', '1', '2023', 'македонски',
        'Вовед дефиниција и преглед на дигитални библиотеки (ДБ). Историја, основни карактеристики и визија на ДБ. Типови дигитални содржини и нивна организација, мета податоци, формат-специфични метаподатоци, стандарди и практики во ДБ (OAI-PMH, Z39.50, DublinCore и други), обезбедување интероперабилност. Архитектури и системи на ДБ, репрезентациски шеми и организација на содржини. Кориснички ориентиран дизајн на ДБ. Методи и принципи на прибирање на информацнии семантичко прибирање на информации. Прикажување на резултатите и интеракција со податоци, употребливост, евалуација. Управување со системите на поддршка на дигиталните библиотеки. Зголемување перформансите. Споредба и поврзување на дигиталните и класичните библиотеки. Заштита на дигитални содржини, авторски права. Примери на дигитални библиотеки: текстуални ДБ, стари ракописи, видео записи, мапи и други. Улогата на дигиталните библиотеки во образованието и е-образованието. Институционални, социални и професионални предизвици на ДБ. Идни трендови на развој во ДБ.',
        'Definition and overview of digital libraries (DL). History, basic characteristics and vision of DL. Types of digital content and their organization, metadata, format-specific metadata, standards and practices in DL (OAI-PMH, Z39.50, DublinCore, etc.), providing interoperability. DL architectures and systems, representation schemes and content organization. User-oriented DL design. Methods and principles of collecting information semantic information collection. Displaying Results and Data Interaction, Usability, Evaluation. Management of systems for supporting digital libraries. Improve performance. Comparison and correlation of digital and classical libraries. Digital Content Protection, Copyright. Examples of digital libraries: text documents, old manuscripts, videos, maps, and more. The role of digital libraries in education and e-education. Institutional, social and professional challenges of DL. Future trends in development in DL.',
        'Запознавање на студенти со актуелните елементи од областа дигитални библиотеки (ДБ): основи и архитектури на дигитални библиотеки, технологии, управување, организација и развој на дигитални ресурси, презентација на знаење и негово откривање (прибирање на информации), мета-податоци, шеми и стандарди и релевантни интелектуални права. Во зависноста од тековниот интерес студентите ќе се запознаат со конкретен апликативен софтвер за дигитална библиотека и со практики во работењето како и евалуација на истите. По завршување на курсот се очекува студентот да демонстрира знаење за основни елементи на ДБ, технологии за развој и изградба на ДБ, начини на примена, управување и организација на ДБ',
        'Introduction to students with the current elements in the field of digital libraries (DL): basics and architectures of digital libraries, technologies, management, organization and development of digital resources, presentation of knowledge and its discovery (gathering information), metadata, schemes and standards and relevant intellectual rights. Depending on the current interest, students will be introduced to specific digital library application software and practices in their operation as well as evaluation of them. Upon completion of the course, the student is expected to demonstrate knowledge about basic elements of DL, technologies for development and construction of DL, application, management and organization of DL',
        ' предавања, аудиториски вежби, лабораториски вежби, проектни задачи, домашни задачи',
        'механизам на интерна евалуација и анкети',
        'Бази на податоци и (Интернет програмирање на клиентска страна или Интернет технологии или Веб програмирање)',
        'Реализирани активности: лабораториски вежби и домашни задачи', '30', '45', '15', '15', '75', '180', '10', '15',
        '70', '10'),
       ('F18L3S101', '', 'Ethical hacking', '6', '8', '1', '2023', 'македонски и англиски',
        'Вовед во пен-тестинг. Чекори при пен тестинг. Скенирање, енумарација, footprinting. Хакирање на системи. Користење на малициозен софтвер. Снимање и анализа на сообраќај. Хакирање со социјален инженеринг. Киднапирање на сесија. Хакирање на веб сервери и веб апликации. SQL Injection. Хакирање на мобилни и безжични уреди. Преполнување на бафери',
        'Introduction to pen-testing; Steps for pen-testing; Scanning networks, enumeration, and footprinting; System hacking; Malware Threats; Sniffing; Social Engineering; Session Hijacking; Hacking web servers and web applications; SQL Injection; Hacking mobile platforms and wireless devices; Buffer overflow',
        'Студентот ќе ги запознае основните концепти, техники и алатки кои се користат во полето на безбедност на системи. Со преземање на улогата на `напаѓач` студентот ќе се стекне со знаење за повеќето сигурносни слабости во неговата околина и начин како да се заштити од нив.',
        'The student will learn the basic concepts, techniques, and tools that are widely used in the field of system security. Taking over the role of `intruder`, the student will learn about many security weaknesses in his surrounding and the way how to protect from them.',
        'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'механизам на интерна евалуација и анкети', 'Информациска безбедност или Мрежна безбедност',
        'реализирани лабораториски вежби', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3S102', '', 'ICT for Development', '6', '8', '1', '2023', 'Македонски и англиски', 'Улогата на технолошките иновации во развојот на човекот и на светот.
Развој на технолошки капацитети и трансфер на технологии.
Одржлив развој. Цели на Обединети Нации за одржлив развој кои треба да го трансформираат светот во подобро место на живеење со нагласок на земјите во развој.
Одредување како технологијата може да влијае на развојот на земјоделието, комуникациите, едукацијата, економијата, здравството, владите и половата еднаквост. Примери на нови технологии за решавање на проблеми: (мобилни уреди, социјални медиуми, дронови, сензори, …)
Социјални иновации и социјално претприемништво
Дизајн центриран кон човекот. Методологија на размесување за дизајн: (1)Емпатија (2) Дефинирање (3)Генерирање идеи (4)Изградба на прототип (5)Тестирање (6)Имплементација',
        '',
        'Целта на курсот е да ги разгледа основите принципи и најдобри практики за развој и за трансфер на технологии. Да се разбере концептот на одржлив развој кој ги го вклучува влијанието врз природата и општеството. Да се разберат 17-те дефинирани цели за одржлив развој од страна на Обединетите Нации и да се дефинираат начини на нивно исполнување. Разбирање на можностите за примена на нови технологии како мобилни уреди, дронови, сензори во областите како земјоделието, комуникациите, едукацијата, економијата, здравството, владите и половата еднаквост. Разбирање на поимите за социјални иновации и социјално претприемништво. Примена на методологии за дизајнирање на решенија кои се насочени кој човекот. Разбирање на методологијата на размесување за дизајн.',
        'The primary goal of the course is to study the fundamentals and best practices of usage of the technology for development. The students will understand the concept of sustainable development that includes the impact on nature and society. Students will be aware of the 17 goals for sustainable development defined by the United Nations. Students will examine the opportunities for applying new technologies like mobile devices, drones, sensors in areas such as agriculture, communications, education, economy, health, governments and gender equality. Students will be able to understand the concepts of social innovation and social entrepreneurship. Students will learn how to apply methodologies for designing solutions that are human-centered and to apply the design thinking methods.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'механизам на интерна евалуација и анкети',
        'Бизнис и менаџмент и (Веб прогрмирање или Интернет технологии или Имплемнтација на системи со отворен и слободен код)',
        'Реализирани актибвности 15.2 и 16.1', '30', '45', '15', '15', '75', '180', '0', '15', '60', '10'),
       ('F18L3S107', '', 'Intelligent systems', '6', '8', '1', '2023', 'Македонски и англиски',
        'Преглед на домените во кои се користат современи Интелигентни системи; Современи техники за претпроцесирање на податоци; Современи техники од машинско учење и длабоко учење за градење модели на ИС; Евалуација на модели на ИС (класификација и регресија);Дискриминантни наспроти генеративни методи за градење ИС; Брза фуриеова трансформација, временски и просторен домен; Трансферирано учење; Интерпретација на изградени модели - Shapley вредност Обработка на реален проблем – методи за најдобар избор на техники за претпроцесирање, изградба на модел, евалуација и интерпретацијавна изграден ИС; Обработка на реален проблем – дизајнирање на ИС за избран домен и негова евалуација и интерпретација.',
        'Overview of domains using modern Intelligent Systems; Contemporary techniques for data preprocessing; Modern machine learning and deep learning techniques for building IS models; Evaluation of IS models (classification and regression); Discriminant versus generative IS building methods; Fast Fourier transform, time and spatial domain; Transfer learning; Interpretation of IS models - Shapley value; Processing a real problem - methods for the best choice of pre-processing techniques, modelling and evaluation and interpretation of constructed IS; Processing a real problem - designing an IS for a selected domain and its evaluation and interpretation.',
        'Целта на предметот е да го заокружи знаењето на студентите од областа на интелигентните системи, почнувајќи од претпроцесирањена податоците до валидирање на изградениот систем. Студентите ќе се оспособат да изградат интелигентен систем од почеток до крај на реални проблеми од специфичен домен.',
        'The  goal of the course is to complete the knowledge of students in the field of intelligent systems, starting from pre-processing data to validation of the built system. Students will be able to build an intelligent system from start to finish on real domain specific problems.',
        'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и семинарска работа.',
        'механизам на интерна евалуација и анкети', 'Машинско учење', 'Реализирани актибвности 15.2 и 16.1', '30', '45',
        '15', '15', '75', '180', '10', '15', '50', '10'),
       ('F18L3S111', '', 'Infrastructure coding', '6', '6', '1', '2023', 'македонски и англиски',
        'Организација и менаџирање на податочен центар - Документирање и управување со ИТ основните средства - Заштита од испади и катастрофи, обезбедување на континуитет на сервисите - Конфигурациски менаџмент и менаџмент на промените - Автоматизиран конфигурациски менаџмент - Следење на инфраструктурата (мониторирање и мерење) - Управување со лог податоци - Скриптни јазици за конфигурациски менаџмент', '- Organization and management of datacenters
- Documentation and management of IT assets
- Overcoming incidents and disasters, securing continuum of services
- Configuration management and change management
- Automation of configuration management
- Infrastructure monitoring (monitoring and management)
- Management of log data
- Script languages for configuration management', 'Студентот ќе се здобие со знаење за лесно и ефикасно менаџирање на IT системи, управување со традиционалните
податочни центри, приватни и јавни облаци и клиентските компјутери и уреди. Студентот ќе може да се запознае и со
платформи за менаџирање на повеќе хипервизори, физички ресурси и апликации.',
        'The student will learn the principles and techniques for easy and efficient management of IT systems, management with traditional data centers, private and public clouds and client computers and devices. The student will learn about different platforms for management of multiple hypervisors, physical resources and applications.', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и
семинарска работа, учење во електронско опкружување (форуми, консултации).
', 'механизам на интерна евалуација и анкети', 'Администрација на системи', '15.1 и 15.2', '30', '45', '15', '15', '75',
        '180', '10', '15', '70', '10'),
       ('F18L3S112', '', 'Programming languages and compilers', '6', '8', '1', '2023', 'македонски и англиски',
        'Развој на програмските јазици. Спектар на програмсите јазици. Разработка на структурата на компајлерот со изучување на структурата на некој програмски јазик. Развој на граматики и синтаксно ориентирани преведувачи. Лексичка анализа. Синтакса и семантика, синтаксни дрва. Парсирање: bottom-up и top-down. Препроцесирање, поправка на грешки, симболни табели.Проверка на типови, семантичка проверка. Генерирање на код.Оптимизација на код. Bootstrapping. Конструкција на компајлер.',
        '',
        'Студентите треба да го разбрерат развојот и спектарот на програмските јазици, и да го сфатат процесот на конструкција на компајлер што ќе ги надгради како програмери кои навлегле во суштината на програмските јазици.',
        '', 'Предавања, вежби, проекти, семинарски
', 'Анкети, разговор со студенти.', 'Формални јазици и автомати', 'Реализирани активности 15, 16', '30', '45', '15',
        '15', '75', '180', '0', '15', '42', '16'),
       ('F18L3S113', '', 'Computer Animation', '6', '8', '1', '2023', 'македонски и англиски',
        'Основни принципи на 3Д простор, опишување на дигитални сцени, хиерархиска организација, пoлигоналнa геометрија, моделирање на дигитални објекти и карактери, NURBS моделирање, деформирање на објекти, ригување на тела и карактери, принципи на анимација, анимирање на дигитални карактери, сенчање и материјали, текстурирање на објекти, UV координати, осветлување на дигитални сцени, камери, скриптирање и автоматизација, композитурање и постпродукција',
        'Basic principles of 3D space, describing digital scenes, hierarchical organization, polygonal geometry, modeling of digital objects and characters, NURBS modeling, deformation techniques, rigging of objects and characters, principles of animation, animating digital characters, shading and materials, texturing, UV coordinates, lights in digital scenes, cameras, scripting and automation, compositing and post-production.',
        'По завршување на курсот се очекува студентите да се оспособени за основни методи за продуктивно создавање на компјутерски базирани анимации, за работа во апликации за создавање анимации и можат самостојно да моделираат, текстурираат, ригуваат, осветлуваат, анимираат, рендерираат и композитираат дигитални сцени.',
        'After the completion of the course it is expected for students to be capable of using basic methods for productive creation of computer based animations and working with applications for creating animations. They should be able to model, apply textures, rig, add lights, animate, render and compose digital scenes.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.
', 'механизам на интерна евалуација и анкети', 'Компјутерска графика или Дизајн на интеракцијата човек-компјутер',
        'Реализирани активности 15.2', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3S121', '', 'Blockchain and cryptocurrencies', '6', '8', '1', '2023', 'македонски и англиски', '1. Вовед и историја
2. Протокол и консензус - преглед
3. Чување на криптовалути - Криптографија и паричници
4. Биткоин механизми и оптимизации
5. Рударење (копање) на критовалути
6. Теорија на игри и мрежни напади - Како да уништиш Биткоин
7. Етериум и Паметни договори:
8. Алтернативен консензус
9. Организациски блоковски вериги
10. Регулативи и анонимност
11. Техники за анонимност, протоколи и Алткоини
12.  Напредни теми и иднина', '1. Introduction and history
2. Protocol and consensus - review
3. Storing crypto cavities - cryptography and wallets
4. Bitcoin mechanisms and optimizations
5. Cryptocurrency Mining
6. Game Theory & Network Attacks: How to Destroy Bitcoin
7. Etherium and Smart Contracts:
8. Alternative consensus
9. Enterprise Block Chain
10. Regulations and anonymity
11. Anonymization Techniques, Protocols, and Altcoins
12. Advanced topics and future',
        'Целта на овој курс е да овозможи на слушателите да разберат како фунцкционираат крипто валутите,  и идејата, технологиите и организациите кои ги поддржуваат или произлегуваат од нив.',
        'The purpose of this course is to enable trainees to understand how block chains and  crypto currencies work, and the idea, the technologies and organizations that support or emanate from them.', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и
семинарска работа, учење во електронско опкружување (форуми, консултации).', 'механизам на интерна евалуација и анкети',
        'Криптографија или Информациска безбедност', 'Реализирани актибвности 15.2 и 16.1', '30', '45', '15', '15',
        '75', '180', '10', '15', '70', '10'),
       ('F18L3S122', '', 'Cryptography', '6', '6', '1', '2023', 'македонски и англиски',
        'Основни криптографски поими, Примери за историски шифрувачи, Симетрична криптографија: Проточни шифрувачи и генератори на случајни броеви, Блоковски шифрувачи и модови за работа, Опис на DES и AES алгоритмите, Сценарија за напади и криптографски напади, Криптографија со јавен клуч, Опис на RSA и El Gamal алгоритмите, Дигитални потписи, Опис на Diffie Hеllman шемата и негова примена, Хаш функции, Примена на криптографските алгоритми во информациската безбедност.',
        'Cryptographic notation; Historical ciphers; Symmetric cryptography; Stream ciphers and random number generators; Block ciphers and block cipher modes of operation; DES and AES;  Attack scenarios; Cryptography with public key; RSA and ElGamal algorithms; Digital signatures;  Diffie and Hellman key exchange scheme; Hash functions; Cryptographic algorithms applicable in the field of information security.', 'Запознавање со основните криптографски принципи и методи; изучување на основните крипто-
дизајни; практично користење на изучените криптографски алгоритми.',
        'A student will learn the basic cryptographic principles and techniques. Will learn about the basic cryptographic design of a primitive and practical used of the fundamental cryptographic algorithms.',
        'Предавања, вежби, самостојна работа, проектни задачи, семинарски работи',
        'механизам на интерна евалуација и анкети', 'Дискретни структури 2 или Дискретна математика',
        'Реализирани активности 15, 16', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3S125', '', 'Measurements and analysis of Internet traffic', '6', '6', '1', '2023',
        'македонски и англиски',
        'Вовед. Моделирање на сообраќајни процеси и интервали. Комуникациски системи со загуба. Димензионирање на комуникациски мрежи. Податочни комуникации со доцнење. Дистрибуирано мерење на интернет сообраќај. Анализа и визуелизација на интернет сообраќај. Мрежна томографија и естимација на сообраќај. Карактеризација и предвидување на интернет сообраќај. Статистичка класификација на сообраќај. Детекција на нестабилности и оптимизација на рутирање',
        'Introduction. Modeling of traffic processes and intervals. Communication loss systems. Dimensioning communication networks. Data communication with delay. Distributed measurement of internet traffic. Analysis and visualization of internet traffic. Network tomography and traffic estimation. Statistical classification of traffic. Detection of instabilities and routing optimization.',
        'Цели на предметната програма (компетенции): За инженер кој работи со мрежни технологии е корисно да има познавања од мерење, анализа и моделирање на интернет сообраќајот заради поквалитетно дизајнирање на мрежите како и подобро користење на нивните перформанси. Со овој курс студентите ќе се запознаат со основите на инженерството на комуникациски сообраќај, како и различни техники за анализа, мерење, карактеризација, класификација и предвидување на интернет сообраќај.',
        'For any engineer who works with network technologies it is useful to have knowledge of measurement, analysis and modeling the internet traffic for better design of networks as well as better utilization of their performance. With this course the students will get acquainted with the basics of engineering of communication, as well as different techniques for analysis, measurement, characterization, classification and prediction of the internet traffic.', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби
(користење на опрема и софтверски пакети), тимска работа, пример случаи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).
', 'механизам на интерна евалуација и анкети',
        'Веројатност и статистика или Основи на теорија на информации или Бизнис статистика',
        'Реализирани активности 15.1 и 15.2', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3S127', '', 'Mobile Applications', '6', '8', '1', '2023', 'македонски и англиски',
        'Модерни пристапи во развојот на мобилните апликации. Преглед на iOS како платформа за развој на мобилни апликации. Структура на апликациите. Планирање и развој на комерцијална мобилна апликација. Кориснички интерфејси слеани со оперативниот систем. Правила за развој и планирање на кориснички интерфејс. Оптимизација на ресурси кај мобилните апликации. Податочни структури и работа со меморијата во мобилните уреди. Бази на податоци кај мобилните уреди и интеграција со надворешни сервиси. Вештачка интелигенција и машинска визија во мобилните апликации. Мобилните апликации во здравството, банките и електронската комерција. Примери на мобилни апликации од индустријата. Публикување на мобилни апликации  (најдобри практики).',
        '',
        'По завршувањето на предметот се очекува студентот да има продлабочено знаење во примена на технологиите и алатките за дизајн и развој на мобилни апликации.',
        'After finishing this course the student is expected to have broadened knowledge in application of technologies and tools for mobile application design and development', ' Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби
(користење на опрема и софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна
изработка и одбрана на проектна задача и семинарска работа, учење во електронско опкружување (форуми,
консултации).', 'механизам на интерна евалуација и анкети', 'Алгоритми и податочни структури',
        'Навремено доставување на сите домашни задачи и проект', '30', '45', '15', '15', '75', '180', '10', '15', '70',
        '10'),
       ('F18L3S130', '', 'Business process modeling and management', '6', '8', '1', '2023', 'македонски и англиски', '(1) Вовед во бизнис процеси.
(1) Фази во циклусот за менаџирање на бизнис процеси.
(1) Идентификација на бизнис процеси.
(1) Јазици за моделирање на бизнис процеси.
(2) Моделирање на бизнис процеси со BPMN.
(1) Дијаграм на кореографии.
(1) Откривање на бизнис процеси.
(1) Квалитативна анализа на бизнис процеси.
(1) Kвантитативна анализа на бизнис процеси.
(1) Редизајн на бизнис процеси.
(1) Автоматизација на бизнис процеси.
(1) Откривање на знаење за бизнис процесите.',
        'Introduction to business processes. Phases of the cycle for business process management. Identification of business processes. Languages for business process modeling. Business process modeling with BPMN. Choreography diagram. Process discovery. Qualitative analysis of business processes. Quantitative analysis of business processes. Process redesign. Automation of business processes. Business process mining.',
        'По завршувањето на предметот се очекува студентот да ги разбира и има продлабочено знаење за типови бизнис процеси и нивна поврзаност со ИС, ќе имаат продлабочено знаење во идентификување, моделирање и мапирање разни типови бизнис процеси, ќе знаат да применат алатки и јазици за моделирање на бизнис процеси преку соодветни дијаграми, ќе имаат познавање од принципите за подобрување на тек на процеси, ќе имаат познавање од концептите за податочна размена и интероперабилност.',
        'After completion of the course, the student is expected to understand and have deeper knowledge of types of business processes and their relationship to information systems, will have deeper knowledge in identification, modeling and mapping various types of business processes, will be able to apply tools and languages for business process modeling through appropriate diagrams, will have knowledge of the principles for improving process flow, will have knowledge of the concepts of data exchange and interoperability.', 'Предавања поддржани со презентации преку слајдови, интерактивни
предавања, вежби (користење на опрема и софтверски пакети), тимска работа, пример
случаи, самостојна изработка и одбрана на проектна задача и семинарска работа',
        'механизам на интерна евалуација и анкети',
        'Бази на податоци и (Софвтерско инженерство или Анализа на софтверски барања)', 'Реализирани активности 15, 16',
        '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3S132', '', 'Modern robotics trends', '6', '8', '1', '2023', 'македонски и англиски',
        'Современи текови во роботиката. Околина за модерните роботи. Чувствување и акции во околината. Интеракција човек - робот. Роботи на нано ниво. Флексибилни роботизирани производни процеси. Интелигентна роботика. Роботи како асистивни технологии. Учење и когниција.  Емоционална роботика. Мултироботски системи во колаборација',
        'ntroduction to contemporary robotics trends. Environment for the modern robots. Sensing and actions in the robotics environment. Human – robot interaction. Robotics on nano level. Flexible robotized production processes. Intelligent robotics. Robots as assistive technology. Learning and cognition. Emotional robotics. Collaborating multirobot systems.',
        'Студентите ќе бидат воведени во модерните трендови во роботиката. Ќе бидат запознаени со современите техники на моделирање на околината, во која роботите стануваат секојдневие. Студентите ќе се стекнат со познавање на тековните трендови во роботиката како што се интеракција човек – робот, нанороботика, биолошки роботи на генетско ниво, роботизирани производни процеси, роботика како асистивна технологија и други трендови',
        'Students will be familiarized with the contemporary robotics trends. They will gain knowledge of the modern techniques for modelling the environment, in which the robots are common, included in every day activities. The students will be acquainted with the robotics trends, such as human – robot interaction, nanorobotics, biologically inspired robots, robots on the genetics level, robotized manufacturing processes, robotics as assistive technology and other modern trends.',
        'Предавања, вежби, самостојна работа, проектни задачи, семинарски работи',
        'механизам на интерна евалуација и анкети',
        'Автономна роботика или Процесна роботика или (Машинско учење и Основи на роботика)', 'реализирани 15.1 и 15.2',
        '30', '45', '15', '15', '75', '180', '10', '15', '50', '10'),
       ('F18L3S135', '', 'Multimedia systems', '6', '6', '1', '2023', 'македонски и англиски',
        'Вовед во мултимедија и класификација на мултимедиската содржина. Компоненти на еден мултимедиски систем. Креирање на мултимедиска содржина (signali, АД конверија, Фуриева трансформација, семплирање и квантизација, филтрирање и субсемплирање). Репрезентација и формати на мултимедиска содржина (слика, видео, аудио). YUV субсемплирање. Теорија на бои, трихроматност, физиологија на човековиот визуелен систем, колорни шеми (RGB, YUV, CMYK, ...).  Основи на компресија на мултимедиска содржина (ентропија, таксономија, метрики). Техники за компресија (Хофман кодирање, аритметичко кодирање, LZW, замена на урнеци, векторска квантизација, кодирање на подопсег, диференцијално пулсно-кодна модулација, хибридни шеми ...). Предизвици при компресија (симетрична vs. несиметрична, адаптивна vs. неадаптивна, брзина и комплексност на енкодер/декодер, ...). Компресија на слики (GIF, PNG, MPEG, MPEG 2000,  дискретна вејвлет трансформација, фрактално кодирање, ...). Компресија на видео (темпорална редундантност, блок-базирана предикција на рамки, пресметување на вектор на движење, I рамки, B рамки, P рамки, предикција на повеќе рамки, GOP видео структура). Комплексност на компензација на движење (логаритамско vs. хиерархиско пребарување). MPEG стандард. Компресија на аудио (делта модулација, логаритамска квантизација, ...). Основи за QoS и QoE.',
        'Introduction to multimedia and classification of multimedia content. Components of a multimedia system. Multimedia creation (signals, AD conversion, Fourier transform, sampling and quantization, filtering and sub-sampling).  Multimedia representation (picture, video, audio). YUV sub-sampling. Theory of colors, trichromacy, physiology of the human visual system, color schemes (RGB, YUV, CMYK, ...). Basics of compression (entropy, taxonomy, metrics). Compression techniques (Hoffman coding, arithmetic coding, LZW, run-length encoding, vector quantization, sub-band coding, differential pulse-code modulation, hybrid schemes ...). Compression challenges (symmetric vs. non-symmetric, adaptive vs. nonadaptive, speed and complexity of the encoder/decoder, ...). Image compression (GIF, PNG, MPEG, MPEG 2000, discrete wavelet transformation, fractal coding, ...). Video compression (temporal redundancy, block-based prediction of frames, motion vector calculation, I frames, B frames, P frames, multi-frame prediction, GOP video structure). Complexity of motion compensation (logarithmic vs. hierarchical search). MPEG standard. Audio compression (delta modulation, logarithmic quantization, ...). QoS and QoE.',
        'Запознавање на студентот со основните концепти за работа со мултимедиските податоци, начините на нивно моделирање и имплементирање и манипулација со истите. Студентот ќе биде способен да моделира мултимедиски податоци, ќе знае практично да го применува содржински-базираното пребарување на мултимедиските податоци, и ќе се здобие со воведни знаења за креирање на апликации базирани на  мултимедиските содржини.',
        'Introducing the student with the basic concepts for working with multimedia data, the ways of their modeling and implementation and manipulation of them. The student will be able to model multimedia data, will know how to practically apply the content-based search on multimedia data, and will gain initial knowledge for creating applications based on multimedia content.',
        'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'механизам на интерна евалуација и анкети', 'Алгоритми и податочни структури',
        'реализирани активности 15.2 и 16.1 и 16.2', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3S139', '', 'Advanced Topics in Cryptography', '6', '8', '1', '2023', 'македонски и англиски',
        'Типови на криптографски напади; Вовед во диференцијална криптоанализа; Вовед во линеарна криптоанализа; Side-channel напади; Реални напади над крипто примитиви; Програмирање сигурен крипто-софтвер',
        'Types of cryptographic attacks; Introduction to differential cryptanalysis; Introduction to linear cryptanalysis; Side-channel attacks; Real world attacks on different crypto primitives; Programming secure crypto software.',
        'Градење на сигурна крипто-примитива која ќе биде отпорна не само на теориски напади, туку и на практични (side-channel) напади.',
        'The purpose of the course is to built a secure crypto primitive which will be resistant not only to theoretical attacks but also to practical (side-channel) attacks.',
        'Предавања, вежби, самостојна работа, проектни задачи, семинарски работи',
        'механизам на интерна евалуација и анкети', 'Криптографија', 'Реализирани активности', '30', '45', '15', '15',
        '75', '180', '10', '15', '70', '10'),
       ('F18L3S149', '', 'Parallel programming', '6', '6', '1', '2023', 'македонски и англиски',
        '(1) Вовед. Преглед и предизвици на паралелни системи. (1) Основи на паралелно пресметување, модели, алгоритми. (1) Специјално наменски архитектури. (2) Проблеми и решенија при синхронизација на повеќе нитки, multi-threading системи. (1) Паралелни системи вовед во паралелни програмски модели. (1) Дизајн на паралелен алгоритам. (2) Споделувана меморија и MPI. (2) GPU архитектура и CUDA програмирање. (1) Aнализа на перформанси. (1) Оптимизација',
        '', 'Истражување на алгоритмите и техниките за програмирање на најновите паралелни платформи со споделена меморија и со
дистрибуирана меморија. Студентот ќе се запознае со теоретските и практичните (програмските) компоненти.', '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и
семинарска работа, учење во електронско опкружување (форуми, консултации).
', 'механизам на интерна евалуација и анкети', 'Алгоритми и податочни структури', '15.1 и 15.2', '30', '45', '15', '15',
        '75', '180', '10', '15', '70', '10'),
       ('F18L3S150', '', 'Data mining', '6', '6', '1', '2023', 'македонски и англиски',
        'Вовед. Претпроцесирање на податоците. Алгоритми за податочно рударење: Алгоритми за класификација, алгорими за предвидување, алгоримми за асоцијација и алгорими за кластерирање. Методи за анализа и споредба на моделите на откривање на знаење. Сите алгоритми се реализираат на соодветно избрани податочни множества.',
        '.    Introduction. Data preprocessing. Performing data mining tasks: Classification, prediction, association analysis and clustering. Methods for analysis and comparison of knowledge discovering models. All algorithms will be applied to appropriately selected data sets.',
        'Запознавање со методи за идентификација на валидни, нови, корисни и разбирливи шеми во податоци и откривања на нови знаења. Претпроцесирање на податоците. Вовед во предиктивни модели од податоците: класификација, регресија, оценка на веројатноста. Откривање на кластери и правила на асоцијација.',
        '.   Introduction to methods for identifying valid, novel, useful, and understandable patterns in data. Data preprocessing Induction of predictive models from data: classification, regression, probability estimation. Discovery of clusters and association rules',
        'предавања, аудиториски вежби, лабораториски вежби, проектни задачи, домашни задачи, разработка на програмски пакет со методи за податочно рударење',
        'механизам на интерна евалуација и анкети',
        '(Веројатност и статистика или Бизнис статистика) или Бази на податоци', 'Реализирани активности 15, 16', '30',
        '45', '0', '30', '75', '180', '10', '30', '60', '10'),
       ('F18L3S151', '', 'Computational biology', '6', '8', '1', '2023', 'македонски и англиски',
        'Вовед во пресметковна биологија. Динамички модели со диференцни равенки. Линеарни модели на структурирани популации. Нелинеарни модели на интеракција. Моделирање на молекуларната еволуција. Модели во генетика. Моделирање на вирусни заболувања. Заклучок – современи трендови во пресметковна биологија.',
        '',
        'Целта на курсот е студентите да се запознаат со основите на модерните техники од областа на пресметковна биологија. По завршувањето на курсот кандидатите: ќе имаат продлабочени знаења за напредните технологии и методи за пресметковна биологија, динамички системи и моделирање; ќе можат да разберат, анализираат и формулираат генерални проблеми од областа на пресметковна биологија; ќе можат успешно да применат методи при решавање на реални проблеми; ќе можат да конципираат, анализираат, реализираат и проценат перформанси на методи и модели во пресметковна биологија.',
        '',
        'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'механизам на интерна евалуација и анкети', 'Машинско учење', 'реализирани активности 15.1 и 15.2', '30', '45',
        '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3S153', '', 'Process robotics', '6', '6', '1', '2023', 'македонски и англиски',
        'Сензори и ефектори во процесна роботика, Математички принципи, работен простор, кинематика, инверзна кинематика, динамика, ПИД управување, управување со позиција и сила, напредни алгоритми за управување на роботи, роботи во индустријата и производството. Програмирање на индустриски контролери.',
        'Sensors and actuators in process robotics, mathematical principles, work spaces, kinematics, inverse kinematics, dynamics, PID control, position control and force control, advanced algorithms for robot control, industrial robotics and production robotics, programming industrial controllers.',
        'По завршувањето на предметот студентот се очекува да има основни познавања од водењето на процесите во роботиката, развој на апликации со сензори и актуатори и управување со процеси кои вклучуваат роботи. Студентите ќе се воведат во начините како се програмираат индустриски контролери.',
        'After the completion of this course the student is expected to have basic knowledge in robotics process control, development of applications with sensors and actuators. Development of applications that include robot control. Students will be introduced to the programming paradigm of industrial controllers.', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна
изработка и одбрана на проектна задача, учење во електронско опкружување (форуми, консултации).',
        'механизам на интерна евалуација и анкети', 'Основи на роботика',
        'Редовна посета на наставата, навремено предадени домашни и презентација на проектна задача', '30', '45', '15',
        '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3S155', '', 'Service Oriented Architectures', '6', '6', '1', '2023', 'македонски и англиски',
        'Вовед во сервисно ориентирани архитектури - Слоеви на сервиси и микросервиси - Анализа и моделирање на софтвер со веб сервиси - Анализа и моделирање на софтвер со REST сервиси и микросервиси - Дизајн на сервисно API и договор кај веб сервиси - Процес на развој на софвер со микросервисна архитектура - Системски дизајн на микросервисна архитектура - Безбедносни политики и заштита кај сервисно ориентираните архитектури - Организација, оркестрација и управување со микросервисна околина', '- Introduction to service oriented architectures
- Layering of services and micro-services
- Analysis and modelling of software with web services
- Analysis and modelling of software with REST services and microservices
- Design of service API and contracts in web services
- The process of development of software with micro-services
- System design of microservice architecture
- Security policies and security in service oriented architectures
- Organization, orchestration and management of micro-services environment',
        'Предметот сервисно-ориентирани архитектури има за цел да ги запознае студентите со организација, дизајн и развој на на дистрибуираните системи базирани на сервиси. Сервисно-ориентираните архитектури опфаќа теми од софтверско и системско инженерство. Од аспект на софтверско инженерство студентите ќе се запознаат со процесот на анализа и дизајн при развој на сервисно-ориентирани апликации, како и со организацијата на процесот на развој на софвер погодни за сервисно-ориентирани системи. Во поглед на системско инженерство, предметот ќе го покрие целосниот екосистем на сервисно-ориентирана и микро-сервисно ориентирана архитектура, нејзините компоненти, поврзаност, соработка и координација.',
        'The students studying Service Oriented Architectures will learn the organization, design and development of distributed systems based on services. Service-oriented architectures course covers topics of software and system engineering. From the aspect of software engineering, the students will learn the process of analysis and design of service-oriented applications, as well as organization of the process of development of software adequate for service-oriented systems. From aspect of system engineering, the course covers the entire ecosystem of service-oriented and micro-service oriented architecture, its components, collaboration, communication and coordination.',
        'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на хардверска опрема и софтверски пакети), тимска работа, решени едноставни примери и проширување на знаењето со посложени задачи, поканети гости предавачи, самостојна изработка на домашни задачи. учење во електронско опкружување (форуми, консултации)',
        'механизам на интерна евалуација и анкети',
        'Веб прогрмирање или Интернет технологии или Имплементација на системи со отворен и слободен код',
        'Реализирани активности 15.1 и 15.2', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3S157', '', 'Data Warehouses and OLAP', '6', '8', '1', '2023', 'македонски и англиски',
        'Основни концепти кај складовите на податоци; Архитектура на складовите на податоци; Проток на податоци кај складовите на податоци; Моделирање на складови на податоци; Организација на податоците во ѕвездеста шема на склад на податоци; Организација на податоците во снегулка шема на склад на податоци; Хиперкоцки и повеќедимензионални бази на податоци; Технилогии за аналитичка обработка (ОLAP) на податоци; Проширувања на SQL стандардот за потребите на ОLAP; Врска помеѓу оперативните бази на податоци и складовите на податоци; Автоматско ажурирање на податоците во складовите на податоци, прочистување и агрегација на податоци (ETLпроцеси); Организација кај дистрибуирани складови на податоци; Анализа на многу обемни податоци; Во практична имплементација ќе биде опфатено проучување на водечките алатки и технологии кај складовите на податоци.',
        '',
        'Запознавање со oрганизацијата и манипулацијата со податоците организирани во складови на податоци, како и основните операции и алгоритми за работа со складови на податоци. Студентот ќе биде оспособен за моделирање на складови на податоци, организација и манипулација со податоците сместени во складови на податоци, изготвување на аналитички извештаи базирани на истите податоци',
        '', 'предавања, аудиториски вежби, лабораториски вежби, проектни задачи, домашни задачи',
        'механизам на интерна евалуација и анкети', 'Бази на податоци', 'Реализирани активности 15, 16', '30', '45',
        '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3S158', '', 'Modern Computer Architectures', '6', '6', '1', '2023', 'македонски и англиски',
        'Современи микропроцесори, POST RISC технологија, суперскаларни и VLIW процесори, редоследно процесирање и процесирање вон редослед, преименување регистри, предвидување на разгранување, издавање на инструкции, складирање и доставување на инструкции, извршување на инструкции, комплетирање на инструкции и повлекување на инструкции. Дизајн на мемориска архитектура. Анализа на современите процесори на Intel,IBM и Sun. Кластери, Мултипроцесори со споделена меморија и нивни перформанси. Програмирање кај повеќејадредни процесори. Напредни графички единици за процесирање и нивно искористување. Алгоритамски техники при програмирање на GPU.',
        'Contemporary microprocessors, post RISC technology, superscalar and VLIW processors, in-order and out-of-order processing, renaming registers, branching prediction, issuing instructions, storing and submitting instructions, executing instructions, completing instructions, and retrieving instructions. Design of memory architecture. Analysis of modern Intel, IBM, and Sun processors. Clusters, Multiprocessors with shared memory and their performance. Programming with multiple processors. Advanced graphics processing units and their utilization. Algorithmic techniques for programming the GPU.',
        'Разбирање на концептите и имплементациите на современите процесори. Анализа на современите процесори. Студентот ќе биде оспособен да дизјанира, одржува и програмира компјутерски системи со современи процесори и процесирачки елементи',
        'Understanding the concepts and implementations of modern processors. Analysis of modern processors. The student will be able to design, maintain and program computer systems with modern processors and processing elements',
        'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'механизам на интерна евалуација и анкети',
        'Архитектура и организација на компјутери или Компјутерски архитектури', 'Реализирани активности 15.1 и 15.2',
        '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3S162', '', 'Crowd-sourcing and human computing', '6', '8', '1', '2023', 'македонски и англиски',
        'Вовед. Платформи за споделување во толпа. Работни проблеми. Програмски парадигми. Работни текови за споделување во толпа. Напади и заштита. Преглед и економија на апликации базирани на споделување во толпа. Интелигенција на јато. Системи и апликации на врмрежени мобилни јазли',
        'Introduction to crowd sourcing. Platforms for crowd sourcing. Working problems. Program paradigms. Work flows for crowd sourcing. Attacks and protection. Overview and economy of crowd-source applications. Swarm intelligence. Systems and applications for networked mobile nodes.',
        'Целта на предметот е да ги запознае студентите со можностите на толпата да споделува и обработува податоци кои овозможуваат да се решаваат проблеми кои се сеуште комплексни за компјутерските системи, но многу едноставни за колектив со човечка интелигенција. Предметот ќе ги воведе студентите во нов дизајн на апликации и концепт на програмирање кој се заснова на недоверливо учество на голем број поединци од толпата. Во предметот ќе се разгледаат постоечки апликации и платформи за собирање на податоци и решавање на обемни задачи на барање.',
        'The main goal of the course is to introduce the students to the capabilities of the crowd to share and process data that for solving problems which are still complex for the computer system, and at the same time, very simple for a collective with human intelligence. The students will get acquainted with new design of applications and concept of programming based on unreliable contribution of vast number of individuals in a crowd.  The course will give an overview of the existing platforms for data collections and on demand task solving.', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).
', 'механизам на интерна евалуација и анкети', 'Машинско учење', 'Реализирани активности 15.1 и 15.2', '30', '45', '15',
        '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3S163', '', 'Statistical modelling', '6', '6', '1', '2023', 'Македонски и англиски', 'Сите теми ќе бидат илустрирани со соодветни реални примери.
Вовед во моделирање на податоци. Општи методи за симулација на случајни промеливи.Корелација и линеарна регресија, оценување на функционалната зависност од податоците, параметарски модели за функцијата на регресија. Проста линеарна регресија. Модели на анализа на варијанса (АНОВА).Повеќекратна регресија.Класификација: Логистичка регресија, бинарна и повеќекласна логистичка регресија. Избор на модел за класификација.Релации меѓу променливи и избор на променливи: Анализа на главни компоненти, лог-линеарни модели. Непараметарско оценување на функциите на регресија и класификација: метод на најблиски соседи, наивен Баесов метод,  Методи базирани на оценување на границите за класификација: Машини со поддржувачки вектори. Споредба на методите. Баесови методи на оценување на параметрите и изведување на заклучоци: Баесови модели со еден параметар, Баесови модели со повеќе параметри, Модели за собирање на податоци за Баесово моделирање.', 'Every topic will be illustrated with corresponding real world examples.
Introduction to data modelling. General methods for simulation of random variables. Correlation and linear regression., estimation of functional dependance of data. Parametric models of regression functions. Simple linear regression. Analysis of variance (ANOVA). Multiple regression. Logistic regression, binary and multiple logistic regression. Choice of classification model. Principle component analysis,log-linear models. Nonparametric estimation of regression functions and classification:nearest neighbour method, naive Bayes. Support vector machine. Comparison of the methods. Bayesian methods for parameter estimation. Models for collection of data for Bayesian modelling.',
        'Студентите да научат да направат правилна и осмислена статистичка анализа на податоци со користење на  класичен и Баесов пристап. Да постават соодветни статистички модели, да ги проверат и протолкуваат добиените резултати. Акцентот е ставен на користење софтвер со отворен код (R, Python,..) за градење на моделите над реални примери со користење на непходните теориски резултати.  Курсот треба да е поготовка на студентите за останатите во кои се анализираат податоци од различни истражувања.',
        'The students should learn how to  make the statistical analysis of data, using the classical and Bayesian approach. They should set suitable statistical models and check and interpret the obtained results. The accent will be on the use of open source software (R, Python) for building models  based on real data, using the presented theory. The course should prepare the students for data analysis in different research fields.',
        'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и семинарска работа.',
        'механизам на интерна евалуација и анкети', 'Веројатност и статистика или Бизнис статистика',
        'Реализирани актибвности 15.2 и 16.1', '30', '45', '15', '15', '75', '180', '0', '15', '80', '10'),
       ('F18L3S166', '', 'Distance learning', '6', '6', '1', '2023', 'македонски и англиски', '-    Основи и основни концепти за учење на далечина
-   Теории за учење.
-   Примена на технологијата кај учењето на далечина.
-   Системи за учење на далечина
-   Типови и примери на системи за учење на далечина
-   Технологии и методи за планирање, развој и имплементација на системите за учење на далечина
-   Дизајн на курсеви и содржина на курсеви.
-       Дигитална содржина
-       Алатки за креирање на дигитална содржина
-   Улогата на инструкторот и ученикот кај учењето на далечина
-   Учењето на далечина и социјалните мрежи
-   Иднината на учењето на далечина', '', 'Студентите ќе се запознаат со концептот за далечинско учење, со технологиите кои го поддржуваат далечинското учење, како
и со придобивките со неговото користење. Со слушање на овој курс студентите ќе се оспособат да планираат и дизајнираат,
да научат како се имплементираат системи за далечинско учење, ќе ја осознаат разликата помеѓу курсевите кај учење на
далечина и курсевите во класичната настава, улогата на инструкторот и ученикот во овој систем, како и сегашноста и
иднината на системите за далечинско учење', '', ' настава, колаборативно учење. презентации, проекти',
        'механизам на интерна евалуација и анкети', 'ИКТ во образование', 'Реализирани активности', '30', '45', '15',
        '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3S168', '', '', '6', '8', '1', '2023', 'Македонски и англиски', '', '', '', '', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'механизам на интерна евалуација и анкети', '', 'Реализирани актибвности 15.2 и 16.1',
        '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3W004', '', 'Databases', '6', '5', '1', '2023', 'Македонски и англиски', '(2) Физичка организација на податоците (структури и индекси)
(1) Вовед во СУБП
(2) Модел на реалниот свет (П-ЕР дијаграми)
(1) Релациски податочен модел
(2) Релациона алгебра и релациони пресметки
(2) Вовед во SQL - DDL и DML изрази
(1) Напредно користење на SQL
(1) Функционални зависности и нормализација на БП
(1) Вовед во конкурентно рабoтење и трансакции', '(2) Physical organisation of data (data structures and indices)
(1) Introduction to DBMS
(2) Conceptual modelling and database design (E-ЕR diagrams)
(1) The relational data model
(2) Relational algebra and relational calculus
(2) Introduction to SQL - DDL and DML statements
(1) Advanced usage of SQL
(1) Functional dependencies and database normalization
(1) Introduction to transaction processing and concurrency control',
        'Запознавање на студентот со основните концепти за работа со бази на податоци, начините на нивно моделирање и имплементирање, како и работа со прашалните јазици. Студентот ќе биде способен да моделира бази на податоци преку семантичко и релациско моделирање и процес на нормализација, ќе знае практично да го применува SQL стандардот за креирање, одржување и манипулација на релациските бази на податоци. Студентот ќе има познавање за основните концепти на конкурентно работење и трансакции.',
        'Introducing the student with the basic concepts for using the databases; the ways of their modeling and implementation; as well as the application of the query languages. The student will be able to model databases through semantic and relational modeling and database normalization, he/she will know how to practically apply the SQL standard for creating, maintaining and manipulating relational databases. The student will have knowledge of the basic concepts of concurrency control and transactions.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'механизам на интерна евалуација и анкети', 'Алгоритми и податочни структури',
        'Реализирани актибвности 15.2 и 16.1', '30', '60', '10', '10', '70', '180', '10', '10', '70', '10'),
       ('F18L3W008', '', 'Introduction to Data Science', '6', '5', '1', '2023', 'Македонски и англиски', '(1) Вовед во науката за податоци како четврта научна парадигма
(2) Дизајнирање на експерименти и идентификација на проблеми
(2) Собирање и обработка на податоци
(2) Анализа на податоците
(2) Идентификација на шаблони во податоците
(2) Објаснување на добиените хипотези
(2) Тестирање на хипотезите и повратна врска', '(1) Introduction to Data Science as a fourth science paradigm
(2) Designing experiments and problem identification
(2) Collecting data and data processing
(2) Data Analysis
(2) Pattern recognition in the data
(2) Explanation of the obtained hypothesis
(2)  Hypothesis testing and feedback',
        'Запознавање со основите за науката базирана на податоци. Студентите ќе се запознаат со процесот и методологијата при работа со податоци, почнувајќи од идентификацијата на проблемите, преку собирање на податоци, а потоа и нивна обработка. Студентите ќе ги научат основните техники за обработка на податоците и идентификување на шаблони во нив, како и начините на визуелизација и интерпретација на добиените резултати.',
        'Students will obtain knowledge with the Data Science fundamentals and they will be introduced to the process and methodologies for operations with data, starting from problem identification, data collection and data processing. At the end of the course students would know the basic techniques for data processing and pattern recognition in the data, as well as, they will know how to visualize the results and properly interpret them.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'механизам на интерна евалуација и анкети',
        'Бизнис статистика или Веројатност и статистика или Основи на теорија на информации',
        'Реализирани актибвности 15.2 и 16.1', '30', '45', '15', '15', '75', '180', '0', '15', '65', '15'),
       ('F18L3W009', '', 'Software Design and Architecture', '6', '5', '1', '2023', 'македонски и англиски', '(1) Дизајн концепти, дефиниција на дизајнот, основни проблеми во дизајнот (на пример, перзистентни податоци, управување со складиштата и исклучоци)
(1) Контекст на дизајн во рамките на повеќе животни циклуси на развој на софтвер, принципи на проектирање (криење на информации, кохезија и спојување)
(1) Интеракции помеѓу дизајнот и барањата, дизајн за квалитетни атрибути (на пример, сигурност, употребливост, одржливост, перформанси, тестирање, безбедност и толеранција на грешки)
(1) Дизајн компромиси, дизајн стратегии, функционален дизајн, објектно-ориентиран дизајн
(1) Податочно воден дизајн, аспектно-ориентиран дизајн, архитектонски дизајн
(3) Архитектонски стилови, шаблони и рамки
(1) Архитектонски размени меѓу различните атрибути
(1) Хардверски и системски инженеринг прашања во софтверската архитектура, барања за следливост во архитектурата
(1) Сервисно ориентирани и архитектури во облак
(1) Архитектури за мрежни, мобилни и вградени системи
(1) Однос помеѓу архитектурата на производот, структурата на организацијата, и пазарот', '', 'Целта на курсот е студентите да ги научат главните концепти на објектно ориентирана анализа и дизајн. Да се запознаат со техниките на рефакторирање, шаблоните за дизајн и различните архитектури на софтвер. По завршувањето на курсот кандидатите ќе можат да ги идентификуваат ограничувањата и проценат квалитетите на софтверските системи. За конкретна софтверска спецификација ќе можат да ја проценат нејзината комплетност и
конзистентност, како и да дизајнираат софтверска архитектура во согласност со дадените барања.',
        'Students should learn the main concepts of the object oriented analysis and design.  To introduce the students to the techniques of refactoring, design patterns and different software architectures. Upon completion of the course the students will be able to identify the restrictions and assess the quality of the software systems. They will be able to evaluate completeness and consistency of software specifications, and to design software architectures according the specific needs.',
        'предавања, аудиториски вежби, лабораториски вежби, проектни задачи, домашни задачи',
        'интерна евалуација и анкети', 'Анализа на софтверските барања или Софтверско инженерство',
        'Реализирани активности', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3W021', '', 'Capstone project', '6', '7', '1', '2023', 'Македонски и англиски',
        'Работа на студентите во групи (мали тимови)  во кои се дизајнира целосен проект  со примена на сите претходно научени работи',
        '',
        'На студентите во предзавршниот семестар им се дава можност групно да изработат еден поголем проект под надзор на ментор. Се поставува акцент на тимска работа и развој на комплексен софтвер. Пожелна е пракса во фирма.',
        '',
        'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и семинарска работа.',
        'механизам на интерна евалуација и анкети', 'освоени минимум 150 кредити', 'Реализирани актибвности', '0', '75',
        '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3W035', '', 'Linear algebra and applications', '6', '5', '1', '2023', 'Македонски и англиски',
        'Линеарна геометрија: Вектори во R2 и R3, скаларен производ на вектори, агол меѓу два вектори, векторски производ на вектори, равенка на права и рамнина и примени. Матрици: Дефиниција и операции со матрици и својства. Специјални видови на матрици, транспонирана матрица, симетрични матрици, дијагонална матрица, инверзна матрица. Системи линеарни равенки. Гаусов метод за решавање на системи линеарни равенки. Множество решенија на системи линеарни равенки. Геометриска интерпретација на решение на систем од линеарни равенки. Елиминација со помош на матрици: Елементарни матрици, елиминациони матрици и пермутациони матрици. LU факторизација и примена за решавање на системи линеарни равенки. Редуциран скалест облик на матрица. Реални векторски простори: Дефиниција на вектроски простор, векторски потпростори. Линеарна независност, база и димензија на векторски простор. Векторски простори и хомогени системи, ранг на матрица и примени. Координати и промена на бази. Примена. Ортогонални бази во Rn и ортогонален комплемент. Линеарни трансформации, дефиниција и примери. Јадро и ранг на линеарна трансформација. Матрица на линеарна трансформација. Ортогонални проекции и примена. Детерминанти и својства. Сопствени вредности и сопствени вектори. Дијагонализација на матрица.  Дијагонализација на симетрични матрица и примена. SV декомпозиција на матрици и примена.',
        '.    Linear geometry: Vectors in R2 and R3, dot product, angel between two vectors, cross product in R3, lines and planes  and applications. Linear equations and matrices: Matrix operations and properties, special types of matrices, transpose of a matrix symmetric matrices, diagonal matrices, inverse of a matrix. Solution of system of linear equations: Gaussian elimination, geometric interpretation of solution set.  Elimination with matrices: elementary matrices, elimination and permutation matrices. LU – factorization. Reduced echelon form of a matrix. Real vector spaces: Definition of a vector spaces and subspaces,  linear independence, basis and dimension of a vector space. Vector spaces and homogeneous systems, rank of a matrix and applications. Coordinates and change of basis. Applications. Orthogonal basis in Rn  and orthogonal complement. Linear transformations, definition and examples. The kernel and range of a linear transformation, The matrix of a linear transformation. Orthogonal projection and applications. Determinants and properties. Eigenvalues and eigenvectors, diagonalization, diagonalization of symmetric matrices and applications. SV decomposition of matrices.',
        'Запознавање со концептите и методите на линеарната алгебра и како истите да се користат за рамислување и решавање на проблеми кои произлегуваат од компјутерските науки',
        'In this course you will learn the concepts and methods of  linear algebra, and how to use them to think about problems arising in computer science.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'механизам на интерна евалуација и анкети',
        'Дискретна математика или Дискретни структури 2', 'Реализирани актибвности 15.2 и 16.1', '30', '45', '15', '0',
        '90', '180', '0', '0', '80', '20'),
       ('F18L3W037', '', 'Parallel and distributed processing', '6', '5', '1', '2023', 'Македонски и англиски',
        '(1) Вовед (1) Овозможувачки технологии и дистрибуирани системски модели (1) Основни концепти на паралелни и дистрибуирани архитектури (1) Паралелни комуникации (1) Паралелни алгоритми (2) Кластери (1) Гридови (1) Big data и Дистрибуирани датотечни системи (2) MapReduce концепти и имплементации (Hadoop) (1) Пресметување во облак - поддршка за паралелно и дистрибуирано процесирање',
        '(1) Introduction (1) Comprehensive concepts of parallel and distributed architectures (1) Basic concepts of parallel and distributed architectures  (1) Parallel communications (1) Parallel algorithms (2) Clusters (1) Grids (1) Big data and Distributed File Systems (2) MapReduce Concepts and Implementations (Hadoop) (1) Cloud Computing - Support for parallel and distributed processing(1) Introduction (1) Comprehensive concepts of parallel and distributed architectures (1) Basic concepts of parallel and distributed architectures  (1) Parallel communications (1) Parallel algorithms (2) Clusters (1) Grids (1) Big data and Distributed File Systems (2) MapReduce Concepts and Implementations (Hadoop) (1) Cloud Computing - Support for parallel and distributed processing',
        'Цел на предметот е студентите да ги совладаат методите на паралелно и дистрибуирано процесирање, можностите за паралелизација на секвенцијална програма, дистрибуирано процесирање на голем број на податоци и проблемите со кои треба да се справат во тој процес',
        'The purpose of the course is for students to master the parallel and distributed processing methods, sequential program parallelization capabilities, distributed processing of a large number of data and the problems they need to deal with in the process', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и
семинарска работа, учење во електронско опкружување (форуми, консултации).', 'механизам на интерна евалуација и анкети',
        'Алгоритми и податочни структури и Оперативни системи', 'Реализирани активности 15.2 и 16.1', '30', '45', '15',
        '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3W038', '', 'Programming paradigms', '6', '7', '1', '2023', 'Македонски и англиски',
        'Преглед и споредба на императивна, објектно-ориентирана, декларативна и функционална програмска парадигма. Вовед во декларативна програмска парадигма. Исказно сметање. Предикатна логика од прв ред. Основи на логички програмски јазик. Унификација. Пребарување со враќање наназад. Клаузална репрезентација на податочни структури и алгоритми. Рекурзија. Прекини. Негација. Претставување и манипулација со знаење со логички програмски јазик. Вовед во функционална програмска парадигма. Програмирање без странични ефекти. Структурирани податочни типови и нивно процесирање. Функции како објекти од прв ред. Анонимни функции. Функции од повисок ред. Функционални затворања. Карринг. Парцијални функции. Мрзлива евалуација. Бесконечни секвенци. Апстракција на секвенци. Конкурентност и паралелизам', 'Overview and comparison of the imperative, object-oriented, declarative and functional programming paradigms.
Introduction to the declarative programming paradigm. Propositional calculus. First order logic.
Programing in logic primer. Unification. Backtracking.
Clausal representation of data structures and algorithms. Recursion. Cuts. Negation.
Knowledge representation and manipulation.
Introduction to the functional programming paradigm. Effect-free programming.
Structured data and processing.
First-class functions. Anonymous functions.
Higher-order functions. Function closures. Currying. Partial application.
Lazy evaluation. Infinite sequences. Sequence comprehension.
Concurrency and Parallelism',
        'Целта на овој курс е запознавање на студентите со програмски парадигми различни од императивната и објектно-ориентираната, со фокус на декларативната и функционалната програмска парадигма. По завршувањето на курсот студентите треба да бидат способни да: Споредуваат различни програмски парадигми и да изберат соодветна за даден проблем, Користат логички програмски јазик за имплементација на ефикасни алгоритми,  Користат логички програмски јазик за репрезентација и манипулација со знаење, Користат функционален програмски јазик за пишување на програми без странични ефекти, Разбираат и користат функции од прв и повисок ред, функционални затворања, мрзлива евалуација и апстракција на секвенци, Разбираат и пишуваат едноставни конкурентни програми', 'The goal of this course is introducing students with programming paradigms, other than the imperative and object-oriented, with focus on the declarative and functional paradigm. On completion students should be able to:
-   Compare different programming paradigms and make appropriate choice of a programing paradigm for a given problem
-   Use a logic programming language to implement efficient algorithms
-   Use a logic programming language for knowledge representation and manipulation
-   Use a functional programming language to write effect-free programs
-   Understand and use first-class and higher-order functions, functional closures, lazy evaluation, sequence comprehensions
-   Understand and write simple concurrent programs.',
        'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и семинарска работа.',
        'механизам на интерна евалуација и анкети', 'Алгоритми и податочни структури',
        'Реализирани актибвности 15.2 и 16.1', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3W043', '', 'Information security', '6', '5', '1', '2023', 'Македонски и англиски', 'Вовед во информациска безбедност (Основни поими и дефиниции поврзани со информациската безбедност)
Основни криптографски поими (Историски примери, симетрична криптографија, криптографија со јавен клуч, xaш функции)
Криптографски алгоритми (Видови криптографски алгоритми, Diffie-Hellman размена на клучеви, шеми за автентикациска енкрипција)
Основни автентикациски поими (Автентикација, автентикациски методи, лозинки)
Биометриски технологии (Биометрика, основни поими и видови, дво-факторска автентикација)
Основни авторизациски поими (Авторизација, матрици за контрола на пристап)
Автентикациски модели (Повеќенивовски сигурносни модели, прикриени канали, огнени ѕидови, IDS-системи)
Протоколи (Едноставни протоколи, протоколи за размена на клучеви со симетрична криптографија, напади, Kerberos)
Автентикациски протоколи (Примери со напади, Otway-Rees, Needham-Schroeder, инфраструктура со јавен клуч)
Реални протоколи (SSH, SSL/TLS), Open SSL, Zero-knowledge протоколи (Fiat-Shamir протокол)
Злонамерен софтвер (Видови злонамерен софтвер, софтверски напади)
Безбедност на оперативни системи (Безбедносни функции на ОС, доверливи ОС)', 'Introduction to Information Security (Basic concepts and definitions related to Information Security)
Basic Cryptographic Terms (Historical examples, Symmetric cryptography, Public key cryptography, Hash functions)
Cryptographic Algorithms (Types of Cryptographic Algorithms, Diffie-Hellman Key Exchange, Authentication Encryption Schemes)
Basic Authentication Terms (Authentication, Authentication methods, Passwords)
Biometric Technologies (Biometrics, Basic concepts and types, Two-factor authentication)
Basic Authorization Terms (Authorization, Access control matrices)
Authentication models (Multilevel security models, Covert channels, Firewalls, IDS systems)
Protocols (Simple protocols, Key exchange protocols with symmetric cryptography, Attacks, Kerberos)
Authentication Protocols (Examples with Attacks, Otway-Rees, Needham-Schroeder, Public Key Infrastructure)
Real Protocols (SSH, SSL / TLS), Open SSL, Zero-Knowledge Protocols (Fiat-Shamir Protocol)
Malicious Software (Types of Malicious Software, Software Attacks)
Operating Systems Security (OS Security Functions, Trusted OS)', 'Изучување на поими поврзани со информациската безбедност; постапки и механизми за заштита кај компјутерските системи од
безбедносен аспект; методи што се применуваат за подигање на нивото на безбедност во однос на неовластен пристап.',
        'Learning the concepts related to Information Security; procedures and methods for securing computer systems; methods used to increasing the level of security.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'механизам на интерна евалуација и анкети', 'Оперативни системи',
        'Реализирани актибвности 15.2 и 16.1', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3W044', '', 'Computer electronics', '6', '5', '1', '2023', 'македонски и англиски', '(1) Вовед (Сигнали и засилувачи)
(1) Операциски засилувачи
(1) Полупроводници и диоди
(1) Кола со диоди
(1) Биполарни транзистори
(1) МОСФЕТ
(1) Засилувачи со МОСФЕТ
(1) Прв колоквиум
(1) CMOS дигитални кола
(1) Анализа на CMOS дигитални кола
(2) Напредни теми од дизајнот на дигитални интегрирани кола
(1) Мемориски кола',
        'Introduction (signals and amplifiers). Operational amplifier. Semiconductors and diodes. Circuits with diodes. Bipolar transistor. MOSFET. Amplifiers with MOSFET. CMOS digital circuits. Analysis of CMOS digital circuits. Advanced topics in digital integrated circuits design. Memory circuits.', 'Запознавање со фундаменталните типови на електронски елементи, принципот на работа, и нивните теоретски
модели. Анализа и дизајн на логички кола и засилувачи..',
        'Acquaint with the fundamental types of electronic elements, principle of work and their theoretical models. Analysis and design of logical circuits and amplifiers.', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).
', 'механизам на интерна евалуација и анкети', 'Електрични кола', 'реализирани активности 15.1 и 15.2', '30', '45',
        '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3W048', '', 'Software for embedded systems', '6', '7', '1', '2023', 'Македонски и англиски', '(1) Користење околона за развој, пишување, компајлирање и дебагирање на програма за вгргадливи системи (1) Разбирање на хардверските аспекти за однесувањето на вградливите системи (1) Перформанси, потрошувачка и цена на вградливи системи
(2) Основни софтверски техники за апликации за вградливи системи (1) Техники за дебагирање на апликации за вградливи системи
(1) Пишување програми кои извршуваат повеќекратни Влез/Излез операции (1) Софтверски редици за баферирани податочни протоци
(1) Пишување програми за периодични интерапти и такт сигнали (1) Пишување програми за мониторирање на физички својства, користење на податоци од сензори и контрола на актуатори (1) Структуриран пристап за пишуввање на комплексни апликации за вградливи системи (1) Креирање програми кои користат состојбени машини и RTOS за системски апликации за вградливи системи
(1) Безбедност на софтверот за вградливи системи', '(1) Using development environment, writing, compiling and debugging embedded programs (1) Understanding hardware aspects for the different behavior of embedded systems  (1) Performances, power consumption and cost of embedded systems.
(2) Basic software techniques for creating embedded apps (1) Debugging techniques for embedded applications
(1) Writing programs that execute multiple I/O operations (1) Software queues for buffered data streams
(1) Writing programs for periodic interrupts and clock signals (1) Writing programs for monitoring physical properties, using sensor data and actuators (1) Structured approach for writing complex embedded applications (1) Creating programs that use state-machines and RTOS for system applications in embedded systems
(1) Embedded software security',
        'Целта на курсот е да ги оспособи студентите да креираат апликации наменети за микроконтролери како и работа со влез/излез. Студентите ќе можат да имплементираат и управување со софтверска конфигурација.',
        'Students will obtain knowledge to create applications for microcontrollers that will work with I/O devices. Students will be able to implement and manage different software configurations.',
        'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и семинарска работа.',
        'механизам на интерна евалуација и анкети', 'Вградливи микропроцесорски системи', 'реализирани активности',
        '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3W050', '', 'Educational software design', '6', '5', '1', '2023', 'македонски', '(1)Модели и теории на учење. (1)Традиционални околини за учење. (1)Алатки кои се користат во традиционалните околини за учење.
 (1)Интеграција на технологијата во процесот на учење. (1)Основните модели на користење на ИКТ во образованието. (1)Алатки за технолошки потпомогнато учење. (1) Содржини за учење во иднината: анализа на успешни примени. (1) Дизајн на содржини за учење и Технолошки стандарди за дигитална содржина. (1) Објекти за учење: дигитална содржина која е повторно употреблива. (1)Технички стандарди за објектите за учење. (1) Дистрибуција и повторна употреба на објектите за учење: технички аспект. (1) Примери на примена на алатки за учење во основно и средно образованиe. (1) Алатки за креирање на објекти за учење',
        '',
        'По успешното завршување на овој предмет, студентот ќе биде во состојба да ги: разбере принципите (педагошки, когнитивни, инженерски) кои треба да се искористат при дизај на образовен софтвер, местото и примената на различните типови на образовен софтвер во образованието, начинот на кој образовниот софтвер помага да се остварат одередени педагошко-едукативни цели, како и основните принципи за користење на образовен софтвер без притоа тој да ја наруши дидактиката на образовниот процес.',
        '', 'настава, колаборативно учење. презентации, проектинастава, колаборативно учење. презентации, проекти',
        'механизам на интерна евалуација и анкети', 'ИКТ во образование', 'Реализирани актибвности 15.2 и 16.1', '30',
        '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3W053', '', 'Computer ethics', '6', '5', '1', '2023', 'македонски и англиски',
        '1. Новите технологии и нивното влијание Што е плагијат и како да се избегне? 2.    Воведни поими за етиката Од десетте заповеди на компјутерската етика до етичките кодекси на професионалните здруженија 3.   Основни поими за приватноста Приватност на информациите 4.  Законска заштита на приватноста Техники за зголемување на заштитата на приватноста 5.   Концепти и класификација на довербата Доверба во компјутерската технологија 6.  Надежност на технологијата Основни поими за безбедноста 7.  Презентација на првите групни проекти 8.    Безбедност на технологијата Безбедност на информациите 9.   Надзор Пристап кон информациите 10. Слобода на изразувањето Асистивни технологии 11. Интелектуална сопственост Заштита на интелектуалната сопственост 12.   Софтверско пиратство Софтверски патенти 13. Влијанието на ИКТ Глобализација Професионално однесување 14.    Презентација на вторите групни проекти', 'New technologies and their impact
What is plagiarism and how to avoid it?
Introduction to ethics
From ten commandments of computer ethics to ethical codices of professional ICT organizations
Introduction to privacy
Information privacy
Privacy legislation
Privacy enhancing technologies
Concepts and classification of trust
Trust in computer technology
Reliability
Introduction to security
Information technology
Surveillance
Freedom of speech
Assistive technologies
Intellectual property
Intellectual property protection
Software piracy
Software patents
Impact of ICTs
Globalization
Professional conduct', 'Способност да се согледаат клучните културни, општествени, правни и етички аспекти на ИКТ, влијанието на ИКТ, значењето и професионалните одговорности на ИКТ професионалците; Способност критички да се согледаат и дискутираат потенцијалните
ризици што со себе ги носи ИКТ, вклучувајќи ги и последиците од нејзиниот развој врз развојот на човештвото; Стекнување информации за националните и меѓународните закони за спречување и заштита од компјутерскиот криминал.', 'Upon successful completion of this course, the student will be able to:
- recognize the key cultural, social, legal and ethical issues of ICTs and their influence, as well as the professional responsibilities of ICT professionals;
- understand the importance and critically discuss the potential ICT risks, including the consequences of ICT`s fast development and its impact to humanity;
- gather information about national and international laws responsible for the prevention and protection against computer crime.', 'предавања, аудиториски вежби, индивидуални и групни проектни
задачи', 'Механизам за интерна евалуација и анкети', 'Напредно програмирање или Алгоритми и податочни структури',
        'Реализирани активности 15, 16', '60', '0', '35', '40', '45', '180', '0', '40', '100', '25'),
       ('F18L3W055', '', 'Multimedia Technologies', '6', '3', '1', '2023', 'Македонски и англиски',
        'Општи поими поврзани со различните медии, значење, влијанија и сеприсутност на мултимедијата во актуелното општество. Планирање и чекори при дизајнирање на мултимедиски проекти. Развој на сценарио за мултимедиски проект. Зачувување и пренос на мултимедијални податоци. Текст. Аудио технологии. Графика и слики. Видео технологии. Анимации, компјутерски технологии за развој на анимации и моделирање. Вовед во виртуелна и проширена реалност. Техники за компресија и пренос на мултимедијални податоци. Авторски и изведувачки права - законски решенија.',
        '',
        'Целта на предметот е студентот да се запознае со основите на различните медии: аудио, слики, видео и анимации и да ги сфати различните својства на секој од нив. Да ги знае и разбере различните формати и да се оспособи за користење за различни апликации за креирање на мултимедијални содржини. Студентот треба да развие мал мултимедијален производ со примена на изучените техники и методи.',
        '', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'механизам на интерна евалуација и анкети', 'Вовед во компјутерски науки',
        'Реализирани актибвности 15.2 и 16.1', '30', '45', '15', '15', '75', '180', '15', '15', '30', '15'),
       ('F18L3W058', '', 'Individual project', '6', '7', '1', '2023', 'Македонски и англиски',
        'Изработката на програмата треба да ги вклучува материјалите за учење, примерите за вежбање и  Тестовите и формите за евалуација на учењето.',
        '',
        'Целта на предметот е студентите со користење на современите алатки за  Електронско учење самостојно да ја изработат наставната програма за  предмет од основно или средно образование по  нивен избор.',
        '',
        'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и семинарска работа.',
        'механизам на интерна евалуација и анкети', 'освоени минимум 150 кредити', 'Реализирани активности 15.2 и 16.1',
        '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3W060', '', 'System administration', '6', '5', '1', '2023', 'Македонски и англиски', '(1) Управување со корисници, датотеки и софтвер на компјутерски систем во клиент сервер околина (MANAGEMENT)
(2) Инсталација и конфигурација на мрежни сервиси за интранет и Интернет домени (NETWORKING)
(2) Администрација на мрежни безбедносни полиси во Linux и Windows околина (SECURITY)
(1) Техники за интероперабилност на компјутерски системи во мешана околина (INTEROPERABILITY)
(2) Идентификација на можни извори на лоши перформанси и потенцијални решенија (PERFORMANCE DEBUGGING)
(1) Дизајн на мали и средни бизнис ИТ инфраструктури (CAPACITY PLANNING).
(2) Развој на скриптни механизми и автоматизирани скрипти за изведба на комплицирани административни задачи (SYSTEM SCRIPTING)
(1) Евалуација на различни полиси и механизми за обезбедување на надежност на компјутерските сервиси и работа (BACKUPS)
(1) Инсталација и конфигурација на Linux и Windows виртуелни машини (VIRTUALIZATION)
(1) Системи за работа со големи количества на податоци за голем број различни корисници (DATA CENTRES)', '(1) Management of users, files and software in computer systems in a client/server environment (MANAGEMENT)
(2) Installation and configuration of network services for intranet and Internet domains (NETWORKING)
(2) Administration of network security policies in Linux and Windows environment (SECURITY)
(1) Techniques for interoperability of computer systems in mixed environment (INTEROPERABILITY)
(2) Identification of possible sources of low performance and potential solutions (PERFORMANCE DEBUGGING)
(1) Design of small and medium businesses IT infrastructures (CAPACITY PLANNING).
(2) Development of scripting mechanisms and automation scripts for automation of complex administration tasks (SYSTEM SCRIPTING)
(1) Evaluation of different policies and mechanisms for enabling reliable network services (BACKUPS)
(1) Installation and configuration of Linux and Windows virtual machines (VIRTUALIZATION)
(1) Systems for management of big data for large number of diverse users (DATA CENTRES)',
        'Системската администрација претставува комплексен процес на оперативно управување со системските и софтверските компоненти кај компјутерските системи, се со цел да се обезбеди безбедни, надежни и достапни сервиси и услуги на корисниците. Организацијата на процесот на системска администрација е повеќестран и вклучува активности поврзани со управување со оперативни системи, мрежни сервиси како и на апликативни и други серверски системи.',
        'System administration represents a complex process of operational management of system and software components in computer systems, in order to provide secure, reliable and available services to users. Organization of the process of system administration is diverse and includes activities relaed to management of operating systems, networking services as well as application and other server systems.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'механизам на интерна евалуација и анкети', 'Оперативни системи',
        'Реализирани актибвности 15.2 и 16.1', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3W064', '', 'Distributed Systems', '6', '7', '1', '2023', 'Македонски и англиски',
        'Вовед. Мултипроцесорски vs мрежни системи. Архитектури за поврзување. Модели на сервиси. JSON, Google protocol buffers. RPC, дистрибуирани објекти, веб сервиси. Групна комуникација. Подредување и достава на пораки. Алгоритми за избирање. Ексклузивност. Репликација и виртуелна синхронизација. Консензус. Дистрибуирани трансакции. Дво/три-фазно извршување. Контрола на конкурентност. Дистрибуиран deadlock. Мрежни податочни системи. Дистрибуирани и паралелни податочни системи.  Именување и врзување. DNS. Multicast DNS. Дистрибуирани lookup и hash табели. Content delivery networks. peer-to-peer системи Дистрибуирано кеширање. Безбедност на дистрибуирани системи Дизајн на дистрибуирани системи.',
        'Introduction to distributed systems. Multiprocessors vs network systems. Architectures for interconnection. Models on services. JSON, Google protocol buffers. RPC, distributed objects, web services. Group communication. Ordered and reliable communication. Election algorithms. Distributed mutual exclusion. Replication and virtual synchronization. Consensus. Distributed transactions. Two/Three phase execution. Concurrency control. Distributed deadlock. Network file systems. Distributed and parallel file systems. Naming and binding. DNS. Multicast DNS. Distributed lookup and hash tables. Content delivery networks. Peer-to-peer systems. Distributed caching. Security in distributed systems. Design of distributed systems.',
        'Предметот има за цел запознавање со развојот на middleware системите. Предмеот ги покрива принципите врз кои се изградени дистрибуираните системи, пред се комуникациите, процесирањето, именување, конзистентност и репликација, справувње со дефекти и безбедност. Овие принципи се понатаму обработени во нивната примена кај дистрибуираните веб базирани системи, дистрибуираните објектно базирани системи, дистрибуираните датотечни системи и дистрибуираните коориднациски системи.',
        'This course covers the development of middleware systems. The subject covers the principles that underline the development of distributed systems, more specifically communications, processing, naming, consistency and replication, fault tolerance and security. These principles are furthermore analysed in their usage in distributed web based systems, distributed object based systems, distributed file systems and distributed coordination based system.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'механизам на интерна евалуација и анкети',
        'Оперативни системи и (Компјутерски мрежи или Компјутерски мрежи и безбедност)',
        'Реализирани актибвности 15.2 и 16.1', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3W068', '', 'Cloud computing', '6', '7', '1', '2023', 'Македонски и англиски',
        '(1) Вовед. Дефиниција и еволуција. Технологии, сервиси, модели. Популарни решенија. (1) Предности, ризици, предизвици. Економски модели и SLA. (1) Историска перспектива на инфраструктурата за облак. Компоненти на податочни центри. Дизајн на податочен центар, барања, моќност, ефикасност и редундантност. (2) Управување со облакот, софтвер за cloud deployment. Техники за автоматизација и оркестрација на ресурси. (1) Градење на  multi-tier апликација во облак со надежност и еластичност и импликации за доцнењето. (2) Виртуелизација и пресметување во облакот. (1) Складирање во облакот. Концепти. Дистрибуирани системи за датотеки (1) Бази на податоци во облакот. Складирање на облак објекти. (1) Модели на програмирање. Дистрибурирано програмирање во облакот (1) Податочно паралелна аналитика со MapReduce, Apache Spark, GraphLab. (1) Безбедност во облак околина. (1) Вовед во fog и dew computing.',
        '', 'Овој предмет ќе го оспособи студентот со основни познавања за концептот на облак и услуги во облак.', '',
        'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и семинарска работа.',
        'механизам на интерна евалуација и анкети', 'Виртуелизација', 'Реализирани активности 15.2 и 16.1', '30', '45',
        '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3W072', '', 'Autonomous robotics', '6', '7', '1', '2023', 'Македонски',
        'Сензори и ефектори во автономната роботика, математички принципи, веројатностни модели на сензори, веројатностни модели на управувањето, калманов филтер и негови имплементации, мапирање, локализација, истовремено мапирање и локализација, планирање и учење кај интелигентните роботски системи',
        'Sensors and actuators in autonomous robots, mathematical principles, probabilistic sensor models, probabilistic control models, kalman filters and implementations of kalman filters, mapping, localization, simultaneous localization and mapping, planning and learning methods used by intelligent robotic systems.',
        'По завршувањето на овој предмет, студентот се очекува да има продлабочено знаење за развој на автономни роботски системи (автономни возила, автономни летала и сл.) со користење на веројатностните пристапи во роботиката.',
        'After finishing this course, the student is expected to have advanced knowledge in the development of autonomous robotics systems (autonomous vehicles, drones etc.) by using probabilistic approaches in robotics.', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна
изработка и одбрана на проектна задача, учење во електронско опкружување (форуми, консултации).',
        'механизам на интерна евалуација и анкети', 'Основи на роботика',
        'Редовна посета на наставата, навремено предадени домашни и презентација на проектна задача', '30', '45', '15',
        '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3W075', '', 'Information Systems Analysis and Design', '6', '7', '1', '2023', 'македонски',
        'Функции на бизнис и системски аналитичар. Дефиниција на информациски системи и негови компоненти. Начелени парадигми за анализа и дизајн на информациски системи. Физибилити студија. Специфики на процесот на дизајн на информациски систем како проект. Моделирање на податоци и процеси. Пишување на спецификации. Пристапи кон почетно обезбедување на квалитет при дизајнирање на информациски системи. Дизајн на информациски системи. Осврт кон агилен пристап на имплементација на информациски системи. Основни принципи на спецификација преку пример.',
        'What are the roles of business analyst and system analyst? Information systems definitions and components. General paradigms for information systems analyses and design. Feasibility study. Features of a project based information system design. Data and process modeling. Creating effective specification. Information system quality of assurance approaches. Information system design. Agile approach for information systems implementation. Basic principles of specification by example.',
        'Запознавање на студенти со актуелните техники за анализа и дизајн на информациските системи (ИС). Навлегување во студија на случај на развој на ИС со користење на актуелни методологии. Оспособување за практична анализа на кориснички побарувања и креирање ефективни модели во сите фази  развој на еден ИС , со нагласок на фазите на анализа и дизајн. По завршување на курсот се очекува студентот да демонстрира знаење за користење на современи пристапи во процесот на анализа и дизајн на информациските системи.',
        'Students will be introduced with contemporary techniques for information systems analyses and design. Presentation of  different recent case studies for information system design and implementation methodologies. They will be able to perform practical user requirements analyses and crate effective models in different phases of information system development, with focus on analyses and design phases. After the course, the student will be able to demonstrate knowledge of novel approaches in the process of information system analyses and design.',
        'предавања, аудиториски вежби, лабораториски вежби, проектни задачи, домашни задачи',
        'интерна евалуација и анкети', 'Бази на податоци', 'Реализирани активности 15, 16', '30', '45', '15', '15',
        '75', '180', '10', '15', '70', '10'),
       ('F18L3W076', '', 'Introduction to time series analysis', '6', '7', '1', '2023', 'македонски и англиски',
        'Стационарни процеси Предвидување кај стационарни временски серии Спектрална анализа и филтрирање Вовед во ARMA и ARIMA процеси Моделирање и предвидување со ARMA и ARIMA процеси Нестационарни и сезонски модели на временски серии Модели на временски серии за финансиски податоци Повеќевредносни временски серии Состојбено-просторни методи Корелација и автокорелација Статистички методи во фреквентен и временски домен Моделирање за препознавање и предвидување на настани преку регресија и класификација', 'Stationary processes
Forecasting in stationary time series
Spectral analysis and filtering
Introduction to ARMA and ARIMA processes
Modeling and forecasting with ARMA and ARIMA processes
Non-stationary and seasonal models of time series
Time series models of of financial data
Multivariate time series
State-space methods
Correlation and autocorrelation
Statistical methods in time and frequency domain
Modeling for forecasting and recognition of events with regression and classification',
        'Запознавање на студентите со анализа на произволни временски серии. Курсот два вовед во типовите на временски серии, покрива стационарни процеси, спектрална анализа на стационарни процеси, ARMA модели, ARIMA и сезонални ARIMA модели, временско-просторни методи. Со знаењето стекнато на курсот студентите ќе може да анализираат временски серии од берзански податоци, да откриваат трендови, да предвидуваат идни појави, како и да ги користат за препознавање на разновидни настани кои се опишани со временски серии.',
        'The course is an introduction to types of time series, and covers: stationary processes, spectral analysis of stationary processes, ARMA models, ARIMA and seasonal ARIMA models, state-space methods. After completing the course, students be able to analyze arbitrary time series, including stock market time series, to predict future events, as well as to recognize events that are described with time series.',
        'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'механизам на интерна евалуација и анкети', 'Вовед во случајни процеси или Статистичко моделирање',
        'Реализирани активности', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3W088', '', 'Introduction to Smart Cities', '6', '7', '1', '2023', 'македонски и англиски',
        'Што се паметни градови? Архитектура и дизајн на паметните градови. Технологии на хардверско и мрежно ниво. Податочно и апликациско ниво на паметните градови. Паметни урбани енергетски мрежи. Паметни урбани транспортни системи. Паметни урбани системи за здравствена грижа. Урбани модели. Агент-базирани урбани модели. Примена и трендови на машинското учење во паметните градови. Опис на примери на паметни градови',
        'What are smart cities? Architecture and design of smart cities. Technologies at hardware and network layer. Data and application layer of smart cities. Smart urban power networks. Smart urban transport systems. Smart urban health care systems. Urban models. Agent-based urban models. Application and trends of machine learning in smart cities. A description of examples of smart cities',
        'Да го запознае студентот со главните концепти, теми и трендови на паметните и одржливите градови, улогата на информациите во дизајнот на мрежните ресурси и влијанието врз урбаниот дизајн, развојот и урбаното живеење.',
        'The goal is to familiarize the student with the main concepts, topics and trends of smart and sustainable cities, the role of information in the design of network resources and the impact on urban design, development and urban living.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'механизам на интерна евалуација и анкети', 'Машинско учење',
        'Изработени лабораториски вежби', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3W089', '', 'Introduction to Pattern Recognition', '6', '7', '1', '2023', 'македонски и англиски',
        'Вовед во проблематиката на препознавање на облици. Машинска перцепција, компоненти на систем за препознавање на облици.  Видови на обележја, екстракција на обележја, селекција на обележја и генерирање на обележја. Класификатори базирани на Баесовата теорија на одлучување, линеарни класификатори, нелинеарни класификатори. Методи за ненадгледувано учење. Дизајн и имплементација на систем за препознавање на облици. Евалуација на перформанси на систем. Примери за примена кај системи за идентификација и автентификација, за медицинска дијагносика, одбрана, биоинформатика, препознавање на текст, ракопис, лица, отисоци од прст, биометриски податоци,  препознавање на говор, класификација на текст.',
        'Introduction to the problem of pattern recognition. Machine perception. Components of pattern recognition system. Types of features, feature extraction, selection and generation. Bayes classifiers, linear classifiers, non-linear classifiers. Methods for unsupervised learning. Design and implementation of pattern recognition system. Evaluating system performance. Systems for identification and authentication, for medical diagnosis, defence, bioinformatics, recognition of texts, handwriting, fingerprint, biometric data, speech recognition, text classification, etc.', 'Целта на курсот е студентите да ги научат главните концепти на методите и техниките кои се применуваат за
препознавање на облици.По завршувањето на курсот кандидатитеќе бидат оспособени за дизајнирање,
реализирање и имплементација на системи за автоматско препознавање на облици, проценка на нивните
перформанси и нивна оптимизација.',
        'To introduce the students to the basic concepts of the methods and techniques of pattern recognition. Upon completion of the course the students will be able to design, implement and effectuate systems for automatic pattern recognition, their performance evaluation and optimization.',
        'предавања, аудиториски вежби, лабораториски вежби, проектни задачи, домашни задачи',
        'интерна евалуација и анкети', 'Машинско учење', 'Реализирани активности 15, 16', '30', '45', '15', '15', '75',
        '180', '10', '15', '70', '10'),
       ('F18L3W092', '', 'Digital Post-production', '6', '7', '1', '2023', 'македонски и англиски',
        'Дигитална постпродукција. Дигитална композиција. Информации на ниво на пиксел. Алатки за дигитално композитирање.Виртуелни камери. Стереоскопија. Ротоскопија и останати техники за изолација на пиксели. Отстранување на еднобојни позадини. Вметнување на пејсажи. Отстранување на боја според клучни параметри. Дигитално маскирање на објекти. Следење на објекти во слика и движења. Спарување на движења. Стабилизација на слика.Вметнување на дигитални 3Д објекти во слика. Системи за честички. Постпродукциски ефекти. Видео монтажа. Оценување на боја (color grading). Дигитализација на движења.',
        'Digital post-production. Digital compositing. Information on pixel level. Tools for digital composition. Virtual cameras. Stereoscopy. Rotoscoping and other techniques for pixel isolation. Greenscreen and bluescreen removal. Mate-painting techniques. Keying. Masking of objects. Tracking images and movement. Match-movement. Image stabilization. Insertion of digital 3D objects in footage. Particle systems. Post-production effects. Video montage. Color grading. Motion capture techniques.',
        'По завршување на курсот се очекува студентите да се оспособени за основни методи за дигитална постпродукција, дигитално композитирање, работа со секвенци од слики, интеграција на дигитални објекти во слики и следење и спарување на движења од различни извори',
        'After completion of the course it is expected for the students to be capable of using basic methods for digital postproduction, digital compositing, work with sequences of images, integration of digital objects into footage, motion tracking and match-move object from different sources.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', 'Механизам за интерна евалуација и анкети',
        'Компјутерска графика или Дигитално процесирање на слика', 'Реализирани активности 15.2', '30', '45', '15',
        '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3W098', '', 'Distributed data storage', '6', '7', '1', '2023', 'македонски и англиски',
        'Архитектура на системи за складирање на податоци - Околини за безбедно складирање на податоци - Техники за заштита на податоци од губење - Интелигентни системи за складирање - Storage area network (SAN) и network attached storage (NAS) - Fiber Channel SAN - IP SAN i FCoE SAN - Објектно базирани системи за складирање на податоци - Паралелни, дистрибуирани и споделени датотечни системи (Lustre, GlusterFS, MooseFS, GFS2, Ceph, OrangeFS, DRBD, XtreemeFS)', '- Architecture of systems for data storage
- Environment for safe data storage
- Techniques for increasing data safety
- Intelligent data storage systems
- Storage area network (SAN) and network attached storage (NAS)
- Fibre Channel SAN
- IP SAN and FCoE SAN
- Object based data storage systems
- Parallel, distributed and shared file systems (Lustre, GlusterFS, MooseFS, GFS2, Ceph, OrangeFS, DRBD, XtreemeFS)',
        'Се поголемата важност и големиот обем на податоците побаруваат соодветни техники и технологии за нивно безбедно, достапно, надежно и скалабилно складирање. Се почестите приоди за складирање на податоци се ориентираат кон дистрибуирани решенија чии имплементации вклучуваат најразлични архитектури и модели со што се добиваат различни придобивки, специфични за секоја имплемнетација. Предметот има за цел да ги обработи техниките на хардверско, мрежно и софтвеско ниво за обезбедување на дистрибуирано складирање на податоците.',
        'The increasing importance and volume of data requires special techniques and technologies for their safe, reliable, available and scalable storage. More often aproaches for data storage are oriented towards distributed solution which implementations include different achitectures and models that achieve different advantages, specific for every implementation. This course covers techniques on hardware, network and software level for enabling distributed data storage.',
        'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'механизам на интерна евалуација и анкети',
        'Оперативни системи и (Компјутерски мрежи или Компјутерски мрежи и безбедност)',
        'реализирани активности 15.1 и 15.2', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3W105', '', 'Innovation in ICT', '6', '7', '1', '2023', 'македонски и англиски', 'Иновативни организации. Разбирање на иновативноста. Процес на иновирање во компаниите. Иновативни вештини.
Поддршка за креативност. Управување со процесот на иновирање. Функција на дизајнот во иновациите. Иновации водени од
дизајн. Мерење на иновативноста во организациите. Комерцијализација на иновациите. Ефективни иновациски планови.
Користење на ИКТ како поддршка за иновации. Иновирање во ИКТ. Забрзување на иновациите со користење на ИКТ. Нови
ИКТ технологии и можности за иновирање.', 'Innovative organizations. Understanding innovation. The process of innovation in companies. Innovative skills.
Support for creativity. Manage the innovation process. Function of design in innovation. Innovations driven by
design. Measuring Innovation in Organizations. Commercialization of innovation. Effective innovation plans.
Using ICT as an Innovation Support. Innovation in ICT. Accelerate innovation by using ICT. New
ICT technologies and innovation opportunities.', 'Разбирање на иновативноста. Стекнување на иновативни вештини. Примена на ИКТ за креирање на иновации. Креирање на
иновации во ИКТ.', 'Understanding innovation. Acquiring innovative skills. Application of ICT for creating innovations. Creating
innovation in ICT.', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и
семинарска работа, учење во електронско опкружување (форуми, консултации).', 'механизам на интерна евалуација и анкети',
        'Бизнис и менаџмент и (Веб прогрмирање или Интернет технологии или Имплементација на системи со отворен и слободен код)',
        'реализирани активности 15.1 и 15.2', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3W108', '', 'IoT', '6', '7', '1', '2023', 'македонски и англиски', '(1) Вовед во Интернет на Нешта (ИнН). Еволуција од безжични сензорски и персонални мрежи кон Интернет на Нештата. Хардверски апстракции.
(1) Архитектура на ИнН системи (dew, fog, edge, cloud). Воспоставување на ИнН инфраструктура.
(1) Електроника потребна за ИнН, сензори и ИнН платформи.
(1) ИнН безжично поврзување. LoRaWAN, ZigBee и Bluetooth Технологија за поврзување. RFID и NFC технологија. Интероперабилност на безжични ИнН протоколи.
(1) 6LowPAN. Архитектура. 6LowPAN заглавие. 6LowPAN  адресирање. 6LowPAN   Компресија. Фрагментација и рутирање.
(1) Протоколи на апликациско ниво. MQTT и COAP.
(1) Алгоритми за локализација, рутирање, самоорганизирање, агрегација, фузирање и класификација на податоци од ИнН.
(1) Системи за прибирање (аквизиција) на сензорски (ИнН) податоци.
(1) Обработка на податоците добиени од ИнН сензорите. Податочна анализа со користење на различни Python пакети и визуелизација на податоците.
(1) Насоки/можности/предизвици при дизајн. Безбедност и доверливост на ИнН системи.
(1) Безжичен транспорт на енергија и energy harvesting кај ИнН .
(1) Преглед на популарни апликативни домени на ИнН: паметни домови, паметни енергетски мрежи, паметни градови, транспорт, UAV, заштита на природата, здравствена заштита, системи за мониторинг, биолошките и безбедносните системи.', '(1) Introduction to Internet of Things. Evolution from wireless sensor and personal area networks to Internet of Things. Hardware abstractions.
(1) Building the IoT Architecture (dew, fog, edge, cloud).
(1) IoT electronics, sensors and IoT platforms.
(1) IoT wireless connectivity. LoRaWAN, ZigBee and Bluetooth Low Energy technology. RFID and NFC technology. Interoperability  of different wireless IoT protocols.
(1) 6LowPAN. Architecture. 6LowPAN headers and addressing. 6LowPAN  compression. Fragmentation and routing.
(1) Application level protocols. MQTT and COAP.
(1) Localization algorithms, routing, self-organizing, aggregation, data fusion and classification in IoT
(1) Data acquisition systems for sensor data.
(1) Processing sensor IoT data. Data analysis using different Python packages and data visualization.
(1) Design guidelines/possibilities/risks. Security, privacy and data confidentiality in IoT systems.
(1) Wireless energy transport and energy harvesting in IoT.
(1) Survey of popular application IoT domains: smart home, smart grid, smart city, smart city, UAV, smart eco-systems, smart health, monitoring systems, biological and security systems.',
        'Студентот ќе биде запознаен со главните развојни чекори  и предизвици при дизајнирање на решенија базирани на Интернет на нештата.  Студентот ќе може да моделира, дизајнира и имплементира вакви системи во различни апликативни домени.',
        'Students will obtain knowledge about the main development steps and challenges when designing Internet of Things based solutions. At the end of the course students can model, design and implement IoT systems in different application domains.',
        'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'механизам на интерна евалуација и анкети',
        'Вградливи микропроцесорски системи и (Компјутерски мрежи или Компјутерски мрежи и безбедност)',
        'Изработени лабораториски вежби', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3W123', '', 'Machine Vision', '6', '7', '1', '2023', 'македонски',
        'Вовед во компјутерска визија. Камери и оптика. Осветлување и боја. Пиксели и филтри. Обработка на слики во фреквенциски домен. Пирамиди на слика. Машинско учење: кластерирање и класификација. Детекција на рабови и поклопување на линии. Робустно поклопување на линии (Hough трансформација, RANSAC и др.). Кластерирање и сегментација на слики. GMM (Gaussian Mixture Models). Детекција на точки од интерес. Следење на карактеристики. Оптички тек. Стерео коресподенција. Карактеристики на слика инваријантни на скалирање и ротација (SIFT, SURF). Речници од визуелни зборови. Препознавање и класификација на визуелни објекти.',
        '', 'Да се воведат студентите во основните концепти и техники во компјутерската визија. Студентите кои успешно ќе
го завршат курсот ќе бидат способни за дизајнирање на ефикасни системи за компјутерска визија како:
препознавање на ракопис, детекција и препознавање на лица, проценка на движење, следење на луѓе и возила,
препознавање на гестови, препознавање и класификација на визуелни објекти, разбирање и анализа на сцени
итн.',
        'The goal of this course is to introduce the students to the basic concepts and principles of computer vision. The students who will successfully finish the course will be able to design efficient systems for computer vision for handwriting recognition, detection and recognition of faces, movement detection, human and vehicle tracking, gesture recognition, classification and recognition of visual objects, scene analysis and understanding etc.',
        ' предавања, аудиториски вежби, лабораториски вежби, проектни задачи, домашни задачи',
        'интерна евалуација и анкети', 'Дигитално процесирање на слика или Машинско учење',
        'Реализирани активности 15, 16', '30', '45', '15', '15', '75', '180', '30', '15', '20', '10'),
       ('F18L3W129', '', 'Mobile platforms and programming', '6', '7', '1', '2023', 'македонски и англиски', '(1) Вовед и трендови за развој на мобилни апликации (Андроид)
(2) Архитектура на мобилни апликации
(1) Конфигурирање на мобилни апликации
(1) Управување со ресурси
(1) Концепти на кориснички интерфејс кај мобилните уреди
(1) Развоен процес кај мобилни апликации
(1) Планирање на корисничкото искуство кај мобилната апликација
(1) Развој на компатибилни мобилни апликации
(1) Тестирање на мобилните апликации
(1) Публикување на маркет
(2) Мобилен веб', '(1) Introduction and trends for the mobile applications development (Android)
(2) Architecture of mobile applications
(1) Mobile applications Configuration
(1) Resource Management
(1) Concepts of user interface design for mobile devices
(1) Development process for mobile applications
(1) Planning the user experience in mobile application
(1) Development of compatible mobile applications
(1) Mobile application testing
(1) Publishing to the market
(2) Mobile Web',
        'Целта на предметот е студентите да се запознаат со современите мобилни платформи и да научат да програмираат и развиваат мобилни апликации. Ќе научат да се справуваат со ограничувањата од мобилните уреди и да развиваат ефикасни програми. Изработените апликации ќе научат да ги публикуваат на маркет и да го следат користењето на истите',
        'After the successful completion of the course, the student will understand and be able to deploy knowledge of mobile operating systems, native mobile application programming and mobile web programming.', ' Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби
(користење на опрема и софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна
изработка и одбрана на проектна задача и семинарска работа, учење во електронско опкружување (форуми,
консултации).', 'интерна евалуација и анкети', 'Алгоритми и податочни структури',
        'Редовно посетување настава (до 3 отсуства), навремно доставување на сите домашни задачи и проект', '30', '45',
        '15', '15', '75', '180', '0', '15', '65', '15'),
       ('F18L3W131', '', 'Modeling and simulation', '6', '7', '1', '2023', 'македонски и англиски',
        'Вовед во моделирање и симулација. Генерирање на случајни броеви. Модели на дискретни и континуирани системи. Високо-димензионални системи. Естимација на состојба и параметри со реални податоци. Модели со агенти. Модели со теорија на игри. Стохастични модели и нивна примена во финансии. Редици на чекање. Техники на оптимизација. Методи за намалување на димензионалноста.',
        'Introduction to modeling and simulation. Random number generation. Discrete and continuous models. High-dimensional systems. State and parameter estimation on base on real data. Agent based models. Game theoretic models. Stochastic models and application in finance. Queueing models. Optimization techniques. Methods for dimensionality reduction.', 'Студентот ќе се здобие со знаења за користење на техники за моделирање со цел да го евалуира однесувањето на реалните системи. Студентот ќе стекне способност за конструирање, верификација и решавање
на модели со различни нивоа на апстракција и деталност. Ќе бидат опфатени и методи за фитување на состојбата и параметрите на моделите со реални податоци, како и предвидување на идното однесување и `што-ако` анализи.',
        'The student will gain knowledge about using modeling techniques which will help evaluate the behavior of the real systems. The student will become able for construction, verification and solution of models with different levels of abstraction and detail. Тhe course will also include methods for fitting the model state and the parameters to real data, prediction of future behavior and `what-if` analyses.', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и
софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на
проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'механизам на интерна евалуација и анкети',
        'Веројатност и статистика или Основи на теорија на информации или Бизнис статистика',
        'реализирани активности 15.1 и 15.2', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3W136', '', 'Advanced Web Design', '6', '5', '1', '2023', 'македонски и англиски',
        'Вовед во предметот. Естетика. Responsive CSS. CSS Frameworks, Bootstrap. Графика на Веб. Canvas. SVG. Search Engine Optimisation. HTML5 Offline. CSS Preprocessors. Internet Marketing. Content management Systems. SMIL',
        'Introduction. Aesthetics, Responsive CSS. CSS Frameworks, Bootstrap. Graphics for the Web. Canvas. SVG. Search Engine Optimisation. HTML5 Offline. CSS Preprocessors. Internet Marketing. Content management Systems. SMIL.',
        'Целта на наставната програма е студентите да се запознаат со напредните технологии во областа на веб дизајнот и развојот на модерни динамички веб апликации. По завршување на предметот, студентите ќе имаат преглед на најновите технички достигнувања во областа на веб дизајнот и ќе бидат способни да ги користат истите во изработк на практични проекти',
        'The goal of the study program is for the students to be acquainted with the advanced technologies in the area of Web Design and modern dynamic web applications. After completion of the course, the students will have an overview of the newest technologies in the area of web design and will be capable of using them in the development of practical projects.',
        'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации)',
        'механизам на интерна евалуација и анкети', 'Основи на веб дизајн', 'Реализирани активности 15.1 и 15.2', '30',
        '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3W142', '', 'Natural language processing', '6', '7', '1', '2023', 'македонски и англиски',
        'Вовед; Основна обработка на текстови; Морфологија; Синтакса, Семантика и двосмисленост на природните јазици; Морфологија на зборовите и конечни автомати; Mоделирање на природните јазици; Основни алгоритми за поправка на правописни грешки (Spelling Correction); Коренување на зборовите (Stemming); Парсирање; Класификација на текстови; Основи на машинско преведување; Основни алгоритми за извлекување на информации од текстуални податоци;',
        '',
        'Целта на предметот е студентитеда се стекнат со основните теоретски и практични знаења за алгоритмите за обработка на природните јазици. Ќе стекнат знаења за тоа како јазичната структура и значење се репрезентираат во структури наподатоци, како овие структури и значење да се препознаат во текстуалниподатоци, и најбитно, како да изградат алгоритми кои ќе ги препознаваатвистинските одговори помеѓу големиот број опции.',
        '', 'Предавања поддржани со презентации преку слајдови, интерактивни предавања,
вежби (користење на опрема и софтверски пакети), тимска работа, пример случаи,
поканети гости предавачи, самостојна изработка и одбрана на проектна задача и
семинарска работа, учење во електронско опкружување (форуми, консултации).', 'механизам на интерна евалуација и анкети',
        'Машинско учење', 'реализирани активности 15.1 и 15.2', '30', '45', '15', '15', '75', '180', '10', '15', '70',
        '10'),
       ('F18L3W144', '', 'Operations research', '6', '7', '1', '2023', 'македонски и англиски',
        '1. Вовед во операциони истражувања 2. Моделирање со линеарно програмирање 3. Симплекс метода и анализа на осетливост 4. Мрежни модели 5. Управување со проекти со  PERT/CPM 6. Динамичко, целно и целобројно програмирање 7. Нелинеарно програмирање 8. Теорија на одлучување, теорија на игри 9. Системи на редици на чекање 10. Симулациски модели 11. Маркови ланци 12. Предвидување',
        '1. Introduction to operations research 2. Linear programming modeling 3. Simplex method and sensitivity analysis 4. Network models 5. Project management with PERT/CPM 6. Dynamic, goal and integer programming 7. Nonlinear programming 8. Decision making theory, game theory 9. Queuing systems 10. Simulation models 11. Markov chains 12. Prediction',
        'Да го запознае студентот со областа на проблеми и методи на операциони истражувања, проблеми на оптимизација на ресурси и проекти и оптимално управување, со методи и техники на линеарно и нелинеарно програмирање, теории на одлучување и игри, операциони истражувања поврзани со управувaчки информациски системи и информациски системи за подршка на одлучување и предвидување.',
        'The goal is to familiarize the student with the problems and methods in the field of operations research, problems of resource and project optimization  and optimal management, with methods and techniques of linear and nonlinear programming, decision making theories and games, operations research related to management information systems and information systems for decision making and prediction.',
        'усвојување на поимите, својствата и техниките со самостојна работа; решавање на поставени задачи и проблеми за вежбањe; самостојна изработка и одбрана на проектна задача',
        'механизам на интерна евалуација и анкети', 'Веројатност и статистика или Основи на теорија на информации',
        'Изработени лабораториски вежби', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3W145', '', 'Optical networks', '6', '7', '1', '2023', 'македонски и англиски',
        'Вовед во оптички мрежи. Пропагација на сигнали низ оптички влакна. Оптички компоненти и модулација. Клиенти на оптичкиот слој (SONET/SDH, OTN). WDM мрежни елементи. Контрола и управување со оптички мрежи. Контрола и управување со оптички мрежи. Робустност на оптички мрежи. Дизајн на WDM мрежи. Динамичко рутирање и алокација на спектар. Пристапни оптички мрежи. Пакетно свичување. Различни аспекти во примери на реални оптички мрежи.',
        'Introduction to optical networks. Propagation of signals through optical fiber. Optical components and modulation. Client layers of the optical layer (SONET/SDH, OTN). WDM network elements. Control and management of optical networks. Optical networks survivability. Design of WDM networks, Dynamical routing and spectrum allocation. Optical access networks. Optical packet switching. Different aspects in examples of real optical networks.',
        'Студентот ќе се стекне со основни познавања за дизајн, контрола и управување на оптички мрежи со помош на современите мрежни технологии, како и со некои тековни развои во областа.',
        'The students will acquire the fundamental knowledge of design, control and management of optical networks using contemporary network technologies, as well as some of the recent developments in the area.',
        'Предавања поддржани со презентации преку слајдови, интерактивни предавања, вежби (користење на опрема и софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и семинарска работа, учење во електронско опкружување (форуми, консултации).',
        'механизам на интерна евалуација и анкети', 'Комјутерски мрежи или Компјутерски мрежи и безбедност',
        'реализирани активности 15.1 и 15.2', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3W148', '', 'Introduction to robotics', '6', '5', '1', '2023', 'Македонски/Англиски',
        'Вовед во роботика. Сензори во роботиката. Ефектори во роботиката. Кинематика и динамика на роботски системи. Програмски системи за управување со роботи. Учење кај роботите. Роботите како интелигентни агенти. Роботите во индустријата. Автономни роботи. Примена на роботи во општеството,  производните процеси, медицината,.',
        '',
        'По завршувањето на овој предмет, студентот се очекува да има познавања од принципите на развој на роботи и системи кои вклучуваат сензори и ефектори. Студентите ќе се запознаат со начините на програмирање роботи кои овозможуваат нивно управување. Студентите ќе се запознаат со примената роботите во индустријата и општеството',
        '',
        'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и семинарска работа.',
        'механизам на интерна евалуација и анкети', 'Алгоритми и податочни структури', 'Реализирани активности', '30',
        '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3W154', '', 'Mining Massive Data Sets', '6', '7', '1', '2023', 'македонски и англиски',
        'Вовед во MapReduce, фреквентни множества и асоцијативни правила, барање на најблиски соседи во многу-димензионални податоци, локациски сензитивни хеширања, намалување на димензионалноста (SVD and CUR), системе за препорака, кластерирање, Random Walks with Restarts, надгледувано учење кај масивни податочни множества (К-најблиски соседи, перцептрон, класификациски и регресиски дрва, рударење на податочни потоци, веб рекламирање',
        'Introduction and MapReduce. Association Rules: Frequent itemsets and Association rules, Near Neighbor Search in High Dimensional Data, Locality Sensitive Hashing (LSH), Dimensionality reduction: SVD and CUR, Recommendation Systems, Clustering, Random Walks with Restarts, Large scale supervised machine learning: k-nearest neighbor, Perceptron, Classification and regression trees, Mining data streams, Web Advertising.',
        'Студентите да се запознаат со алгоритмите и техниките на податочно рударење и машинско учење за анализа на многу големи податочни множества. Фокус ќе биде даден на дистрибуираните платформи како и на начинот на дефинирање и креирање на алгоритми за процесирање и анализа на многу големи податочни множества.',
        'The course will introduce the students data mining and machine learning algorithms for analyzing massive amounts of data. The emphasis will be on the distributed platforms and Map Reduce as a tool for creating parallel algorithms that can process large amounts of data.', 'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски
пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна
задача и семинарска работа.', '30+65+30+20+35 = 180 часа', 'Паралелно и дистрибуирано процесирање',
        'реализирани активности', '30', '30', '15', '19', '75', '180', '0', '19', '60', '0'),
       ('F18L3W156', '', 'Decision support systems', '6', '7', '1', '2023', 'македонски и англиски',
        'Експертни системи. Процес на инженеринг на знаење. Репрезентација на знаење. Откривање на знаење. Расудување со несигурност. Непрецизирана логика. Донесување на одлуки, системи, моделирање и поддршка. Системи за поддршка при одлучувањето, концепти, методологии и технологии. Моделирање и анализа при донесување на одлуки. Анализа на одлуки. Апликации за донесување на деловни одлуки во менаџмент, маркетинг, продажба, управување на односи со клиени, е-трговија, иновации и др. Колаборација, комуникација, системи за поддршка при одлучување во група. Управување со знаење. Системи за поддршка на менаџментот, трендови и влијанија. Алатки и средини за развој и дизајн.',
        'Expert systems. Process of knowledge engineering. Knowledge representation. Knowledge discovery. Reasoning with uncertainty. Fuzzy logic. Decision making, systems, modeling and support. Decision support systems, concepts, methodologies and technologies. Modeling and analysis in decision making. Analysis of decisions. Applications for making business decisions in management, marketing, sales, customer relationship management, e-commerce, innovations, etc. Collaboration, communication, decision support systems for making decisions in a group. Knowledge management. Decision support systems for management, trends and influences. Tools and frameworks for development and design.',
        'Овој курс претставува вовед во примена на анализа на податоци за донесување деловни одлуки. Целта на курсот е студентите да се запознаат со методите, техниките и системите за поддршка при одлучувањето, како и анализа на одлуките. Да се запознаат со техниките за стекнување на знаење и репрезентација на знаење. По завршување на курсот студентите ќе стекнат знаење како да ги користат системите за поддршка при одлучувањето, правилно да изберат соодветен систем за поддршка при одлучувањето во даден бизнис контекст, како и да дизајнираат, развијат и менаџираат системи за поддршка при одлучувањето.',
        'This course is an introduction to the application of data analysis for making business decisions. The aim of the course is students to become familiar with the methods, techniques and decision support systems, as well as analysis of the decisions. To become familiar with the techniques for acquiring knowledge and representing knowledge. After completion of the course, students will gain knowledge of how to use decision support systems, how to properly choose an appropriate decision support system in a given business context, as well as to design, develop and manage decision support systems.',
        'предавања, аудиториски вежби, лабораториски вежби, проектни задачи, домашни задачи',
        'механизам на интерна евалуација и анкети', 'Вештачка интелигенција или Вовед во науката за податоци',
        'Реализирани активности 15, 16', '30', '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18L3W161', '', 'Social media networks', '6', '7', '1', '2023', 'Македонски и англиски',
        'Овој курс ќе воведе методи за анализа и разбирање на разни видови на социјално вмрежување, блогирање и микроблогирањето и други форми на онлајн интеракција, кои се моќна алатка за комуникација и споделување на информации. Во курсот ќе се изучува за тоа како луѓето ги користат овие технологии и нивните социјални импликации. Студентите ќе се запознаат со науката за анализа на мрежата. Преку примери од реалниот свет, вклучувајќи ја и анализата на сопствените социјални мрежи, студентите ќе развијат вештини за опишување и разбирање на моделите и користењето на услугите како Фејсбук, Твитер, ЈуТјуб и други. Ќе се дискутира за применливоста на новите социјални медиуми.',
        'The proliferation of social media and social networking websites, blogging and microblogging, and other forms of online interaction and content generation has introduced a powerful tool for people to communicate and share information. This course will introduce methods for analyzing and understanding how people use these technologies and their societal implications. The course will introduce students to the science and social science of network analysis. Through real world examples, including analysis of their own social networks, students will develop skills for describing and understanding the patterns and usage of services like Facebook, Twitter, YouTube, and others. Students will apply the analysis methods they have learned to understanding a particular question about social networks and social media.', 'Разбирање на основните концепти за анализата на социјалните мрежи.
Примена на овие методи преку взаемна колаборација меѓу студентите.
Да се разбере врската помеѓу квалитативните и квантитативните методи за анализа на социјалната мрежа
Да се разбере како овие општествени технологии влијаат на општеството и обратно', 'The objectives of this course for students are as follows:

Understand to the basic concepts of social network analysis
Collaborative with peers to apply these methods to a variety of social media
Understand the link between qualitative and quantitative methods of social network analysis
Understand how these social technologies impact society and vice versa',
        'Предавања со користење на презентации, интерактивни предавања, вежби (користење на опрема и софтверски пакети), тимска работа, пример случаи, поканети гости предавачи, самостојна изработка и одбрана на проектна задача и семинарска работа.',
        'механизам на интерна евалуација и анкети', 'Вовед во мрежна наука', 'реализирани активности 15.1 и 15.2', '30',
        '45', '15', '15', '75', '180', '10', '15', '70', '10'),
       ('F18W3S085', '', 'Introduction to Bioinformatics', '6', '7', '1', '2023', 'македонски', 'Што е биоинформатика. Централна парадигма во биоинформатиката. DNA секвенцна анализа.
RNA и предвидување на секундарна структура на протеини. Терциерни протеински структури и
нивната врска со протеинската функција. Вовед во пресметковните алатки и алгоритми за
решавање проблеми од молекуларната биологија. Поими за генска експресија и технологијата на
микрополиња. Поим за системска биологија. Управувачки стуктури во биоинформатика. DNA
програмирање. Користење геномски и протеински бази податоци. Вовед во генетско
инженерство.',
        'What is bioinformatics. Central paradigm in bioinformatics. DNA sequential analysis. RNA and prediction of the secondary structure of proteins. Tertiary protein structures and their relationship to protein function. Introduction to computational tools and algorithms for solving problems from molecular biology. Terms of gene expression and technology microwaves. The notion of systemic biology. Management Structures in Bioinformatics. DNA programming. Using genomic and protein bases data. Introduction to genetic engineering.', 'Студентите да се запознаат со областите и проблемите кои ги покрива биоинформатиката, да
бидат во можност да вршат генска и протеинска секвенцна анализа, да користат биолошки бази
податоци, да ги запознаат пресметковните методи за решавање проблеми во молекуларната
биологија.',
        'The goal of the course is to get the students to become acquainted with the areas and problems that cover bioinformatics, to be able to perform gene and protein sequential analysis, to use biological bases data, to learn computational methods for solving problems in the molecular biology.',
        'предавања, проекти, дискусии, работилници', '/', 'Машинско учење или Вештачка интелигенција',
        'Реализирани активности 15, 16', '30', '45', '15', '15', '75', '180', '10', '15', '40', '10'),
       ('F18W3S162', '', 'Green Computing', '6', '7', '1', '2023', 'македонски и англиски',
        'Вовед во одржливи и ефикасни компјутерски системи. Енергетско ефикасни компјутерски стандарди и регулативи. Минимизација и оптимизација на употребата на системски ресусри во компјутерски системи. Мерење и пресметка на моќност и ладење на компјутерски системи, минимизација на потрошувачка. Компјутерски компоненти за складирање на енергија (батерии, кондензатори). Употреба и оптимизација. Дизајн на модуларни одржливи и енергетски ефикасни електрични кола и компоненти во компјутерски системи. Дизајн на енергетски интелегетни софтверски процеси за минимизација на хардверски ресусри. Серверски енергетски ефикасни компјутерски системи. Енергетска ефикасност при дизајн на мобилни компјутерски системи. Реверзибилни компјутерски компоненти (Feynman, Toffoli и Fredkin кола) и системи и нивна одржливост. Реверзибилни софтверски решенија (Janus) и нивна примена. Рециклирање на компјутерски компоненти и системи и нивна ре-употреба. Планирање и развој на еко-компјутерски производни решенија.',
        'An Introduction in Green Computing. Energy-efficient computer standards and regulations. Minimization and optimization of the use of systemic ressources in computer systems. Measurement and calculation of power and cooling of computer systems, minimization of consumption. Computer components for energy storage (batteries, capacitors). Use and optimization. Design of modular, sustainable and energy efficient electrical circuits and components in computer systems. Design of energy-intensive software processes for minimizing hardware ressources. Server energy-efficient computer systems. Energy efficiency in the design of mobile computer systems. Reversible computing components (Feynman, Toffoli and Fredkin circuits) and systems and their sustainability. Reversible software solutions (Janus) and their application. Recycling of computer components and systems and their re-use. Planning and development of eco-computer production solutions.',
        'Студентите ќе стекнат знаење за мерење и пресметување компјутерска моќност и системи за ладење, дизајн на енергетско ефикасни компјутерски системи, процеси, компоненти во насока на ниска потрошувачка на енергија, дизајн на енергетско ефикасни електрични кола, дизајн на енергетски ефикасни компјутерски системи со минимум број на хардверски компоненти, дизајн на еко дата центри, рециклирање на компјутерска опрема, користење на виртиуелизација и интернет решенија во намалување на бројот на протребата од други компјутерски системи, користење на техники за планирање и развој на еко компјутерски технолошки решенија, еко-компјутерски стандарди и регулативи (EnergyStar, RoHS и други), штетно влијание на средината и рециклирање, бизнис процеси за одржлив компјутерски развој на компаниите и други зелени компјутерски технологии, зголемување на еко-свесноста со користење на еко-компјутерски решенија, рециклирање на компјутески компоненти и конструкција на одржливи компјутерски системи, одржливи компјутерски системи за мониторинг анализа во реално време, е-принт во компании, зголемување на бизнис вредноста на компаниите со користење на одржливи и ефикасни компјутерски системи.',
        'Students will gain knowledge about measuring and calculating computer power and cooling systems, design of energy efficient computer systems, processes, components in the direction of low energy consumption, design of energy efficient electrical circuits, design of energy efficient computer systems with a minimum number of hardware components, design of eco data centers, recycling of computer equipment, use of virtualization and Internet solutions in reducing the number of needs from other computer systems, benefit eco-computer standards and regulations (EnergyStar, RoHS and others), harmful environmental impacts and recycling, business processes for sustainable computer development of companies and other green computer technologies, increase of the technologies for planning and development of eco computer technology solutions, eco-awareness using eco-computer solutions, recycling of computer components and construction of sustainable computer systems, sustainable computer systems for monitoring real-time monitoring, e-print in companies, increasing the business value companies using sustainable and efficient computer systems.',
        'предавања, аудиториски вежби, лабораториски вежби, проектни задачи, домашни задачи',
        'интерна евалуација и анкети', 'Компјутерски компоненти', 'реализација на лабораториски вежби', '30', '45',
        '15', '15', '75', '180', '10', '15', '70', '10');

insert into study_program_subject(id, subject_id, study_program_code, mandatory, semester, subject_group)
VALUES ('IMB18-F18L1S013', 'F18L1S013', 'IMB18', '1', '2', '0'),
       ('IMB18-F18L1S015', 'F18L1S015', 'IMB18', '0', '2', '100'),
       ('IMB18-F18L1S016', 'F18L1S016', 'IMB18', '1', '2', '0'),
       ('IMB18-F18L1S023', 'F18L1S023', 'IMB18', '0', '2', '100'),
       ('IMB18-F18L1S026', 'F18L1S026', 'IMB18', '0', '2', '100'),
       ('IMB18-F18L1S034', 'F18L1S034', 'IMB18', '0', '2', '100'),
       ('IMB18-F18L1S146', 'F18L1S146', 'IMB18', '0', '2', '100'),
       ('IMB18-F18L1W005', 'F18L1W005', 'IMB18', '1', '1', '0'),
       ('IMB18-F18L1W007', 'F18L1W007', 'IMB18', '1', '1', '0'),
       ('IMB18-F18L1W011', 'F18L1W011', 'IMB18', '1', '1', '0'),
       ('IMB18-F18L1W018', 'F18L1W018', 'IMB18', '1', '1', '0'),
       ('IMB18-F18L1W020', 'F18L1W020', 'IMB18', '1', '1', '0'),
       ('IMB18-F18L2S030', 'F18L2S030', 'IMB18', '0', '4', '100'),
       ('IMB18-F18L2S082', 'F18L2S082', 'IMB18', '0', '4', '100'),
       ('IMB18-F18L2S090', 'F18L2S090', 'IMB18', '0', '4', '100'),
       ('IMB18-F18L2S110', 'F18L2S110', 'IMB18', '0', '4', '100'),
       ('IMB18-F18L2S124', 'F18L2S124', 'IMB18', '0', '4', '100'),
       ('IMB18-F18L2W001', 'F18L2W001', 'IMB18', '1', '3', '0'),
       ('IMB18-F18L2W046', 'F18L2W046', 'IMB18', '1', '3', '0'),
       ('IMB18-F18L2W067', 'F18L2W067', 'IMB18', '1', '3', '0'),
       ('IMB18-F18L2W104', 'F18L2W104', 'IMB18', '0', '3', '100'),
       ('IMB18-F18L2W140', 'F18L2W140', 'IMB18', '0', '3', '100'),
       ('IMB18-F18L2W147', 'F18L2W147', 'IMB18', '0', '3', '100'),
       ('IMB18-F18L3S022', 'F18L3S022', 'IMB18', '0', '8', '100'),
       ('IMB18-F18L3S025', 'F18L3S025', 'IMB18', '0', '6', '100'),
       ('IMB18-F18L3S028', 'F18L3S028', 'IMB18', '0', '8', '100'),
       ('IMB18-F18L3S040', 'F18L3S040', 'IMB18', '0', '6', '100'),
       ('IMB18-F18L3S059', 'F18L3S059', 'IMB18', '1', '6', '0'),
       ('IMB18-F18L3S062', 'F18L3S062', 'IMB18', '1', '6', '0'),
       ('IMB18-F18L3S063', 'F18L3S063', 'IMB18', '1', '8', '0'),
       ('IMB18-F18L3S073', 'F18L3S073', 'IMB18', '0', '6', '100'),
       ('IMB18-F18L3S080', 'F18L3S080', 'IMB18', '0', '8', '100'),
       ('IMB18-F18L3S087', 'F18L3S087', 'IMB18', '0', '6', '100'),
       ('IMB18-F18L3S093', 'F18L3S093', 'IMB18', '0', '6', '100'),
       ('IMB18-F18L3S101', 'F18L3S101', 'IMB18', '0', '8', '100'),
       ('IMB18-F18L3S107', 'F18L3S107', 'IMB18', '0', '8', '100'),
       ('IMB18-F18L3S111', 'F18L3S111', 'IMB18', '0', '6', '100'),
       ('IMB18-F18L3S121', 'F18L3S121', 'IMB18', '0', '8', '100'),
       ('IMB18-F18L3S122', 'F18L3S122', 'IMB18', '0', '6', '100'),
       ('IMB18-F18L3S125', 'F18L3S125', 'IMB18', '0', '6', '100'),
       ('IMB18-F18L3S127', 'F18L3S127', 'IMB18', '0', '8', '100'),
       ('IMB18-F18L3S130', 'F18L3S130', 'IMB18', '0', '8', '100'),
       ('IMB18-F18L3S132', 'F18L3S132', 'IMB18', '0', '8', '100'),
       ('IMB18-F18L3S135', 'F18L3S135', 'IMB18', '0', '5', '100'),
       ('IMB18-F18L3S139', 'F18L3S139', 'IMB18', '0', '8', '100'),
       ('IMB18-F18L3S155', 'F18L3S155', 'IMB18', '0', '6', '100'),
       ('IMB18-F18L3S157', 'F18L3S157', 'IMB18', '0', '8', '100'),
       ('IMB18-F18L3S162', 'F18L3S162', 'IMB18', '0', '8', '100'),
       ('IMB18-F18L3S168', 'F18L3S168', 'IMB18', '1', '8', '0'),
       ('IMB18-F18L3W004', 'F18L3W004', 'IMB18', '1', '5', '0'),
       ('IMB18-F18L3W008', 'F18L3W008', 'IMB18', '0', '5', '100'),
       ('IMB18-F18L3W035', 'F18L3W035', 'IMB18', '0', '5', '100'),
       ('IMB18-F18L3W037', 'F18L3W037', 'IMB18', '0', '5', '100'),
       ('IMB18-F18L3W053', 'F18L3W053', 'IMB18', '0', '5', '100'),
       ('IMB18-F18L3W060', 'F18L3W060', 'IMB18', '1', '5', '0'),
       ('IMB18-F18L3W064', 'F18L3W064', 'IMB18', '1', '7', '0'),
       ('IMB18-F18L3W068', 'F18L3W068', 'IMB18', '1', '7', '0'),
       ('IMB18-F18L3W075', 'F18L3W075', 'IMB18', '0', '7', '100'),
       ('IMB18-F18L3W088', 'F18L3W088', 'IMB18', '0', '7', '100'),
       ('IMB18-F18L3W092', 'F18L3W092', 'IMB18', '0', '7', '100'),
       ('IMB18-F18L3W098', 'F18L3W098', 'IMB18', '0', '7', '100'),
       ('IMB18-F18L3W105', 'F18L3W105', 'IMB18', '0', '7', '100'),
       ('IMB18-F18L3W123', 'F18L3W123', 'IMB18', '0', '7', '100'),
       ('IMB18-F18L3W129', 'F18L3W129', 'IMB18', '0', '7', '100'),
       ('IMB18-F18L3W145', 'F18L3W145', 'IMB18', '0', '7', '100'),
       ('IMB18-F18L3W148', 'F18L3W148', 'IMB18', '0', '5', '100'),
       ('IMB18-F18W3S085', 'F18W3S085', 'IMB18', '0', '7', '100'),
       ('IMB18-F18W3S162', 'F18W3S162', 'IMB18', '0', '4', '100'),
       ('IMB18-F18L1S045', 'F18L1S045', 'IMB18', '1', '2', '0'),
       ('IMB18-F18L1S066', 'F18L1S066', 'IMB18', '1', '2', '0'),
       ('IMB18-F18L1S116', 'F18L1S116', 'IMB18', '0', '2', '100'),
       ('IMB18-F18L1S120', 'F18L1S120', 'IMB18', '0', '2', '100'),
       ('IMB18-F18L2S017', 'F18L2S017', 'IMB18', '1', '4', '0'),
       ('IMB18-F18L2S029', 'F18L2S029', 'IMB18', '0', '4', '100'),
       ('IMB18-F18L2S061', 'F18L2S061', 'IMB18', '1', '4', '0'),
       ('IMB18-F18L2S084', 'F18L2S084', 'IMB18', '0', '4', '100'),
       ('IMB18-F18L2W109', 'F18L2W109', 'IMB18', '0', '3', '100'),
       ('IMB18-F18L2W165', 'F18L2W165', 'IMB18', '0', '3', '100'),
       ('IMB18-F18L3S010', 'F18L3S010', 'IMB18', '0', '6', '100'),
       ('IMB18-F18L3S077', 'F18L3S077', 'IMB18', '0', '6', '100'),
       ('IMB18-F18L3S091', 'F18L3S091', 'IMB18', '0', '8', '100'),
       ('IMB18-F18L3S118', 'F18L3S118', 'IMB18', '0', '6', '100'),
       ('IMB18-F18L3S138', 'F18L3S138', 'IMB18', '0', '8', '100'),
       ('IMB18-F18L3S141', 'F18L3S141', 'IMB18', '0', '8', '100'),
       ('IMB18-F18L3S159', 'F18L3S159', 'IMB18', '0', '6', '100'),
       ('IMB18-F18L3W024', 'F18L3W024', 'IMB18', '0', '5', '100'),
       ('IMB18-F18L3W065', 'F18L3W065', 'IMB18', '1', '5', '0'),
       ('IMB18-F18L3W074', 'F18L3W074', 'IMB18', '0', '7', '100'),
       ('IMB18-F18L3W079', 'F18L3W079', 'IMB18', '0', '7', '100'),
       ('IMB18-F18L3W081', 'F18L3W081', 'IMB18', '0', '5', '100'),
       ('IMB18-F18L3W103', 'F18L3W103', 'IMB18', '0', '7', '100'),
       ('IMB18-F18L3W115', 'F18L3W115', 'IMB18', '0', '5', '100'),
       ('IMB18-F18L3W126', 'F18L3W126', 'IMB18', '0', '7', '100'),
       ('IMB18-F18L3W128', 'F18L3W128', 'IMB18', '0', '7', '100'),
       ('IMB18-F18L3W133', 'F18L3W133', 'IMB18', '0', '7', '100'),
       ('IMB18-F18L3W160', 'F18L3W160', 'IMB18', '0', '7', '100'),
       ('KE18-F18L1S013', 'F18L1S013', 'KE18', '1', '2', '0'),
       ('KE18-F18L1S015', 'F18L1S015', 'KE18', '0', '2', '100'),
       ('KE18-F18L1S016', 'F18L1S016', 'KE18', '1', '2', '0'),
       ('KE18-F18L1S023', 'F18L1S023', 'KE18', '0', '2', '100'),
       ('KE18-F18L1S026', 'F18L1S026', 'KE18', '0', '2', '100'),
       ('KE18-F18L1S034', 'F18L1S034', 'KE18', '0', '2', '100'),
       ('KE18-F18L1S052', 'F18L1S052', 'KE18', '1', '2', '0'),
       ('KE18-F18L1S146', 'F18L1S146', 'KE18', '0', '2', '100'),
       ('KE18-F18L1W005', 'F18L1W005', 'KE18', '0', '1', '100'),
       ('KE18-F18L1W007', 'F18L1W007', 'KE18', '1', '1', '0'),
       ('KE18-F18L1W011', 'F18L1W011', 'KE18', '1', '1', '0'),
       ('KE18-F18L1W018', 'F18L1W018', 'KE18', '1', '1', '0'),
       ('KE18-F18L1W020', 'F18L1W020', 'KE18', '1', '1', '0'),
       ('KE18-F18L1W070', 'F18L1W070', 'KE18', '1', '1', '0'),
       ('KE18-F18L2S030', 'F18L2S030', 'KE18', '0', '4', '100'),
       ('KE18-F18L2S042', 'F18L2S042', 'KE18', '0', '4', '100'),
       ('KE18-F18L2S051', 'F18L2S051', 'KE18', '1', '4', '0'),
       ('KE18-F18L2S082', 'F18L2S082', 'KE18', '0', '4', '100'),
       ('KE18-F18L2S097', 'F18L2S097', 'KE18', '0', '4', '100'),
       ('KE18-F18L2S099', 'F18L2S099', 'KE18', '0', '4', '100'),
       ('KE18-F18L2S110', 'F18L2S110', 'KE18', '0', '4', '100'),
       ('KE18-F18L2S124', 'F18L2S124', 'KE18', '0', '4', '100'),
       ('KE18-F18L2W001', 'F18L2W001', 'KE18', '1', '3', '0'),
       ('KE18-F18L2W006', 'F18L2W006', 'KE18', '0', '3', '100'),
       ('KE18-F18L2W096', 'F18L2W096', 'KE18', '0', '3', '100'),
       ('KE18-F18L2W140', 'F18L2W140', 'KE18', '0', '3', '100'),
       ('KE18-F18L3S019', 'F18L3S019', 'KE18', '0', '6', '100'),
       ('KE18-F18L3S022', 'F18L3S022', 'KE18', '0', '8', '100'),
       ('KE18-F18L3S028', 'F18L3S028', 'KE18', '0', '8', '100'),
       ('KE18-F18L3S054', 'F18L3S054', 'KE18', '1', '8', '0'),
       ('KE18-F18L3S056', 'F18L3S056', 'KE18', '1', '6', '0'),
       ('KE18-F18L3S057', 'F18L3S057', 'KE18', '1', '6', '0'),
       ('KE18-F18L3S062', 'F18L3S062', 'KE18', '0', '6', '100'),
       ('KE18-F18L3S069', 'F18L3S069', 'KE18', '1', '8', '0'),
       ('KE18-F18L3S071', 'F18L3S071', 'KE18', '1', '6', '0'),
       ('KE18-F18L3S086', 'F18L3S086', 'KE18', '0', '8', '100'),
       ('KE18-F18L3S093', 'F18L3S093', 'KE18', '0', '6', '100'),
       ('KE18-F18L3S094', 'F18L3S094', 'KE18', '0', '6', '100'),
       ('KE18-F18L3S107', 'F18L3S107', 'KE18', '0', '8', '100'),
       ('KE18-F18L3S113', 'F18L3S113', 'KE18', '0', '8', '100'),
       ('KE18-F18L3S121', 'F18L3S121', 'KE18', '0', '8', '100'),
       ('KE18-F18L3S127', 'F18L3S127', 'KE18', '0', '8', '100'),
       ('KE18-F18L3S135', 'F18L3S135', 'KE18', '0', '5', '100'),
       ('KE18-F18L3S155', 'F18L3S155', 'KE18', '0', '6', '100'),
       ('KE18-F18L3S162', 'F18L3S162', 'KE18', '0', '8', '100'),
       ('KE18-F18L3S166', 'F18L3S166', 'KE18', '0', '6', '100'),
       ('KE18-F18L3S168', 'F18L3S168', 'KE18', '1', '8', '0'),
       ('KE18-F18L3W004', 'F18L3W004', 'KE18', '1', '5', '0'),
       ('KE18-F18L3W008', 'F18L3W008', 'KE18', '0', '5', '100'),
       ('KE18-F18L3W035', 'F18L3W035', 'KE18', '0', '5', '100'),
       ('KE18-F18L3W050', 'F18L3W050', 'KE18', '1', '5', '0'),
       ('KE18-F18L3W053', 'F18L3W053', 'KE18', '1', '5', '0'),
       ('KE18-F18L3W055', 'F18L3W055', 'KE18', '1', '3', '0'),
       ('KE18-F18L3W058', 'F18L3W058', 'KE18', '1', '7', '0'),
       ('KE18-F18L3W060', 'F18L3W060', 'KE18', '0', '5', '100'),
       ('KE18-F18L3W092', 'F18L3W092', 'KE18', '0', '7', '100'),
       ('KE18-F18L3W108', 'F18L3W108', 'KE18', '0', '7', '100'),
       ('KE18-F18L3W123', 'F18L3W123', 'KE18', '0', '7', '100'),
       ('KE18-F18L3W129', 'F18L3W129', 'KE18', '0', '7', '100'),
       ('KE18-F18L3W136', 'F18L3W136', 'KE18', '0', '5', '100'),
       ('KE18-F18L3W148', 'F18L3W148', 'KE18', '0', '5', '100'),
       ('KE18-F18L3W161', 'F18L3W161', 'KE18', '0', '7', '100'),
       ('KE18-F18W3S085', 'F18W3S085', 'KE18', '0', '7', '100'),

       ('KE18-F18L1S045', 'F18L1S045', 'KE18', '1', '2', '0'),
       ('KE18-F18L1S116', 'F18L1S116', 'KE18', '0', '2', '100'),
       ('KE18-F18L1S120', 'F18L1S120', 'KE18', '0', '2', '100'),
       ('KE18-F18L2S017', 'F18L2S017', 'KE18', '1', '4', '0'),
       ('KE18-F18L2S029', 'F18L2S029', 'KE18', '0', '4', '100'),
       ('KE18-F18L2S084', 'F18L2S084', 'KE18', '0', '4', '100'),
       ('KE18-F18L2S114', 'F18L2S114', 'KE18', '0', '4', '100'),
       ('KE18-F18L2W014', 'F18L2W014', 'KE18', '1', '3', '0'),
       ('KE18-F18L2W109', 'F18L2W109', 'KE18', '0', '3', '100'),
       ('KE18-F18L2W165', 'F18L2W165', 'KE18', '0', '3', '100'),
       ('KE18-F18L2W167', 'F18L2W167', 'KE18', '0', '3', '100'),
       ('KE18-F18L3S010', 'F18L3S010', 'KE18', '0', '6', '100'),
       ('KE18-F18L3S083', 'F18L3S083', 'KE18', '0', '8', '100'),
       ('KE18-F18L3S118', 'F18L3S118', 'KE18', '0', '6', '100'),
       ('KE18-F18L3S141', 'F18L3S141', 'KE18', '0', '8', '100'),
       ('KE18-F18L3W024', 'F18L3W024', 'KE18', '0', '5', '100'),
       ('KE18-F18L3W081', 'F18L3W081', 'KE18', '0', '5', '100'),
       ('KE18-F18L3W103', 'F18L3W103', 'KE18', '0', '7', '100'),
       ('KE18-F18L3W115', 'F18L3W115', 'KE18', '0', '5', '100'),
       ('KE18-F18L3W126', 'F18L3W126', 'KE18', '0', '7', '100'),
       ('KE18-F18L3W128', 'F18L3W128', 'KE18', '0', '7', '100'),
       ('KE18-F18L3W137', 'F18L3W137', 'KE18', '0', '7', '100'),
       ('KE18-F18L3W152', 'F18L3W152', 'KE18', '0', '7', '100'),
       ('KI18-F18L1S015', 'F18L1S015', 'KI18', '0', '2', '100'),
       ('KI18-F18L1S016', 'F18L1S016', 'KI18', '1', '2', '0'),
       ('KI18-F18L1S026', 'F18L1S026', 'KI18', '0', '2', '100'),
       ('KI18-F18L1S034', 'F18L1S034', 'KI18', '1', '2', '0'),
       ('KI18-F18L1S146', 'F18L1S146', 'KI18', '0', '2', '100'),
       ('KI18-F18L1W011', 'F18L1W011', 'KI18', '1', '1', '0'),
       ('KI18-F18L1W018', 'F18L1W018', 'KI18', '1', '1', '0'),
       ('KI18-F18L1W020', 'F18L1W020', 'KI18', '1', '1', '0'),
       ('KI18-F18L1W033', 'F18L1W033', 'KI18', '1', '1', '0'),
       ('KI18-F18L1W041', 'F18L1W041', 'KI18', '1', '1', '0'),
       ('KI18-F18L1W049', 'F18L1W049', 'KI18', '1', '1', '0'),
       ('KI18-F18L2S002', 'F18L2S002', 'KI18', '0', '4', '100'),
       ('KI18-F18L2S030', 'F18L2S030', 'KI18', '0', '4', '100'),
       ('KI18-F18L2S042', 'F18L2S042', 'KI18', '1', '4', '0'),
       ('KI18-F18L2S082', 'F18L2S082', 'KI18', '0', '4', '100'),
       ('KI18-F18L2S090', 'F18L2S090', 'KI18', '0', '4', '100'),
       ('KI18-F18L2S095', 'F18L2S095', 'KI18', '0', '4', '100'),
       ('KI18-F18L2S097', 'F18L2S097', 'KI18', '0', '4', '100'),
       ('KI18-F18L2S110', 'F18L2S110', 'KI18', '0', '4', '100'),
       ('KI18-F18L2S124', 'F18L2S124', 'KI18', '0', '4', '100'),
       ('KI18-F18L2W001', 'F18L2W001', 'KI18', '1', '3', '0'),
       ('KI18-F18L2W006', 'F18L2W006', 'KI18', '1', '3', '0'),
       ('KI18-F18L2W046', 'F18L2W046', 'KI18', '1', '3', '0'),
       ('KI18-F18L2W104', 'F18L2W104', 'KI18', '0', '3', '100'),
       ('KI18-F18L2W140', 'F18L2W140', 'KI18', '0', '3', '100'),
       ('KI18-F18L2W147', 'F18L2W147', 'KI18', '0', '3', '100'),
       ('KI18-F18L3S012', 'F18L3S012', 'KI18', '0', '6', '100'),
       ('KI18-F18L3S019', 'F18L3S019', 'KI18', '0', '6', '100'),
       ('KI18-F18L3S022', 'F18L3S022', 'KI18', '1', '8', '0'),
       ('KI18-F18L3S028', 'F18L3S028', 'KI18', '0', '8', '100'),
       ('KI18-F18L3S036', 'F18L3S036', 'KI18', '0', '6', '100'),
       ('KI18-F18L3S040', 'F18L3S040', 'KI18', '1', '6', '0'),
       ('KI18-F18L3S047', 'F18L3S047', 'KI18', '1', '6', '0'),
       ('KI18-F18L3S059', 'F18L3S059', 'KI18', '0', '6', '100'),
       ('KI18-F18L3S062', 'F18L3S062', 'KI18', '0', '6', '100'),
       ('KI18-F18L3S063', 'F18L3S063', 'KI18', '0', '8', '100'),
       ('KI18-F18L3S073', 'F18L3S073', 'KI18', '0', '6', '100'),
       ('KI18-F18L3S078', 'F18L3S078', 'KI18', '0', '8', '100'),
       ('KI18-F18L3S080', 'F18L3S080', 'KI18', '0', '8', '100'),
       ('KI18-F18L3S086', 'F18L3S086', 'KI18', '0', '8', '100'),
       ('KI18-F18L3S087', 'F18L3S087', 'KI18', '0', '6', '100'),
       ('KI18-F18L3S093', 'F18L3S093', 'KI18', '0', '6', '100'),
       ('KI18-F18L3S101', 'F18L3S101', 'KI18', '0', '8', '100'),
       ('KI18-F18L3S107', 'F18L3S107', 'KI18', '0', '8', '100'),
       ('KI18-F18L3S113', 'F18L3S113', 'KI18', '0', '8', '100'),
       ('KI18-F18L3S121', 'F18L3S121', 'KI18', '0', '8', '100'),
       ('KI18-F18L3S122', 'F18L3S122', 'KI18', '0', '6', '100'),
       ('KI18-F18L3S125', 'F18L3S125', 'KI18', '0', '6', '100'),
       ('KI18-F18L3S127', 'F18L3S127', 'KI18', '0', '8', '100'),
       ('KI18-F18L3S132', 'F18L3S132', 'KI18', '0', '8', '100'),
       ('KI18-F18L3S135', 'F18L3S135', 'KI18', '0', '5', '100'),
       ('KI18-F18L3S149', 'F18L3S149', 'KI18', '0', '6', '100'),
       ('KI18-F18L3S150', 'F18L3S150', 'KI18', '0', '6', '100'),
       ('KI18-F18L3S153', 'F18L3S153', 'KI18', '0', '6', '100'),
       ('KI18-F18L3S155', 'F18L3S155', 'KI18', '0', '6', '100'),
       ('KI18-F18L3S158', 'F18L3S158', 'KI18', '0', '6', '100'),
       ('KI18-F18L3S162', 'F18L3S162', 'KI18', '0', '8', '100'),
       ('KI18-F18L3S163', 'F18L3S163', 'KI18', '0', '6', '100'),
       ('KI18-F18L3S168', 'F18L3S168', 'KI18', '1', '8', '0'),
       ('KI18-F18L3W004', 'F18L3W004', 'KI18', '1', '5', '0'),
       ('KI18-F18L3W008', 'F18L3W008', 'KI18', '0', '5', '100'),
       ('KI18-F18L3W009', 'F18L3W009', 'KI18', '0', '5', '100'),
       ('KI18-F18L3W035', 'F18L3W035', 'KI18', '0', '5', '100'),
       ('KI18-F18L3W037', 'F18L3W037', 'KI18', '0', '5', '100'),
       ('KI18-F18L3W038', 'F18L3W038', 'KI18', '0', '7', '100'),
       ('KI18-F18L3W044', 'F18L3W044', 'KI18', '1', '5', '0'),
       ('KI18-F18L3W048', 'F18L3W048', 'KI18', '1', '7', '0'),
       ('KI18-F18L3W053', 'F18L3W053', 'KI18', '0', '5', '100'),
       ('KI18-F18L3W060', 'F18L3W060', 'KI18', '0', '5', '100'),
       ('KI18-F18L3W064', 'F18L3W064', 'KI18', '0', '7', '100'),
       ('KI18-F18L3W068', 'F18L3W068', 'KI18', '0', '7', '100'),
       ('KI18-F18L3W072', 'F18L3W072', 'KI18', '0', '7', '100'),
       ('KI18-F18L3W088', 'F18L3W088', 'KI18', '0', '7', '100'),
       ('KI18-F18L3W089', 'F18L3W089', 'KI18', '0', '7', '100'),
       ('KI18-F18L3W092', 'F18L3W092', 'KI18', '0', '7', '100'),
       ('KI18-F18L3W098', 'F18L3W098', 'KI18', '0', '7', '100'),
       ('KI18-F18L3W108', 'F18L3W108', 'KI18', '0', '7', '100'),
       ('KI18-F18L3W123', 'F18L3W123', 'KI18', '0', '7', '100'),
       ('KI18-F18L3W129', 'F18L3W129', 'KI18', '0', '7', '100'),
       ('KI18-F18L3W131', 'F18L3W131', 'KI18', '0', '7', '100'),
       ('KI18-F18L3W136', 'F18L3W136', 'KI18', '0', '5', '100'),
       ('KI18-F18L3W144', 'F18L3W144', 'KI18', '0', '7', '100'),
       ('KI18-F18L3W145', 'F18L3W145', 'KI18', '0', '7', '100'),
       ('KI18-F18L3W148', 'F18L3W148', 'KI18', '0', '5', '100'),
       ('KI18-F18L3W161', 'F18L3W161', 'KI18', '0', '7', '100'),
       ('KI18-F18W3S085', 'F18W3S085', 'KI18', '0', '7', '100'),
       ('KI18-F18W3S162', 'F18W3S162', 'KI18', '0', '4', '100'),
       ('KI18-F18L1S045', 'F18L1S045', 'KI18', '1', '2', '0'),
       ('KI18-F18L1S066', 'F18L1S066', 'KI18', '0', '2', '100'),
       ('KI18-F18L1S116', 'F18L1S116', 'KI18', '0', '2', '100'),
       ('KI18-F18L1S120', 'F18L1S120', 'KI18', '0', '2', '100'),
       ('KI18-F18L2S017', 'F18L2S017', 'KI18', '1', '4', '0'),
       ('KI18-F18L2S029', 'F18L2S029', 'KI18', '1', '4', '0'),
       ('KI18-F18L2S061', 'F18L2S061', 'KI18', '0', '4', '100'),
       ('KI18-F18L2S084', 'F18L2S084', 'KI18', '0', '4', '100'),
       ('KI18-F18L2S114', 'F18L2S114', 'KI18', '0', '4', '100'),
       ('KI18-F18L2S164', 'F18L2S164', 'KI18', '0', '4', '100'),
       ('KI18-F18L2W109', 'F18L2W109', 'KI18', '0', '3', '100'),
       ('KI18-F18L2W165', 'F18L2W165', 'KI18', '0', '3', '100'),
       ('KI18-F18L2W167', 'F18L2W167', 'KI18', '0', '3', '100'),
       ('KI18-F18L3S010', 'F18L3S010', 'KI18', '0', '6', '100'),
       ('KI18-F18L3S077', 'F18L3S077', 'KI18', '0', '6', '100'),
       ('KI18-F18L3S083', 'F18L3S083', 'KI18', '0', '8', '100'),
       ('KI18-F18L3S118', 'F18L3S118', 'KI18', '0', '6', '100'),
       ('KI18-F18L3S138', 'F18L3S138', 'KI18', '0', '8', '100'),
       ('KI18-F18L3S141', 'F18L3S141', 'KI18', '0', '8', '100'),
       ('KI18-F18L3W024', 'F18L3W024', 'KI18', '0', '5', '100'),
       ('KI18-F18L3W027', 'F18L3W027', 'KI18', '0', '7', '100'),
       ('KI18-F18L3W065', 'F18L3W065', 'KI18', '0', '5', '100'),
       ('KI18-F18L3W074', 'F18L3W074', 'KI18', '0', '7', '100'),
       ('KI18-F18L3W079', 'F18L3W079', 'KI18', '0', '7', '100'),
       ('KI18-F18L3W081', 'F18L3W081', 'KI18', '0', '5', '100'),
       ('KI18-F18L3W103', 'F18L3W103', 'KI18', '0', '7', '100'),
       ('KI18-F18L3W115', 'F18L3W115', 'KI18', '0', '5', '100'),
       ('KI18-F18L3W117', 'F18L3W117', 'KI18', '0', '7', '100'),
       ('KI18-F18L3W126', 'F18L3W126', 'KI18', '0', '7', '100'),
       ('KI18-F18L3W128', 'F18L3W128', 'KI18', '0', '7', '100'),
       ('KI18-F18L3W133', 'F18L3W133', 'KI18', '0', '7', '100'),
       ('KI18-F18L3W137', 'F18L3W137', 'KI18', '0', '7', '100'),
       ('KI18-F18L3W152', 'F18L3W152', 'KI18', '0', '7', '100'),
       ('KN18-F18L1S003', 'F18L1S003', 'KN18', '1', '2', '0'),
       ('KN18-F18L1S015', 'F18L1S015', 'KN18', '0', '2', '100'),
       ('KN18-F18L1S016', 'F18L1S016', 'KN18', '1', '2', '0'),
       ('KN18-F18L1S026', 'F18L1S026', 'KN18', '0', '2', '100'),
       ('KN18-F18L1S032', 'F18L1S032', 'KN18', '1', '2', '0'),
       ('KN18-F18L1S034', 'F18L1S034', 'KN18', '1', '2', '0'),
       ('KN18-F18L1S146', 'F18L1S146', 'KN18', '0', '2', '100'),
       ('KN18-F18L1W007', 'F18L1W007', 'KN18', '1', '1', '0'),
       ('KN18-F18L1W018', 'F18L1W018', 'KN18', '1', '1', '0'),
       ('KN18-F18L1W020', 'F18L1W020', 'KN18', '1', '1', '0'),
       ('KN18-F18L1W031', 'F18L1W031', 'KN18', '1', '1', '0'),
       ('KN18-F18L1W033', 'F18L1W033', 'KN18', '1', '1', '0'),
       ('KN18-F18L2S002', 'F18L2S002', 'KN18', '0', '4', '100'),
       ('KN18-F18L2S030', 'F18L2S030', 'KN18', '1', '4', '0'),
       ('KN18-F18L2S042', 'F18L2S042', 'KN18', '0', '4', '100'),
       ('KN18-F18L2S082', 'F18L2S082', 'KN18', '0', '4', '100'),
       ('KN18-F18L2S090', 'F18L2S090', 'KN18', '0', '4', '100'),
       ('KN18-F18L2S095', 'F18L2S095', 'KN18', '0', '4', '100'),
       ('KN18-F18L2S097', 'F18L2S097', 'KN18', '0', '4', '100'),
       ('KN18-F18L2S110', 'F18L2S110', 'KN18', '0', '4', '100'),
       ('KN18-F18L2S124', 'F18L2S124', 'KN18', '0', '4', '100'),
       ('KN18-F18L2W001', 'F18L2W001', 'KN18', '1', '3', '0'),
       ('KN18-F18L2W006', 'F18L2W006', 'KN18', '1', '3', '0'),
       ('KN18-F18L2W104', 'F18L2W104', 'KN18', '0', '3', '100'),
       ('KN18-F18L2W140', 'F18L2W140', 'KN18', '0', '3', '100'),
       ('KN18-F18L3S012', 'F18L3S012', 'KN18', '0', '6', '100'),
       ('KN18-F18L3S019', 'F18L3S019', 'KN18', '0', '6', '100'),
       ('KN18-F18L3S022', 'F18L3S022', 'KN18', '0', '8', '100'),
       ('KN18-F18L3S025', 'F18L3S025', 'KN18', '0', '6', '100'),
       ('KN18-F18L3S028', 'F18L3S028', 'KN18', '0', '8', '100'),
       ('KN18-F18L3S036', 'F18L3S036', 'KN18', '1', '6', '0'),
       ('KN18-F18L3S039', 'F18L3S039', 'KN18', '1', '6', '0'),
       ('KN18-F18L3S040', 'F18L3S040', 'KN18', '0', '6', '100'),
       ('KN18-F18L3S047', 'F18L3S047', 'KN18', '0', '6', '100'),
       ('KN18-F18L3S059', 'F18L3S059', 'KN18', '0', '6', '100'),
       ('KN18-F18L3S062', 'F18L3S062', 'KN18', '0', '6', '100'),
       ('KN18-F18L3S073', 'F18L3S073', 'KN18', '0', '6', '100'),
       ('KN18-F18L3S078', 'F18L3S078', 'KN18', '0', '8', '100'),
       ('KN18-F18L3S080', 'F18L3S080', 'KN18', '0', '8', '100'),
       ('KN18-F18L3S086', 'F18L3S086', 'KN18', '0', '8', '100'),
       ('KN18-F18L3S087', 'F18L3S087', 'KN18', '0', '6', '100'),
       ('KN18-F18L3S093', 'F18L3S093', 'KN18', '0', '6', '100'),
       ('KN18-F18L3S102', 'F18L3S102', 'KN18', '0', '8', '100'),
       ('KN18-F18L3S107', 'F18L3S107', 'KN18', '0', '8', '100'),
       ('KN18-F18L3S112', 'F18L3S112', 'KN18', '0', '8', '100'),
       ('KN18-F18L3S113', 'F18L3S113', 'KN18', '0', '8', '100'),
       ('KN18-F18L3S121', 'F18L3S121', 'KN18', '0', '8', '100'),
       ('KN18-F18L3S122', 'F18L3S122', 'KN18', '0', '6', '100'),
       ('KN18-F18L3S125', 'F18L3S125', 'KN18', '0', '6', '100'),
       ('KN18-F18L3S127', 'F18L3S127', 'KN18', '0', '8', '100'),
       ('KN18-F18L3S132', 'F18L3S132', 'KN18', '0', '8', '100'),
       ('KN18-F18L3S135', 'F18L3S135', 'KN18', '0', '5', '100'),
       ('KN18-F18L3S139', 'F18L3S139', 'KN18', '0', '8', '100'),
       ('KN18-F18L3S149', 'F18L3S149', 'KN18', '0', '6', '100'),
       ('KN18-F18L3S150', 'F18L3S150', 'KN18', '0', '6', '100'),
       ('KN18-F18L3S151', 'F18L3S151', 'KN18', '0', '8', '100'),
       ('KN18-F18L3S153', 'F18L3S153', 'KN18', '0', '6', '100'),
       ('KN18-F18L3S155', 'F18L3S155', 'KN18', '0', '6', '100'),
       ('KN18-F18L3S157', 'F18L3S157', 'KN18', '0', '8', '100'),
       ('KN18-F18L3S158', 'F18L3S158', 'KN18', '0', '6', '100'),
       ('KN18-F18L3S162', 'F18L3S162', 'KN18', '0', '8', '100'),
       ('KN18-F18L3S163', 'F18L3S163', 'KN18', '0', '6', '100'),
       ('KN18-F18L3S168', 'F18L3S168', 'KN18', '1', '8', '0'),
       ('KN18-F18L3W004', 'F18L3W004', 'KN18', '1', '5', '0'),
       ('KN18-F18L3W008', 'F18L3W008', 'KN18', '0', '5', '100'),
       ('KN18-F18L3W009', 'F18L3W009', 'KN18', '0', '5', '100'),
       ('KN18-F18L3W035', 'F18L3W035', 'KN18', '1', '5', '0'),
       ('KN18-F18L3W037', 'F18L3W037', 'KN18', '1', '5', '0'),
       ('KN18-F18L3W038', 'F18L3W038', 'KN18', '1', '7', '0'),
       ('KN18-F18L3W048', 'F18L3W048', 'KN18', '0', '7', '100'),
       ('KN18-F18L3W053', 'F18L3W053', 'KN18', '0', '5', '100'),
       ('KN18-F18L3W060', 'F18L3W060', 'KN18', '0', '5', '100'),
       ('KN18-F18L3W064', 'F18L3W064', 'KN18', '0', '7', '100'),
       ('KN18-F18L3W068', 'F18L3W068', 'KN18', '0', '7', '100'),
       ('KN18-F18L3W072', 'F18L3W072', 'KN18', '0', '7', '100'),
       ('KN18-F18L3W075', 'F18L3W075', 'KN18', '0', '7', '100'),
       ('KN18-F18L3W076', 'F18L3W076', 'KN18', '0', '7', '100'),
       ('KN18-F18L3W088', 'F18L3W088', 'KN18', '0', '7', '100'),
       ('KN18-F18L3W089', 'F18L3W089', 'KN18', '0', '7', '100'),
       ('KN18-F18L3W092', 'F18L3W092', 'KN18', '0', '7', '100'),
       ('KN18-F18L3W108', 'F18L3W108', 'KN18', '0', '7', '100'),
       ('KN18-F18L3W123', 'F18L3W123', 'KN18', '0', '7', '100'),
       ('KN18-F18L3W129', 'F18L3W129', 'KN18', '0', '7', '100'),
       ('KN18-F18L3W131', 'F18L3W131', 'KN18', '0', '7', '100'),
       ('KN18-F18L3W136', 'F18L3W136', 'KN18', '0', '5', '100'),
       ('KN18-F18L3W142', 'F18L3W142', 'KN18', '0', '7', '100'),
       ('KN18-F18L3W144', 'F18L3W144', 'KN18', '0', '7', '100'),
       ('KN18-F18L3W145', 'F18L3W145', 'KN18', '0', '7', '100'),
       ('KN18-F18L3W148', 'F18L3W148', 'KN18', '0', '5', '100'),
       ('KN18-F18L3W154', 'F18L3W154', 'KN18', '0', '7', '100'),
       ('KN18-F18L3W156', 'F18L3W156', 'KN18', '0', '7', '100'),
       ('KN18-F18L3W161', 'F18L3W161', 'KN18', '0', '7', '100'),
       ('KN18-F18W3S085', 'F18W3S085', 'KN18', '0', '7', '100'),
       ('KN18-F18L1S116', 'F18L1S116', 'KN18', '0', '2', '100'),
       ('KN18-F18L1S120', 'F18L1S120', 'KN18', '0', '2', '100'),
       ('KN18-F18L2S017', 'F18L2S017', 'KN18', '1', '4', '0'),
       ('KN18-F18L2S029', 'F18L2S029', 'KN18', '1', '4', '0'),
       ('KN18-F18L2S061', 'F18L2S061', 'KN18', '0', '4', '100'),
       ('KN18-F18L2S084', 'F18L2S084', 'KN18', '0', '4', '100'),
       ('KN18-F18L2S114', 'F18L2S114', 'KN18', '0', '4', '100'),
       ('KN18-F18L2S164', 'F18L2S164', 'KN18', '0', '4', '100'),
       ('KN18-F18L2W014', 'F18L2W014', 'KN18', '1', '3', '0'),
       ('KN18-F18L2W109', 'F18L2W109', 'KN18', '0', '3', '100'),
       ('KN18-F18L2W165', 'F18L2W165', 'KN18', '0', '3', '100'),
       ('KN18-F18L2W167', 'F18L2W167', 'KN18', '0', '3', '100'),
       ('KN18-F18L3S010', 'F18L3S010', 'KN18', '1', '6', '0'),
       ('KN18-F18L3S077', 'F18L3S077', 'KN18', '0', '6', '100'),
       ('KN18-F18L3S083', 'F18L3S083', 'KN18', '0', '8', '100'),
       ('KN18-F18L3S091', 'F18L3S091', 'KN18', '0', '8', '100'),
       ('KN18-F18L3S106', 'F18L3S106', 'KN18', '0', '8', '100'),
       ('KN18-F18L3S118', 'F18L3S118', 'KN18', '0', '6', '100'),
       ('KN18-F18L3S138', 'F18L3S138', 'KN18', '0', '8', '100'),
       ('KN18-F18L3S141', 'F18L3S141', 'KN18', '0', '8', '100'),
       ('KN18-F18L3W024', 'F18L3W024', 'KN18', '0', '5', '100'),
       ('KN18-F18L3W027', 'F18L3W027', 'KN18', '0', '7', '100'),
       ('KN18-F18L3W065', 'F18L3W065', 'KN18', '0', '5', '100'),
       ('KN18-F18L3W074', 'F18L3W074', 'KN18', '0', '7', '100'),
       ('KN18-F18L3W079', 'F18L3W079', 'KN18', '0', '7', '100'),
       ('KN18-F18L3W081', 'F18L3W081', 'KN18', '0', '5', '100'),
       ('KN18-F18L3W103', 'F18L3W103', 'KN18', '0', '7', '100'),
       ('KN18-F18L3W115', 'F18L3W115', 'KN18', '0', '5', '100'),
       ('KN18-F18L3W126', 'F18L3W126', 'KN18', '0', '7', '100'),
       ('KN18-F18L3W128', 'F18L3W128', 'KN18', '0', '7', '100'),
       ('KN18-F18L3W137', 'F18L3W137', 'KN18', '0', '7', '100'),
       ('KN18-F18L3W152', 'F18L3W152', 'KN18', '0', '7', '100'),
       ('PET18-F18L1S003', 'F18L1S003', 'PET18', '1', '2', '0'),
       ('PET18-F18L1S013', 'F18L1S013', 'PET18', '0', '2', '100'),
       ('PET18-F18L1S015', 'F18L1S015', 'PET18', '0', '2', '100'),
       ('PET18-F18L1S016', 'F18L1S016', 'PET18', '1', '2', '0'),
       ('PET18-F18L1S023', 'F18L1S023', 'PET18', '1', '2', '0'),
       ('PET18-F18L1S026', 'F18L1S026', 'PET18', '1', '2', '0'),
       ('PET18-F18L1S034', 'F18L1S034', 'PET18', '0', '2', '100'),
       ('PET18-F18L1S052', 'F18L1S052', 'PET18', '0', '2', '100'),
       ('PET18-F18L1S146', 'F18L1S146', 'PET18', '0', '2', '100'),
       ('PET18-F18L1W005', 'F18L1W005', 'PET18', '1', '1', '0'),
       ('PET18-F18L1W007', 'F18L1W007', 'PET18', '1', '1', '0'),
       ('PET18-F18L1W011', 'F18L1W011', 'PET18', '1', '1', '0'),
       ('PET18-F18L1W018', 'F18L1W018', 'PET18', '1', '1', '0'),
       ('PET18-F18L1W020', 'F18L1W020', 'PET18', '1', '1', '0'),
       ('PET18-F18L2S002', 'F18L2S002', 'PET18', '0', '4', '100'),
       ('PET18-F18L2S030', 'F18L2S030', 'PET18', '0', '4', '100'),
       ('PET18-F18L2S042', 'F18L2S042', 'PET18', '0', '4', '100'),
       ('PET18-F18L2S082', 'F18L2S082', 'PET18', '0', '4', '100'),
       ('PET18-F18L2S090', 'F18L2S090', 'PET18', '0', '4', '100'),
       ('PET18-F18L2S097', 'F18L2S097', 'PET18', '0', '4', '100'),
       ('PET18-F18L2S099', 'F18L2S099', 'PET18', '0', '4', '100'),
       ('PET18-F18L2S100', 'F18L2S100', 'PET18', '0', '3', '100'),
       ('PET18-F18L2S110', 'F18L2S110', 'PET18', '0', '4', '100'),
       ('PET18-F18L2S119', 'F18L2S119', 'PET18', '0', '4', '100'),
       ('PET18-F18L2S124', 'F18L2S124', 'PET18', '0', '4', '100'),
       ('PET18-F18L2W001', 'F18L2W001', 'PET18', '1', '3', '0'),
       ('PET18-F18L2W096', 'F18L2W096', 'PET18', '0', '3', '100'),
       ('PET18-F18L2W140', 'F18L2W140', 'PET18', '0', '3', '100'),
       ('PET18-F18L3S012', 'F18L3S012', 'PET18', '0', '6', '100'),
       ('PET18-F18L3S019', 'F18L3S019', 'PET18', '0', '6', '100'),
       ('PET18-F18L3S022', 'F18L3S022', 'PET18', '1', '8', '0'),
       ('PET18-F18L3S025', 'F18L3S025', 'PET18', '1', '6', '0'),
       ('PET18-F18L3S028', 'F18L3S028', 'PET18', '1', '8', '0'),
       ('PET18-F18L3S036', 'F18L3S036', 'PET18', '0', '6', '100'),
       ('PET18-F18L3S040', 'F18L3S040', 'PET18', '0', '6', '100'),
       ('PET18-F18L3S062', 'F18L3S062', 'PET18', '0', '6', '100'),
       ('PET18-F18L3S073', 'F18L3S073', 'PET18', '0', '6', '100'),
       ('PET18-F18L3S078', 'F18L3S078', 'PET18', '0', '8', '100'),
       ('PET18-F18L3S080', 'F18L3S080', 'PET18', '0', '8', '100'),
       ('PET18-F18L3S086', 'F18L3S086', 'PET18', '0', '8', '100'),
       ('PET18-F18L3S087', 'F18L3S087', 'PET18', '0', '6', '100'),
       ('PET18-F18L3S102', 'F18L3S102', 'PET18', '0', '8', '100'),
       ('PET18-F18L3S107', 'F18L3S107', 'PET18', '0', '8', '100'),
       ('PET18-F18L3S113', 'F18L3S113', 'PET18', '0', '8', '100'),
       ('PET18-F18L3S121', 'F18L3S121', 'PET18', '0', '8', '100'),
       ('PET18-F18L3S127', 'F18L3S127', 'PET18', '0', '8', '100'),
       ('PET18-F18L3S130', 'F18L3S130', 'PET18', '0', '8', '100'),
       ('PET18-F18L3S132', 'F18L3S132', 'PET18', '0', '8', '100'),
       ('PET18-F18L3S135', 'F18L3S135', 'PET18', '0', '5', '100'),
       ('PET18-F18L3S150', 'F18L3S150', 'PET18', '0', '6', '100'),
       ('PET18-F18L3S155', 'F18L3S155', 'PET18', '0', '6', '100'),
       ('PET18-F18L3S157', 'F18L3S157', 'PET18', '0', '8', '100'),
       ('PET18-F18L3S162', 'F18L3S162', 'PET18', '0', '8', '100'),
       ('PET18-F18L3S168', 'F18L3S168', 'PET18', '1', '8', '0'),
       ('PET18-F18L3W004', 'F18L3W004', 'PET18', '1', '5', '0'),
       ('PET18-F18L3W008', 'F18L3W008', 'PET18', '1', '5', '0'),
       ('PET18-F18L3W009', 'F18L3W009', 'PET18', '0', '5', '100'),
       ('PET18-F18L3W021', 'F18L3W021', 'PET18', '1', '7', '0'),
       ('PET18-F18L3W035', 'F18L3W035', 'PET18', '0', '5', '100'),
       ('PET18-F18L3W038', 'F18L3W038', 'PET18', '0', '7', '100'),
       ('PET18-F18L3W048', 'F18L3W048', 'PET18', '0', '7', '100'),
       ('PET18-F18L3W053', 'F18L3W053', 'PET18', '0', '5', '100'),
       ('PET18-F18L3W060', 'F18L3W060', 'PET18', '0', '5', '100'),
       ('PET18-F18L3W068', 'F18L3W068', 'PET18', '0', '7', '100'),
       ('PET18-F18L3W072', 'F18L3W072', 'PET18', '0', '7', '100'),
       ('PET18-F18L3W075', 'F18L3W075', 'PET18', '0', '7', '100'),
       ('PET18-F18L3W088', 'F18L3W088', 'PET18', '0', '7', '100'),
       ('PET18-F18L3W089', 'F18L3W089', 'PET18', '0', '7', '100'),
       ('PET18-F18L3W092', 'F18L3W092', 'PET18', '0', '7', '100'),
       ('PET18-F18L3W105', 'F18L3W105', 'PET18', '0', '7', '100'),
       ('PET18-F18L3W108', 'F18L3W108', 'PET18', '0', '7', '100'),
       ('PET18-F18L3W123', 'F18L3W123', 'PET18', '0', '7', '100'),
       ('PET18-F18L3W129', 'F18L3W129', 'PET18', '0', '7', '100'),
       ('PET18-F18L3W136', 'F18L3W136', 'PET18', '0', '5', '100'),
       ('PET18-F18L3W148', 'F18L3W148', 'PET18', '0', '5', '100'),
       ('PET18-F18L3W156', 'F18L3W156', 'PET18', '0', '7', '100'),
       ('PET18-F18L3W161', 'F18L3W161', 'PET18', '0', '7', '100'),
       ('PET18-F18W3S085', 'F18W3S085', 'PET18', '0', '7', '100'),
       ('PET18-F18L1S116', 'F18L1S116', 'PET18', '0', '2', '100'),
       ('PET18-F18L1S120', 'F18L1S120', 'PET18', '0', '2', '100'),
       ('PET18-F18L2S017', 'F18L2S017', 'PET18', '1', '4', '0'),
       ('PET18-F18L2S029', 'F18L2S029', 'PET18', '1', '4', '0'),
       ('PET18-F18L2S061', 'F18L2S061', 'PET18', '0', '4', '100'),
       ('PET18-F18L2S084', 'F18L2S084', 'PET18', '0', '4', '100'),
       ('PET18-F18L2S114', 'F18L2S114', 'PET18', '0', '4', '100'),
       ('PET18-F18L2W014', 'F18L2W014', 'PET18', '1', '3', '0'),
       ('PET18-F18L2W109', 'F18L2W109', 'PET18', '0', '3', '100'),
       ('PET18-F18L2W165', 'F18L2W165', 'PET18', '0', '3', '100'),
       ('PET18-F18L2W167', 'F18L2W167', 'PET18', '0', '3', '100'),
       ('PET18-F18L3S010', 'F18L3S010', 'PET18', '1', '6', '0'),
       ('PET18-F18L3S077', 'F18L3S077', 'PET18', '0', '6', '100'),
       ('PET18-F18L3S091', 'F18L3S091', 'PET18', '0', '8', '100'),
       ('PET18-F18L3S106', 'F18L3S106', 'PET18', '0', '8', '100'),
       ('PET18-F18L3S118', 'F18L3S118', 'PET18', '0', '6', '100'),
       ('PET18-F18L3S138', 'F18L3S138', 'PET18', '0', '8', '100'),
       ('PET18-F18L3S141', 'F18L3S141', 'PET18', '0', '8', '100'),
       ('PET18-F18L3S159', 'F18L3S159', 'PET18', '0', '6', '100'),
       ('PET18-F18L3W024', 'F18L3W024', 'PET18', '1', '5', '0'),
       ('PET18-F18L3W027', 'F18L3W027', 'PET18', '1', '7', '0'),
       ('PET18-F18L3W074', 'F18L3W074', 'PET18', '0', '7', '100'),
       ('PET18-F18L3W079', 'F18L3W079', 'PET18', '0', '7', '100'),
       ('PET18-F18L3W081', 'F18L3W081', 'PET18', '0', '5', '100'),
       ('PET18-F18L3W103', 'F18L3W103', 'PET18', '0', '7', '100'),
       ('PET18-F18L3W115', 'F18L3W115', 'PET18', '0', '5', '100'),
       ('PET18-F18L3W126', 'F18L3W126', 'PET18', '0', '7', '100'),
       ('PET18-F18L3W128', 'F18L3W128', 'PET18', '0', '7', '100'),
       ('PET18-F18L3W137', 'F18L3W137', 'PET18', '0', '7', '100'),
       ('PET18-F18L3W152', 'F18L3W152', 'PET18', '0', '7', '100'),
       ('PET18-F18L3W160', 'F18L3W160', 'PET18', '0', '7', '100'),
       ('SIIS18-F18L1S003', 'F18L1S003', 'SIIS18', '1', '2', '0'),
       ('SIIS18-F18L1S013', 'F18L1S013', 'SIIS18', '1', '2', '0'),
       ('SIIS18-F18L1S015', 'F18L1S015', 'SIIS18', '1', '2', '0'),
       ('SIIS18-F18L1S016', 'F18L1S016', 'SIIS18', '1', '2', '0'),
       ('SIIS18-F18L1S026', 'F18L1S026', 'SIIS18', '0', '2', '100'),
       ('SIIS18-F18L1S034', 'F18L1S034', 'SIIS18', '0', '2', '100'),
       ('SIIS18-F18L1S146', 'F18L1S146', 'SIIS18', '0', '2', '100'),
       ('SIIS18-F18L1W005', 'F18L1W005', 'SIIS18', '1', '1', '0'),
       ('SIIS18-F18L1W007', 'F18L1W007', 'SIIS18', '1', '1', '0'),
       ('SIIS18-F18L1W011', 'F18L1W011', 'SIIS18', '1', '1', '0'),
       ('SIIS18-F18L1W018', 'F18L1W018', 'SIIS18', '1', '1', '0'),
       ('SIIS18-F18L1W020', 'F18L1W020', 'SIIS18', '1', '1', '0'),
       ('SIIS18-F18L2S002', 'F18L2S002', 'SIIS18', '1', '4', '0'),
       ('SIIS18-F18L2S030', 'F18L2S030', 'SIIS18', '0', '4', '100'),
       ('SIIS18-F18L2S042', 'F18L2S042', 'SIIS18', '0', '4', '100'),
       ('SIIS18-F18L2S082', 'F18L2S082', 'SIIS18', '0', '4', '100'),
       ('SIIS18-F18L2S090', 'F18L2S090', 'SIIS18', '0', '4', '100'),
       ('SIIS18-F18L2S095', 'F18L2S095', 'SIIS18', '0', '4', '100'),
       ('SIIS18-F18L2S097', 'F18L2S097', 'SIIS18', '0', '4', '100'),
       ('SIIS18-F18L2S099', 'F18L2S099', 'SIIS18', '0', '4', '100'),
       ('SIIS18-F18L2S100', 'F18L2S100', 'SIIS18', '0', '3', '100'),
       ('SIIS18-F18L2S110', 'F18L2S110', 'SIIS18', '0', '4', '100'),
       ('SIIS18-F18L2S119', 'F18L2S119', 'SIIS18', '0', '4', '100'),
       ('SIIS18-F18L2S124', 'F18L2S124', 'SIIS18', '0', '4', '100'),
       ('SIIS18-F18L2W001', 'F18L2W001', 'SIIS18', '1', '3', '0'),
       ('SIIS18-F18L2W006', 'F18L2W006', 'SIIS18', '1', '3', '0'),
       ('SIIS18-F18L2W104', 'F18L2W104', 'SIIS18', '0', '3', '100'),
       ('SIIS18-F18L2W140', 'F18L2W140', 'SIIS18', '0', '3', '100'),
       ('SIIS18-F18L3S012', 'F18L3S012', 'SIIS18', '1', '6', '0'),
       ('SIIS18-F18L3S019', 'F18L3S019', 'SIIS18', '1', '6', '0'),
       ('SIIS18-F18L3S022', 'F18L3S022', 'SIIS18', '1', '8', '0'),
       ('SIIS18-F18L3S025', 'F18L3S025', 'SIIS18', '0', '6', '100'),
       ('SIIS18-F18L3S028', 'F18L3S028', 'SIIS18', '0', '8', '100'),
       ('SIIS18-F18L3S036', 'F18L3S036', 'SIIS18', '0', '6', '100'),
       ('SIIS18-F18L3S039', 'F18L3S039', 'SIIS18', '0', '6', '100'),
       ('SIIS18-F18L3S040', 'F18L3S040', 'SIIS18', '0', '6', '100'),
       ('SIIS18-F18L3S047', 'F18L3S047', 'SIIS18', '0', '6', '100'),
       ('SIIS18-F18L3S062', 'F18L3S062', 'SIIS18', '0', '6', '100'),
       ('SIIS18-F18L3S073', 'F18L3S073', 'SIIS18', '0', '6', '100'),
       ('SIIS18-F18L3S078', 'F18L3S078', 'SIIS18', '0', '8', '100'),
       ('SIIS18-F18L3S080', 'F18L3S080', 'SIIS18', '0', '8', '100'),
       ('SIIS18-F18L3S086', 'F18L3S086', 'SIIS18', '0', '8', '100'),
       ('SIIS18-F18L3S087', 'F18L3S087', 'SIIS18', '0', '6', '100'),
       ('SIIS18-F18L3S093', 'F18L3S093', 'SIIS18', '0', '6', '100'),
       ('SIIS18-F18L3S102', 'F18L3S102', 'SIIS18', '0', '8', '100'),
       ('SIIS18-F18L3S107', 'F18L3S107', 'SIIS18', '0', '8', '100'),
       ('SIIS18-F18L3S113', 'F18L3S113', 'SIIS18', '0', '8', '100'),
       ('SIIS18-F18L3S121', 'F18L3S121', 'SIIS18', '0', '8', '100'),
       ('SIIS18-F18L3S127', 'F18L3S127', 'SIIS18', '0', '8', '100'),
       ('SIIS18-F18L3S130', 'F18L3S130', 'SIIS18', '0', '8', '100'),
       ('SIIS18-F18L3S132', 'F18L3S132', 'SIIS18', '0', '8', '100'),
       ('SIIS18-F18L3S135', 'F18L3S135', 'SIIS18', '0', '5', '100'),
       ('SIIS18-F18L3S149', 'F18L3S149', 'SIIS18', '0', '6', '100'),
       ('SIIS18-F18L3S150', 'F18L3S150', 'SIIS18', '0', '6', '100'),
       ('SIIS18-F18L3S155', 'F18L3S155', 'SIIS18', '0', '6', '100'),
       ('SIIS18-F18L3S157', 'F18L3S157', 'SIIS18', '0', '8', '100'),
       ('SIIS18-F18L3S162', 'F18L3S162', 'SIIS18', '0', '8', '100'),
       ('SIIS18-F18L3S163', 'F18L3S163', 'SIIS18', '0', '6', '100'),
       ('SIIS18-F18L3S168', 'F18L3S168', 'SIIS18', '1', '8', '0'),
       ('SIIS18-F18L3W004', 'F18L3W004', 'SIIS18', '1', '5', '0'),
       ('SIIS18-F18L3W008', 'F18L3W008', 'SIIS18', '1', '5', '0'),
       ('SIIS18-F18L3W009', 'F18L3W009', 'SIIS18', '1', '5', '0'),
       ('SIIS18-F18L3W021', 'F18L3W021', 'SIIS18', '1', '7', '0'),
       ('SIIS18-F18L3W035', 'F18L3W035', 'SIIS18', '0', '5', '100'),
       ('SIIS18-F18L3W038', 'F18L3W038', 'SIIS18', '0', '7', '100'),
       ('SIIS18-F18L3W048', 'F18L3W048', 'SIIS18', '0', '7', '100'),
       ('SIIS18-F18L3W053', 'F18L3W053', 'SIIS18', '0', '5', '100'),
       ('SIIS18-F18L3W060', 'F18L3W060', 'SIIS18', '0', '5', '100'),
       ('SIIS18-F18L3W068', 'F18L3W068', 'SIIS18', '0', '7', '100'),
       ('SIIS18-F18L3W072', 'F18L3W072', 'SIIS18', '0', '7', '100'),
       ('SIIS18-F18L3W075', 'F18L3W075', 'SIIS18', '0', '7', '100'),
       ('SIIS18-F18L3W088', 'F18L3W088', 'SIIS18', '0', '7', '100'),
       ('SIIS18-F18L3W089', 'F18L3W089', 'SIIS18', '0', '7', '100'),
       ('SIIS18-F18L3W092', 'F18L3W092', 'SIIS18', '0', '7', '100'),
       ('SIIS18-F18L3W105', 'F18L3W105', 'SIIS18', '0', '7', '100'),
       ('SIIS18-F18L3W108', 'F18L3W108', 'SIIS18', '0', '7', '100'),
       ('SIIS18-F18L3W123', 'F18L3W123', 'SIIS18', '0', '7', '100'),
       ('SIIS18-F18L3W129', 'F18L3W129', 'SIIS18', '0', '7', '100'),
       ('SIIS18-F18L3W136', 'F18L3W136', 'SIIS18', '0', '5', '100'),
       ('SIIS18-F18L3W142', 'F18L3W142', 'SIIS18', '0', '7', '100'),
       ('SIIS18-F18L3W144', 'F18L3W144', 'SIIS18', '0', '7', '100'),
       ('SIIS18-F18L3W148', 'F18L3W148', 'SIIS18', '0', '5', '100'),
       ('SIIS18-F18L3W154', 'F18L3W154', 'SIIS18', '0', '7', '100'),
       ('SIIS18-F18L3W156', 'F18L3W156', 'SIIS18', '0', '7', '100'),
       ('SIIS18-F18L3W161', 'F18L3W161', 'SIIS18', '0', '7', '100'),
       ('SIIS18-F18W3S085', 'F18W3S085', 'SIIS18', '0', '7', '100'),
       ('SIIS18-F18L1S066', 'F18L1S066', 'SIIS18', '0', '2', '100'),
       ('SIIS18-F18L1S116', 'F18L1S116', 'SIIS18', '0', '2', '100'),
       ('SIIS18-F18L1S120', 'F18L1S120', 'SIIS18', '0', '2', '100'),
       ('SIIS18-F18L2S017', 'F18L2S017', 'SIIS18', '1', '4', '0'),
       ('SIIS18-F18L2S061', 'F18L2S061', 'SIIS18', '0', '4', '100'),
       ('SIIS18-F18L2S084', 'F18L2S084', 'SIIS18', '0', '4', '100'),
       ('SIIS18-F18L2S114', 'F18L2S114', 'SIIS18', '0', '4', '100'),
       ('SIIS18-F18L2S164', 'F18L2S164', 'SIIS18', '0', '4', '100'),
       ('SIIS18-F18L2W014', 'F18L2W014', 'SIIS18', '1', '3', '0'),
       ('SIIS18-F18L2W109', 'F18L2W109', 'SIIS18', '0', '3', '100'),
       ('SIIS18-F18L2W165', 'F18L2W165', 'SIIS18', '0', '3', '100'),
       ('SIIS18-F18L2W167', 'F18L2W167', 'SIIS18', '0', '3', '100'),
       ('SIIS18-F18L3S010', 'F18L3S010', 'SIIS18', '1', '6', '0'),
       ('SIIS18-F18L3S077', 'F18L3S077', 'SIIS18', '0', '6', '100'),
       ('SIIS18-F18L3S083', 'F18L3S083', 'SIIS18', '0', '8', '100'),
       ('SIIS18-F18L3S091', 'F18L3S091', 'SIIS18', '0', '8', '100'),
       ('SIIS18-F18L3S106', 'F18L3S106', 'SIIS18', '0', '8', '100'),
       ('SIIS18-F18L3S118', 'F18L3S118', 'SIIS18', '0', '6', '100'),
       ('SIIS18-F18L3S138', 'F18L3S138', 'SIIS18', '0', '8', '100'),
       ('SIIS18-F18L3S141', 'F18L3S141', 'SIIS18', '0', '8', '100'),
       ('SIIS18-F18L3S159', 'F18L3S159', 'SIIS18', '0', '6', '100'),
       ('SIIS18-F18L3W024', 'F18L3W024', 'SIIS18', '0', '5', '100'),
       ('SIIS18-F18L3W027', 'F18L3W027', 'SIIS18', '0', '7', '100'),
       ('SIIS18-F18L3W074', 'F18L3W074', 'SIIS18', '0', '7', '100'),
       ('SIIS18-F18L3W079', 'F18L3W079', 'SIIS18', '0', '7', '100'),
       ('SIIS18-F18L3W081', 'F18L3W081', 'SIIS18', '0', '5', '100'),
       ('SIIS18-F18L3W103', 'F18L3W103', 'SIIS18', '0', '7', '100'),
       ('SIIS18-F18L3W115', 'F18L3W115', 'SIIS18', '0', '5', '100'),
       ('SIIS18-F18L3W126', 'F18L3W126', 'SIIS18', '0', '7', '100'),
       ('SIIS18-F18L3W128', 'F18L3W128', 'SIIS18', '0', '7', '100'),
       ('SIIS18-F18L3W137', 'F18L3W137', 'SIIS18', '0', '7', '100'),
       ('SIIS18-F18L3W152', 'F18L3W152', 'SIIS18', '0', '7', '100'),
       ('SIIS18-F18L3W160', 'F18L3W160', 'SIIS18', '0', '7', '100');

update study_program_details
set subject_restrictions='Во наставната програма е предвидено да има 14 задолжителни предмети, и 6 изборни предмети.
Студентот може да избере од понудените предмети на оваа студиска програма. Студентот може да добие најмногу 6 ЕКТС кредити од екстракурикуларни активности одобрени од наставно научниот совет на факултетот. Положените предмети и освоените кредити ќе бидат дел од листата на положени предмети во уверението за положени предмети по завршување на студиите. Предуслови за предметите не важат за оваа студиска програма.
Студентите кои ќе ги завршат овие студии, ќе можат да продолжат на академските студии од прв циклус на насоката Примена на информациски технологии, при што сите положени предмети ќе бидат еквивалентирани со соодветните предмети на таа насока. '
where id = 'SSP23';

update study_program_details
set subject_restrictions='Во наставната програма е предвидено да има 22 задолжителни предмети, и 9 изборни предмети.
Сите изборни предмети се поделени во три групи на тежина (Н1, Н2 и Н3). Тежината е прикажана во кодот на предметите. Предмети што содржат L1 се предмети од група на тежина Н1. Предмети што содржат L2 се предмети од група на тежина Н2. Предмети што во кодот содржат L3, се предмети од група на тежина Н3. Правилата за изборност на предмети според нивото се дефинирани како:
•   Број на предмети од Н1- вкупниот број кредити на избрани изборни предмети од групата Н1 не смее да надминува 6 кредити.
•   Број на предмети од Н2- вкупниот број кредити на избрани изборни предмети од групата Н2 не смее да надминува 36 кредити.
•   Број на предмети од Н3 – нема ограничување во бројот на избрани предмети од групата Н3.
•   Предуслови за предметите не важат за оваа студиска програма.
Студентот може да избере и повеќе предмети од групата Н1 и групата Н2 од предвидениот број, но, во тој случај кредитите освоени за овие предмети не влегуваат во вкупниот број на кредити потребни за стекнување на дипломата. Студентот може да добие најмногу 6 ЕКТС кредити од екстракурикуларни активности одобрени од наставно научниот совет на факултетот. Положените предмети и освоените кредити ќе бидат дел од листата на положени предмети во уверението за положени предмети по завршување на факултетот.'
where id like 'SSP23_3';

update subject_details set cycle='UNDERGRADUATE' where cycle='1';

update study_program_subject
set subject_group=''
where subject_group in ('0', '100');